Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xa2 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x689f2): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x25997): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x31267): C:/Users/Kamil/Documents/ST_Projects/NITI_TestTask/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x4a112): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x367c1): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8

    <240>   DW_AT_name        : (indirect string, offset: 0x8b767): USART6_IRQn
    <244>   DW_AT_const_value : 71
 <2><245>: Abbrev Number: 4 (DW_TAG_enumerator)
    <246>   DW_AT_name        : (indirect string, offset: 0x8e27e): I2C3_EV_IRQn
    <24a>   DW_AT_const_value : 72
 <2><24b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <24c>   DW_AT_name        : (indirect string, offset: 0x8a640): I2C3_ER_IRQn
    <250>   DW_AT_const_value : 73
 <2><251>: Abbrev Number: 4 (DW_TAG_enumerator)
    <252>   DW_AT_name        : (indirect string, offset: 0x89da3): FPU_IRQn
    <256>   DW_AT_const_value : 81
 <2><257>: Abbrev Number: 4 (DW_TAG_enumerator)
    <258>   DW_AT_name        : (indirect string, offset: 0x8b9c2): SPI4_IRQn
    <25c>   DW_AT_const_value : 84
 <2><25d>: Abbrev Number: 0
 <1><25e>: Abbrev Number: 5 (DW_TAG_base_type)
    <25f>   DW_AT_byte_size   : 1
    <260>   DW_AT_encoding    : 6	(signed char)
    <261>   DW_AT_name        : (indirect string, offset: 0x671a5): signed char
 <1><265>: Abbrev Number: 6 (DW_TAG_typedef)
    <266>   DW_AT_name        : (indirect string, offset: 0x8e0ac): IRQn_Type
    <26a>   DW_AT_decl_file   : 3
    <26b>   DW_AT_decl_line   : 133
    <26c>   DW_AT_decl_column : 3
    <26d>   DW_AT_type        : <0xcf>
 <1><271>: Abbrev Number: 6 (DW_TAG_typedef)
    <272>   DW_AT_name        : (indirect string, offset: 0x8b109): __uint8_t
    <276>   DW_AT_decl_file   : 4
    <277>   DW_AT_decl_line   : 43
    <278>   DW_AT_decl_column : 24
    <279>   DW_AT_type        : <0x27d>
 <1><27d>: Abbrev Number: 5 (DW_TAG_base_type)
    <27e>   DW_AT_byte_size   : 1
    <27f>   DW_AT_encoding    : 8	(unsigned char)
    <280>   DW_AT_name        : (indirect string, offset: 0x630da): unsigned char
 <1><284>: Abbrev Number: 5 (DW_TAG_base_type)
    <285>   DW_AT_byte_size   : 2
    <286>   DW_AT_encoding    : 5	(signed)
    <287>   DW_AT_name        : (indirect string, offset: 0x5288): short int
 <1><28b>: Abbrev Number: 6 (DW_TAG_typedef)
    <28c>   DW_AT_name        : (indirect string, offset: 0x8dba8): __uint16_t
    <290>   DW_AT_decl_file   : 4
    <291>   DW_AT_decl_line   : 57
    <292>   DW_AT_decl_column : 25
    <293>   DW_AT_type        : <0x297>
 <1><297>: Abbrev Number: 5 (DW_TAG_base_type)
    <298>   DW_AT_byte_size   : 2
    <299>   DW_AT_encoding    : 7	(unsigned)
    <29a>   DW_AT_name        : (indirect string, offset: 0x44a3d): short unsigned int
 <1><29e>: Abbrev Number: 5 (DW_TAG_base_type)
    <29f>   DW_AT_byte_size   : 4
    <2a0>   DW_AT_encoding    : 5	(signed)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x1b255): long int
 <1><2a5>: Abbrev Number: 6 (DW_TAG_typedef)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x8ce88): __uint32_t
    <2aa>   DW_AT_decl_file   : 4
    <2ab>   DW_AT_decl_line   : 79
    <2ac>   DW_AT_decl_column : 25
    <2ad>   DW_AT_type        : <0x2b1>
 <1><2b1>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b2>   DW_AT_byte_size   : 4
    <2b3>   DW_AT_encoding    : 7	(unsigned)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x50c3f): long unsigned int
 <1><2b8>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b9>   DW_AT_byte_size   : 8
    <2ba>   DW_AT_encoding    : 5	(signed)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x367c1): long long int
 <1><2bf>: Abbrev Number: 5 (DW_TAG_base_type)
    <2c0>   DW_AT_byte_size   : 8
    <2c1>   DW_AT_encoding    : 7	(unsigned)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x2e8a1): long long unsigned int
 <1><2c6>: Abbrev Number: 7 (DW_TAG_base_type)
    <2c7>   DW_AT_byte_size   : 4
    <2c8>   DW_AT_encoding    : 5	(signed)
    <2c9>   DW_AT_name        : int
 <1><2cd>: Abbrev Number: 5 (DW_TAG_base_type)
    <2ce>   DW_AT_byte_size   : 4
    <2cf>   DW_AT_encoding    : 7	(unsigned)
    <2d0>   DW_AT_name        : (indirect string, offset: 0x4a112): unsigned int
 <1><2d4>: Abbrev Number: 6 (DW_TAG_typedef)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x8b10b): uint8_t
    <2d9>   DW_AT_decl_file   : 5
    <2da>   DW_AT_decl_line   : 24
    <2db>   DW_AT_decl_column : 19
    <2dc>   DW_AT_type        : <0x271>
 <1><2e0>: Abbrev Number: 8 (DW_TAG_const_type)
    <2e1>   DW_AT_type        : <0x2d4>
 <1><2e5>: Abbrev Number: 6 (DW_TAG_typedef)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x4ee99): uint16_t
    <2ea>   DW_AT_decl_file   : 5
    <2eb>   DW_AT_decl_line   : 36
    <2ec>   DW_AT_decl_column : 20
    <2ed>   DW_AT_type        : <0x28b>
 <1><2f1>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <2f2>   DW_AT_type        : <0x2e5>
 <1><2f6>: Abbrev Number: 6 (DW_TAG_typedef)
    <2f7>   DW_AT_name        : (indirect string, offset: 0x353ba): uint32_t
    <2fb>   DW_AT_decl_file   : 5
    <2fc>   DW_AT_decl_line   : 48
    <2fd>   DW_AT_decl_column : 20
    <2fe>   DW_AT_type        : <0x2a5>
 <1><302>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <303>   DW_AT_type        : <0x2f6>
 <1><307>: Abbrev Number: 10 (DW_TAG_array_type)
    <308>   DW_AT_type        : <0x2f6>
    <30c>   DW_AT_sibling     : <0x317>
 <2><310>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <311>   DW_AT_type        : <0x2cd>
    <315>   DW_AT_upper_bound : 0
 <2><316>: Abbrev Number: 0
 <1><317>: Abbrev Number: 10 (DW_TAG_array_type)
    <318>   DW_AT_type        : <0x2f6>
    <31c>   DW_AT_sibling     : <0x327>
 <2><320>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <321>   DW_AT_type        : <0x2cd>
    <325>   DW_AT_upper_bound : 1
 <2><326>: Abbrev Number: 0
 <1><327>: Abbrev Number: 12 (DW_TAG_structure_type)
    <328>   DW_AT_byte_size   : 24
    <329>   DW_AT_decl_file   : 3
    <32a>   DW_AT_decl_line   : 213
    <32b>   DW_AT_decl_column : 9
    <32c>   DW_AT_sibling     : <0x37e>
 <2><330>: Abbrev Number: 13 (DW_TAG_member)
    <331>   DW_AT_name        : CR
    <334>   DW_AT_decl_file   : 3
    <335>   DW_AT_decl_line   : 215
    <336>   DW_AT_decl_column : 17
    <337>   DW_AT_type        : <0x302>
    <33b>   DW_AT_data_member_location: 0
 <2><33c>: Abbrev Number: 14 (DW_TAG_member)
    <33d>   DW_AT_name        : (indirect string, offset: 0x8be3b): NDTR
    <341>   DW_AT_decl_file   : 3
    <342>   DW_AT_decl_line   : 216
    <343>   DW_AT_decl_column : 17
    <344>   DW_AT_type        : <0x302>
    <348>   DW_AT_data_member_location: 4
 <2><349>: Abbrev Number: 13 (DW_TAG_member)
    <34a>   DW_AT_name        : PAR
    <34e>   DW_AT_decl_file   : 3
    <34f>   DW_AT_decl_line   : 217
    <350>   DW_AT_decl_column : 17
    <351>   DW_AT_type        : <0x302>
    <355>   DW_AT_data_member_location: 8
 <2><356>: Abbrev Number: 14 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0x8b83b): M0AR
    <35b>   DW_AT_decl_file   : 3
    <35c>   DW_AT_decl_line   : 218
    <35d>   DW_AT_decl_column : 17
    <35e>   DW_AT_type        : <0x302>
    <362>   DW_AT_data_member_location: 12
 <2><363>: Abbrev Number: 14 (DW_TAG_member)
    <364>   DW_AT_name        : (indirect string, offset: 0x89ef8): M1AR
    <368>   DW_AT_decl_file   : 3
    <369>   DW_AT_decl_line   : 219
    <36a>   DW_AT_decl_column : 17
    <36b>   DW_AT_type        : <0x302>
    <36f>   DW_AT_data_member_location: 16
 <2><370>: Abbrev Number: 13 (DW_TAG_member)
    <371>   DW_AT_name        : FCR
    <375>   DW_AT_decl_file   : 3
    <376>   DW_AT_decl_line   : 220
    <377>   DW_AT_decl_column : 17
    <378>   DW_AT_type        : <0x302>
    <37c>   DW_AT_data_member_location: 20
 <2><37d>: Abbrev Number: 0
 <1><37e>: Abbrev Number: 6 (DW_TAG_typedef)
    <37f>   DW_AT_name        : (indirect string, offset: 0x8e79b): DMA_Stream_TypeDef
    <383>   DW_AT_decl_file   : 3
    <384>   DW_AT_decl_line   : 221
    <385>   DW_AT_decl_column : 3
    <386>   DW_AT_type        : <0x327>
 <1><38a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <38b>   DW_AT_byte_size   : 40
    <38c>   DW_AT_decl_file   : 3
    <38d>   DW_AT_decl_line   : 264
    <38f>   DW_AT_decl_column : 9
    <390>   DW_AT_sibling     : <0x413>
 <2><394>: Abbrev Number: 16 (DW_TAG_member)
    <395>   DW_AT_name        : (indirect string, offset: 0x89834): MODER
    <399>   DW_AT_decl_file   : 3
    <39a>   DW_AT_decl_line   : 266
    <39c>   DW_AT_decl_column : 17
    <39d>   DW_AT_type        : <0x302>
    <3a1>   DW_AT_data_member_location: 0
 <2><3a2>: Abbrev Number: 16 (DW_TAG_member)
    <3a3>   DW_AT_name        : (indirect string, offset: 0x8d881): OTYPER
    <3a7>   DW_AT_decl_file   : 3
    <3a8>   DW_AT_decl_line   : 267
    <3aa>   DW_AT_decl_column : 17
    <3ab>   DW_AT_type        : <0x302>
    <3af>   DW_AT_data_member_location: 4
 <2><3b0>: Abbrev Number: 16 (DW_TAG_member)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x8e09b): OSPEEDR
    <3b5>   DW_AT_decl_file   : 3
    <3b6>   DW_AT_decl_line   : 268
    <3b8>   DW_AT_decl_column : 17
    <3b9>   DW_AT_type        : <0x302>
    <3bd>   DW_AT_data_member_location: 8
 <2><3be>: Abbrev Number: 16 (DW_TAG_member)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x8a73d): PUPDR
    <3c3>   DW_AT_decl_file   : 3
    <3c4>   DW_AT_decl_line   : 269
    <3c6>   DW_AT_decl_column : 17
    <3c7>   DW_AT_type        : <0x302>
    <3cb>   DW_AT_data_member_location: 12
 <2><3cc>: Abbrev Number: 17 (DW_TAG_member)
    <3cd>   DW_AT_name        : IDR
    <3d1>   DW_AT_decl_file   : 3
    <3d2>   DW_AT_decl_line   : 270
    <3d4>   DW_AT_decl_column : 17
    <3d5>   DW_AT_type        : <0x302>
    <3d9>   DW_AT_data_member_location: 16
 <2><3da>: Abbrev Number: 17 (DW_TAG_member)
    <3db>   DW_AT_name        : ODR
    <3df>   DW_AT_decl_file   : 3
    <3e0>   DW_AT_decl_line   : 271
    <3e2>   DW_AT_decl_column : 17
    <3e3>   DW_AT_type        : <0x302>
    <3e7>   DW_AT_data_member_location: 20
 <2><3e8>: Abbrev Number: 16 (DW_TAG_member)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x8acb7): BSRR
    <3ed>   DW_AT_decl_file   : 3
    <3ee>   DW_AT_decl_line   : 272
    <3f0>   DW_AT_decl_column : 17
    <3f1>   DW_AT_type        : <0x302>
    <3f5>   DW_AT_data_member_location: 24
 <2><3f6>: Abbrev Number: 16 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x8df57): LCKR
    <3fb>   DW_AT_decl_file   : 3
    <3fc>   DW_AT_decl_line   : 273
    <3fe>   DW_AT_decl_column : 17
    <3ff>   DW_AT_type        : <0x302>
    <403>   DW_AT_data_member_location: 28
 <2><404>: Abbrev Number: 17 (DW_TAG_member)
    <405>   DW_AT_name        : AFR
    <409>   DW_AT_decl_file   : 3
    <40a>   DW_AT_decl_line   : 274
    <40c>   DW_AT_decl_column : 17
    <40d>   DW_AT_type        : <0x423>
    <411>   DW_AT_data_member_location: 32
 <2><412>: Abbrev Number: 0
 <1><413>: Abbrev Number: 10 (DW_TAG_array_type)
    <414>   DW_AT_type        : <0x302>
    <418>   DW_AT_sibling     : <0x423>
 <2><41c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <41d>   DW_AT_type        : <0x2cd>
    <421>   DW_AT_upper_bound : 1
 <2><422>: Abbrev Number: 0
 <1><423>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <424>   DW_AT_type        : <0x413>
 <1><428>: Abbrev Number: 18 (DW_TAG_typedef)
    <429>   DW_AT_name        : (indirect string, offset: 0x8ed42): GPIO_TypeDef
    <42d>   DW_AT_decl_file   : 3
    <42e>   DW_AT_decl_line   : 275
    <430>   DW_AT_decl_column : 3
    <431>   DW_AT_type        : <0x38a>
 <1><435>: Abbrev Number: 15 (DW_TAG_structure_type)
    <436>   DW_AT_byte_size   : 8
    <437>   DW_AT_decl_file   : 3
    <438>   DW_AT_decl_line   : 325
    <43a>   DW_AT_decl_column : 9
    <43b>   DW_AT_sibling     : <0x45b>
 <2><43f>: Abbrev Number: 17 (DW_TAG_member)
    <440>   DW_AT_name        : CR
    <443>   DW_AT_decl_file   : 3
    <444>   DW_AT_decl_line   : 327
    <446>   DW_AT_decl_column : 17
    <447>   DW_AT_type        : <0x302>
    <44b>   DW_AT_data_member_location: 0
 <2><44c>: Abbrev Number: 17 (DW_TAG_member)
    <44d>   DW_AT_name        : CSR
    <451>   DW_AT_decl_file   : 3
    <452>   DW_AT_decl_line   : 328
    <454>   DW_AT_decl_column : 17
    <455>   DW_AT_type        : <0x302>
    <459>   DW_AT_data_member_location: 4
 <2><45a>: Abbrev Number: 0
 <1><45b>: Abbrev Number: 18 (DW_TAG_typedef)
    <45c>   DW_AT_name        : (indirect string, offset: 0x8d5ec): PWR_TypeDef
    <460>   DW_AT_decl_file   : 3
    <461>   DW_AT_decl_line   : 329
    <463>   DW_AT_decl_column : 3
    <464>   DW_AT_type        : <0x435>
 <1><468>: Abbrev Number: 15 (DW_TAG_structure_type)
    <469>   DW_AT_byte_size   : 144
    <46a>   DW_AT_decl_file   : 3
    <46b>   DW_AT_decl_line   : 335
    <46d>   DW_AT_decl_column : 9
    <46e>   DW_AT_sibling     : <0x632>
 <2><472>: Abbrev Number: 17 (DW_TAG_member)
    <473>   DW_AT_name        : CR
    <476>   DW_AT_decl_file   : 3
    <477>   DW_AT_decl_line   : 337
    <479>   DW_AT_decl_column : 17
    <47a>   DW_AT_type        : <0x302>
    <47e>   DW_AT_data_member_location: 0
 <2><47f>: Abbrev Number: 16 (DW_TAG_member)
    <480>   DW_AT_name        : (indirect string, offset: 0x8d4ed): PLLCFGR
    <484>   DW_AT_decl_file   : 3
    <485>   DW_AT_decl_line   : 338
    <487>   DW_AT_decl_column : 17
    <488>   DW_AT_type        : <0x302>
    <48c>   DW_AT_data_member_location: 4
 <2><48d>: Abbrev Number: 16 (DW_TAG_member)
    <48e>   DW_AT_name        : (indirect string, offset: 0x8baae): CFGR
    <492>   DW_AT_decl_file   : 3
    <493>   DW_AT_decl_line   : 339
    <495>   DW_AT_decl_column : 17
    <496>   DW_AT_type        : <0x302>
    <49a>   DW_AT_data_member_location: 8
 <2><49b>: Abbrev Number: 17 (DW_TAG_member)
    <49c>   DW_AT_name        : CIR
    <4a0>   DW_AT_decl_file   : 3
    <4a1>   DW_AT_decl_line   : 340
    <4a3>   DW_AT_decl_column : 17
    <4a4>   DW_AT_type        : <0x302>
    <4a8>   DW_AT_data_member_location: 12
 <2><4a9>: Abbrev Number: 16 (DW_TAG_member)
    <4aa>   DW_AT_name        : (indirect string, offset: 0x8da63): AHB1RSTR
    <4ae>   DW_AT_decl_file   : 3
    <4af>   DW_AT_decl_line   : 341
    <4b1>   DW_AT_decl_column : 17
    <4b2>   DW_AT_type        : <0x302>
    <4b6>   DW_AT_data_member_location: 16
 <2><4b7>: Abbrev Number: 16 (DW_TAG_member)
    <4b8>   DW_AT_name        : (indirect string, offset: 0x8a0f8): AHB2RSTR
    <4bc>   DW_AT_decl_file   : 3
    <4bd>   DW_AT_decl_line   : 342
    <4bf>   DW_AT_decl_column : 17
    <4c0>   DW_AT_type        : <0x302>
    <4c4>   DW_AT_data_member_location: 20
 <2><4c5>: Abbrev Number: 16 (DW_TAG_member)
    <4c6>   DW_AT_name        : (indirect string, offset: 0x8baa2): AHB3RSTR
    <4ca>   DW_AT_decl_file   : 3
    <4cb>   DW_AT_decl_line   : 343
    <4cd>   DW_AT_decl_column : 17
    <4ce>   DW_AT_type        : <0x302>
    <4d2>   DW_AT_data_member_location: 24
 <2><4d3>: Abbrev Number: 16 (DW_TAG_member)
    <4d4>   DW_AT_name        : (indirect string, offset: 0x8eb6b): RESERVED0
    <4d8>   DW_AT_decl_file   : 3
    <4d9>   DW_AT_decl_line   : 344
    <4db>   DW_AT_decl_column : 17
    <4dc>   DW_AT_type        : <0x2f6>
    <4e0>   DW_AT_data_member_location: 28
 <2><4e1>: Abbrev Number: 16 (DW_TAG_member)
    <4e2>   DW_AT_name        : (indirect string, offset: 0x8a0b7): APB1RSTR
    <4e6>   DW_AT_decl_file   : 3
    <4e7>   DW_AT_decl_line   : 345
    <4e9>   DW_AT_decl_column : 17
    <4ea>   DW_AT_type        : <0x302>
    <4ee>   DW_AT_data_member_location: 32
 <2><4ef>: Abbrev Number: 16 (DW_TAG_member)
    <4f0>   DW_AT_name        : (indirect string, offset: 0x8ba99): APB2RSTR
    <4f4>   DW_AT_decl_file   : 3
    <4f5>   DW_AT_decl_line   : 346
    <4f7>   DW_AT_decl_column : 17
    <4f8>   DW_AT_type        : <0x302>
    <4fc>   DW_AT_data_member_location: 36
 <2><4fd>: Abbrev Number: 16 (DW_TAG_member)
    <4fe>   DW_AT_name        : (indirect string, offset: 0x8eb75): RESERVED1
    <502>   DW_AT_decl_file   : 3
    <503>   DW_AT_decl_line   : 347
    <505>   DW_AT_decl_column : 17
    <506>   DW_AT_type        : <0x317>
    <50a>   DW_AT_data_member_location: 40
 <2><50b>: Abbrev Number: 16 (DW_TAG_member)
    <50c>   DW_AT_name        : (indirect string, offset: 0x89dac): AHB1ENR
    <510>   DW_AT_decl_file   : 3
    <511>   DW_AT_decl_line   : 348
    <513>   DW_AT_decl_column : 17
    <514>   DW_AT_type        : <0x302>
    <518>   DW_AT_data_member_location: 48
 <2><519>: Abbrev Number: 16 (DW_TAG_member)
    <51a>   DW_AT_name        : (indirect string, offset: 0x8af61): AHB2ENR
    <51e>   DW_AT_decl_file   : 3
    <51f>   DW_AT_decl_line   : 349
    <521>   DW_AT_decl_column : 17
    <522>   DW_AT_type        : <0x302>
    <526>   DW_AT_data_member_location: 52
 <2><527>: Abbrev Number: 16 (DW_TAG_member)
    <528>   DW_AT_name        : (indirect string, offset: 0x8bba7): AHB3ENR
    <52c>   DW_AT_decl_file   : 3
    <52d>   DW_AT_decl_line   : 350
    <52f>   DW_AT_decl_column : 17
    <530>   DW_AT_type        : <0x302>
    <534>   DW_AT_data_member_location: 56
 <2><535>: Abbrev Number: 16 (DW_TAG_member)
    <536>   DW_AT_name        : (indirect string, offset: 0x8eb7f): RESERVED2
    <53a>   DW_AT_decl_file   : 3
    <53b>   DW_AT_decl_line   : 351
    <53d>   DW_AT_decl_column : 17
    <53e>   DW_AT_type        : <0x2f6>
    <542>   DW_AT_data_member_location: 60
 <2><543>: Abbrev Number: 16 (DW_TAG_member)
    <544>   DW_AT_name        : (indirect string, offset: 0x8d733): APB1ENR
    <548>   DW_AT_decl_file   : 3
    <549>   DW_AT_decl_line   : 352
    <54b>   DW_AT_decl_column : 17
    <54c>   DW_AT_type        : <0x302>
    <550>   DW_AT_data_member_location: 64
 <2><551>: Abbrev Number: 16 (DW_TAG_member)
    <552>   DW_AT_name        : (indirect string, offset: 0x8a1a3): APB2ENR
    <556>   DW_AT_decl_file   : 3
    <557>   DW_AT_decl_line   : 353
    <559>   DW_AT_decl_column : 17
    <55a>   DW_AT_type        : <0x302>
    <55e>   DW_AT_data_member_location: 68
 <2><55f>: Abbrev Number: 16 (DW_TAG_member)
    <560>   DW_AT_name        : (indirect string, offset: 0x8eb89): RESERVED3
    <564>   DW_AT_decl_file   : 3
    <565>   DW_AT_decl_line   : 354
    <567>   DW_AT_decl_column : 17
    <568>   DW_AT_type        : <0x317>
    <56c>   DW_AT_data_member_location: 72
 <2><56d>: Abbrev Number: 16 (DW_TAG_member)
    <56e>   DW_AT_name        : (indirect string, offset: 0x8bfdf): AHB1LPENR
    <572>   DW_AT_decl_file   : 3
    <573>   DW_AT_decl_line   : 355
    <575>   DW_AT_decl_column : 17
    <576>   DW_AT_type        : <0x302>
    <57a>   DW_AT_data_member_location: 80
 <2><57b>: Abbrev Number: 16 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x8ac93): AHB2LPENR
    <580>   DW_AT_decl_file   : 3
    <581>   DW_AT_decl_line   : 356
    <583>   DW_AT_decl_column : 17
    <584>   DW_AT_type        : <0x302>
    <588>   DW_AT_data_member_location: 84
 <2><589>: Abbrev Number: 16 (DW_TAG_member)
    <58a>   DW_AT_name        : (indirect string, offset: 0x8d1bc): AHB3LPENR
    <58e>   DW_AT_decl_file   : 3
    <58f>   DW_AT_decl_line   : 357
    <591>   DW_AT_decl_column : 17
    <592>   DW_AT_type        : <0x302>
    <596>   DW_AT_data_member_location: 88
 <2><597>: Abbrev Number: 16 (DW_TAG_member)
    <598>   DW_AT_name        : (indirect string, offset: 0x8eb93): RESERVED4
    <59c>   DW_AT_decl_file   : 3
    <59d>   DW_AT_decl_line   : 358
    <59f>   DW_AT_decl_column : 17
    <5a0>   DW_AT_type        : <0x2f6>
    <5a4>   DW_AT_data_member_location: 92
 <2><5a5>: Abbrev Number: 16 (DW_TAG_member)
    <5a6>   DW_AT_name        : (indirect string, offset: 0x8d16a): APB1LPENR
    <5aa>   DW_AT_decl_file   : 3
    <5ab>   DW_AT_decl_line   : 359
    <5ad>   DW_AT_decl_column : 17
    <5ae>   DW_AT_type        : <0x302>
    <5b2>   DW_AT_data_member_location: 96
 <2><5b3>: Abbrev Number: 16 (DW_TAG_member)
    <5b4>   DW_AT_name        : (indirect string, offset: 0x89d8a): APB2LPENR
    <5b8>   DW_AT_decl_file   : 3
    <5b9>   DW_AT_decl_line   : 360
    <5bb>   DW_AT_decl_column : 17
    <5bc>   DW_AT_type        : <0x302>
    <5c0>   DW_AT_data_member_location: 100
 <2><5c1>: Abbrev Number: 16 (DW_TAG_member)
    <5c2>   DW_AT_name        : (indirect string, offset: 0x8eb9d): RESERVED5
    <5c6>   DW_AT_decl_file   : 3
    <5c7>   DW_AT_decl_line   : 361
    <5c9>   DW_AT_decl_column : 17
    <5ca>   DW_AT_type        : <0x317>
    <5ce>   DW_AT_data_member_location: 104
 <2><5cf>: Abbrev Number: 16 (DW_TAG_member)
    <5d0>   DW_AT_name        : (indirect string, offset: 0x8a246): BDCR
    <5d4>   DW_AT_decl_file   : 3
    <5d5>   DW_AT_decl_line   : 362
    <5d7>   DW_AT_decl_column : 17
    <5d8>   DW_AT_type        : <0x302>
    <5dc>   DW_AT_data_member_location: 112
 <2><5dd>: Abbrev Number: 17 (DW_TAG_member)
    <5de>   DW_AT_name        : CSR
    <5e2>   DW_AT_decl_file   : 3
    <5e3>   DW_AT_decl_line   : 363
    <5e5>   DW_AT_decl_column : 17
    <5e6>   DW_AT_type        : <0x302>
    <5ea>   DW_AT_data_member_location: 116
 <2><5eb>: Abbrev Number: 16 (DW_TAG_member)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x8eba7): RESERVED6
    <5f0>   DW_AT_decl_file   : 3
    <5f1>   DW_AT_decl_line   : 364
    <5f3>   DW_AT_decl_column : 17
    <5f4>   DW_AT_type        : <0x317>
    <5f8>   DW_AT_data_member_location: 120
 <2><5f9>: Abbrev Number: 16 (DW_TAG_member)
    <5fa>   DW_AT_name        : (indirect string, offset: 0x8c303): SSCGR
    <5fe>   DW_AT_decl_file   : 3
    <5ff>   DW_AT_decl_line   : 365
    <601>   DW_AT_decl_column : 17
    <602>   DW_AT_type        : <0x302>
    <606>   DW_AT_data_member_location: 128
 <2><607>: Abbrev Number: 16 (DW_TAG_member)
    <608>   DW_AT_name        : (indirect string, offset: 0x8b332): PLLI2SCFGR
    <60c>   DW_AT_decl_file   : 3
    <60d>   DW_AT_decl_line   : 366
    <60f>   DW_AT_decl_column : 17
    <610>   DW_AT_type        : <0x302>
    <614>   DW_AT_data_member_location: 132
 <2><615>: Abbrev Number: 16 (DW_TAG_member)
    <616>   DW_AT_name        : (indirect string, offset: 0x8ebb1): RESERVED7
    <61a>   DW_AT_decl_file   : 3
    <61b>   DW_AT_decl_line   : 367
    <61d>   DW_AT_decl_column : 17
    <61e>   DW_AT_type        : <0x307>
    <622>   DW_AT_data_member_location: 136
 <2><623>: Abbrev Number: 16 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0x8baab): DCKCFGR
    <628>   DW_AT_decl_file   : 3
    <629>   DW_AT_decl_line   : 368
    <62b>   DW_AT_decl_column : 17
    <62c>   DW_AT_type        : <0x302>
    <630>   DW_AT_data_member_location: 140
 <2><631>: Abbrev Number: 0
 <1><632>: Abbrev Number: 18 (DW_TAG_typedef)
    <633>   DW_AT_name        : (indirect string, offset: 0x8bcbf): RCC_TypeDef
    <637>   DW_AT_decl_file   : 3
    <638>   DW_AT_decl_line   : 369
    <63a>   DW_AT_decl_column : 3
    <63b>   DW_AT_type        : <0x468>
 <1><63f>: Abbrev Number: 15 (DW_TAG_structure_type)
    <640>   DW_AT_byte_size   : 84
    <641>   DW_AT_decl_file   : 3
    <642>   DW_AT_decl_line   : 469
    <644>   DW_AT_decl_column : 9
    <645>   DW_AT_sibling     : <0x76e>
 <2><649>: Abbrev Number: 17 (DW_TAG_member)
    <64a>   DW_AT_name        : CR1
    <64e>   DW_AT_decl_file   : 3
    <64f>   DW_AT_decl_line   : 471
    <651>   DW_AT_decl_column : 17
    <652>   DW_AT_type        : <0x302>
    <656>   DW_AT_data_member_location: 0
 <2><657>: Abbrev Number: 17 (DW_TAG_member)
    <658>   DW_AT_name        : CR2
    <65c>   DW_AT_decl_file   : 3
    <65d>   DW_AT_decl_line   : 472
    <65f>   DW_AT_decl_column : 17
    <660>   DW_AT_type        : <0x302>
    <664>   DW_AT_data_member_location: 4
 <2><665>: Abbrev Number: 16 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0x855e2): SMCR
    <66a>   DW_AT_decl_file   : 3
    <66b>   DW_AT_decl_line   : 473
    <66d>   DW_AT_decl_column : 17
    <66e>   DW_AT_type        : <0x302>
    <672>   DW_AT_data_member_location: 8
 <2><673>: Abbrev Number: 16 (DW_TAG_member)
    <674>   DW_AT_name        : (indirect string, offset: 0x63e17): DIER
    <678>   DW_AT_decl_file   : 3
    <679>   DW_AT_decl_line   : 474
    <67b>   DW_AT_decl_column : 17
    <67c>   DW_AT_type        : <0x302>
    <680>   DW_AT_data_member_location: 12
 <2><681>: Abbrev Number: 17 (DW_TAG_member)
    <682>   DW_AT_name        : SR
    <685>   DW_AT_decl_file   : 3
    <686>   DW_AT_decl_line   : 475
    <688>   DW_AT_decl_column : 17
    <689>   DW_AT_type        : <0x302>
    <68d>   DW_AT_data_member_location: 16
 <2><68e>: Abbrev Number: 17 (DW_TAG_member)
    <68f>   DW_AT_name        : EGR
    <693>   DW_AT_decl_file   : 3
    <694>   DW_AT_decl_line   : 476
    <696>   DW_AT_decl_column : 17
    <697>   DW_AT_type        : <0x302>
    <69b>   DW_AT_data_member_location: 20
 <2><69c>: Abbrev Number: 16 (DW_TAG_member)
    <69d>   DW_AT_name        : (indirect string, offset: 0x57a39): CCMR1
    <6a1>   DW_AT_decl_file   : 3
    <6a2>   DW_AT_decl_line   : 477
    <6a4>   DW_AT_decl_column : 17
    <6a5>   DW_AT_type        : <0x302>
    <6a9>   DW_AT_data_member_location: 24
 <2><6aa>: Abbrev Number: 16 (DW_TAG_member)
    <6ab>   DW_AT_name        : (indirect string, offset: 0x5617b): CCMR2
    <6af>   DW_AT_decl_file   : 3
    <6b0>   DW_AT_decl_line   : 478
    <6b2>   DW_AT_decl_column : 17
    <6b3>   DW_AT_type        : <0x302>
    <6b7>   DW_AT_data_member_location: 28
 <2><6b8>: Abbrev Number: 16 (DW_TAG_member)
    <6b9>   DW_AT_name        : (indirect string, offset: 0x83b22): CCER
    <6bd>   DW_AT_decl_file   : 3
    <6be>   DW_AT_decl_line   : 479
    <6c0>   DW_AT_decl_column : 17
    <6c1>   DW_AT_type        : <0x302>
    <6c5>   DW_AT_data_member_location: 32
 <2><6c6>: Abbrev Number: 17 (DW_TAG_member)
    <6c7>   DW_AT_name        : CNT
    <6cb>   DW_AT_decl_file   : 3
    <6cc>   DW_AT_decl_line   : 480
    <6ce>   DW_AT_decl_column : 17
    <6cf>   DW_AT_type        : <0x302>
    <6d3>   DW_AT_data_member_location: 36
 <2><6d4>: Abbrev Number: 17 (DW_TAG_member)
    <6d5>   DW_AT_name        : PSC
    <6d9>   DW_AT_decl_file   : 3
    <6da>   DW_AT_decl_line   : 481
    <6dc>   DW_AT_decl_column : 17
    <6dd>   DW_AT_type        : <0x302>
    <6e1>   DW_AT_data_member_location: 40
 <2><6e2>: Abbrev Number: 17 (DW_TAG_member)
    <6e3>   DW_AT_name        : ARR
    <6e7>   DW_AT_decl_file   : 3
    <6e8>   DW_AT_decl_line   : 482
    <6ea>   DW_AT_decl_column : 17
    <6eb>   DW_AT_type        : <0x302>
    <6ef>   DW_AT_data_member_location: 44
 <2><6f0>: Abbrev Number: 17 (DW_TAG_member)
    <6f1>   DW_AT_name        : RCR
    <6f5>   DW_AT_decl_file   : 3
    <6f6>   DW_AT_decl_line   : 483
    <6f8>   DW_AT_decl_column : 17
    <6f9>   DW_AT_type        : <0x302>
    <6fd>   DW_AT_data_member_location: 48
 <2><6fe>: Abbrev Number: 16 (DW_TAG_member)
    <6ff>   DW_AT_name        : (indirect string, offset: 0x71e6e): CCR1
    <703>   DW_AT_decl_file   : 3
    <704>   DW_AT_decl_line   : 484
    <706>   DW_AT_decl_column : 17
    <707>   DW_AT_type        : <0x302>
    <70b>   DW_AT_data_member_location: 52
 <2><70c>: Abbrev Number: 16 (DW_TAG_member)
    <70d>   DW_AT_name        : (indirect string, offset: 0x3a2fd): CCR2
    <711>   DW_AT_decl_file   : 3
    <712>   DW_AT_decl_line   : 485
    <714>   DW_AT_decl_column : 17
    <715>   DW_AT_type        : <0x302>
    <719>   DW_AT_data_member_location: 56
 <2><71a>: Abbrev Number: 16 (DW_TAG_member)
    <71b>   DW_AT_name        : (indirect string, offset: 0x36158): CCR3
    <71f>   DW_AT_decl_file   : 3
    <720>   DW_AT_decl_line   : 486
    <722>   DW_AT_decl_column : 17
    <723>   DW_AT_type        : <0x302>
    <727>   DW_AT_data_member_location: 60
 <2><728>: Abbrev Number: 16 (DW_TAG_member)
    <729>   DW_AT_name        : (indirect string, offset: 0xf8fe): CCR4
    <72d>   DW_AT_decl_file   : 3
    <72e>   DW_AT_decl_line   : 487
    <730>   DW_AT_decl_column : 17
    <731>   DW_AT_type        : <0x302>
    <735>   DW_AT_data_member_location: 64
 <2><736>: Abbrev Number: 16 (DW_TAG_member)
    <737>   DW_AT_name        : (indirect string, offset: 0xa562): BDTR
    <73b>   DW_AT_decl_file   : 3
    <73c>   DW_AT_decl_line   : 488
    <73e>   DW_AT_decl_column : 17
    <73f>   DW_AT_type        : <0x302>
    <743>   DW_AT_data_member_location: 68
 <2><744>: Abbrev Number: 17 (DW_TAG_member)
    <745>   DW_AT_name        : DCR
    <749>   DW_AT_decl_file   : 3
    <74a>   DW_AT_decl_line   : 489
    <74c>   DW_AT_decl_column : 17
    <74d>   DW_AT_type        : <0x302>
    <751>   DW_AT_data_member_location: 72
 <2><752>: Abbrev Number: 16 (DW_TAG_member)
    <753>   DW_AT_name        : (indirect string, offset: 0x3c73): DMAR
    <757>   DW_AT_decl_file   : 3
    <758>   DW_AT_decl_line   : 490
    <75a>   DW_AT_decl_column : 17
    <75b>   DW_AT_type        : <0x302>
    <75f>   DW_AT_data_member_location: 76
 <2><760>: Abbrev Number: 17 (DW_TAG_member)
    <761>   DW_AT_name        : OR
    <764>   DW_AT_decl_file   : 3
    <765>   DW_AT_decl_line   : 491
    <767>   DW_AT_decl_column : 17
    <768>   DW_AT_type        : <0x302>
    <76c>   DW_AT_data_member_location: 80
 <2><76d>: Abbrev Number: 0
 <1><76e>: Abbrev Number: 18 (DW_TAG_typedef)
    <76f>   DW_AT_name        : (indirect string, offset: 0x89a36): TIM_TypeDef
    <773>   DW_AT_decl_file   : 3
    <774>   DW_AT_decl_line   : 492
    <776>   DW_AT_decl_column : 3
    <777>   DW_AT_type        : <0x63f>
 <1><77b>: Abbrev Number: 15 (DW_TAG_structure_type)
    <77c>   DW_AT_byte_size   : 28
    <77d>   DW_AT_decl_file   : 3
    <77e>   DW_AT_decl_line   : 498
    <780>   DW_AT_decl_column : 9
    <781>   DW_AT_sibling     : <0x7e6>
 <2><785>: Abbrev Number: 17 (DW_TAG_member)
    <786>   DW_AT_name        : SR
    <789>   DW_AT_decl_file   : 3
    <78a>   DW_AT_decl_line   : 500
    <78c>   DW_AT_decl_column : 17
    <78d>   DW_AT_type        : <0x302>
    <791>   DW_AT_data_member_location: 0
 <2><792>: Abbrev Number: 17 (DW_TAG_member)
    <793>   DW_AT_name        : DR
    <796>   DW_AT_decl_file   : 3
    <797>   DW_AT_decl_line   : 501
    <799>   DW_AT_decl_column : 17
    <79a>   DW_AT_type        : <0x302>
    <79e>   DW_AT_data_member_location: 4
 <2><79f>: Abbrev Number: 17 (DW_TAG_member)
    <7a0>   DW_AT_name        : BRR
    <7a4>   DW_AT_decl_file   : 3
    <7a5>   DW_AT_decl_line   : 502
    <7a7>   DW_AT_decl_column : 17
    <7a8>   DW_AT_type        : <0x302>
    <7ac>   DW_AT_data_member_location: 8
 <2><7ad>: Abbrev Number: 17 (DW_TAG_member)
    <7ae>   DW_AT_name        : CR1
    <7b2>   DW_AT_decl_file   : 3
    <7b3>   DW_AT_decl_line   : 503
    <7b5>   DW_AT_decl_column : 17
    <7b6>   DW_AT_type        : <0x302>
    <7ba>   DW_AT_data_member_location: 12
 <2><7bb>: Abbrev Number: 17 (DW_TAG_member)
    <7bc>   DW_AT_name        : CR2
    <7c0>   DW_AT_decl_file   : 3
    <7c1>   DW_AT_decl_line   : 504
    <7c3>   DW_AT_decl_column : 17
    <7c4>   DW_AT_type        : <0x302>
    <7c8>   DW_AT_data_member_location: 16
 <2><7c9>: Abbrev Number: 17 (DW_TAG_member)
    <7ca>   DW_AT_name        : CR3
    <7ce>   DW_AT_decl_file   : 3
    <7cf>   DW_AT_decl_line   : 505
    <7d1>   DW_AT_decl_column : 17
    <7d2>   DW_AT_type        : <0x302>
    <7d6>   DW_AT_data_member_location: 20
 <2><7d7>: Abbrev Number: 16 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x8b042): GTPR
    <7dc>   DW_AT_decl_file   : 3
    <7dd>   DW_AT_decl_line   : 506
    <7df>   DW_AT_decl_column : 17
    <7e0>   DW_AT_type        : <0x302>
    <7e4>   DW_AT_data_member_location: 24
 <2><7e5>: Abbrev Number: 0
 <1><7e6>: Abbrev Number: 18 (DW_TAG_typedef)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x8eea1): USART_TypeDef
    <7eb>   DW_AT_decl_file   : 3
    <7ec>   DW_AT_decl_line   : 507
    <7ee>   DW_AT_decl_column : 3
    <7ef>   DW_AT_type        : <0x77b>
 <1><7f3>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <7f4>   DW_AT_encoding    : 7	(unsigned)
    <7f5>   DW_AT_byte_size   : 1
    <7f6>   DW_AT_type        : <0x27d>
    <7fa>   DW_AT_decl_file   : 6
    <7fb>   DW_AT_decl_line   : 185
    <7fc>   DW_AT_decl_column : 1
    <7fd>   DW_AT_sibling     : <0x80e>
 <2><801>: Abbrev Number: 4 (DW_TAG_enumerator)
    <802>   DW_AT_name        : (indirect string, offset: 0x38151): RESET
    <806>   DW_AT_const_value : 0
 <2><807>: Abbrev Number: 19 (DW_TAG_enumerator)
    <808>   DW_AT_name        : SET
    <80c>   DW_AT_const_value : 1
 <2><80d>: Abbrev Number: 0
 <1><80e>: Abbrev Number: 6 (DW_TAG_typedef)
    <80f>   DW_AT_name        : (indirect string, offset: 0x2e58d): size_t
    <813>   DW_AT_decl_file   : 7
    <814>   DW_AT_decl_line   : 209
    <815>   DW_AT_decl_column : 23
    <816>   DW_AT_type        : <0x2cd>
 <1><81a>: Abbrev Number: 5 (DW_TAG_base_type)
    <81b>   DW_AT_byte_size   : 8
    <81c>   DW_AT_encoding    : 4	(float)
    <81d>   DW_AT_name        : (indirect string, offset: 0x8dbd6): long double
 <1><821>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <822>   DW_AT_encoding    : 7	(unsigned)
    <823>   DW_AT_byte_size   : 1
    <824>   DW_AT_type        : <0x27d>
    <828>   DW_AT_decl_file   : 8
    <829>   DW_AT_decl_line   : 39
    <82a>   DW_AT_decl_column : 1
    <82b>   DW_AT_sibling     : <0x848>
 <2><82f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <830>   DW_AT_name        : (indirect string, offset: 0x8b365): HAL_OK
    <834>   DW_AT_const_value : 0
 <2><835>: Abbrev Number: 4 (DW_TAG_enumerator)
    <836>   DW_AT_name        : (indirect string, offset: 0x8cb67): HAL_ERROR
    <83a>   DW_AT_const_value : 1
 <2><83b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <83c>   DW_AT_name        : (indirect string, offset: 0x8dd32): HAL_BUSY
    <840>   DW_AT_const_value : 2
 <2><841>: Abbrev Number: 4 (DW_TAG_enumerator)
    <842>   DW_AT_name        : (indirect string, offset: 0x8b113): HAL_TIMEOUT
    <846>   DW_AT_const_value : 3
 <2><847>: Abbrev Number: 0
 <1><848>: Abbrev Number: 6 (DW_TAG_typedef)
    <849>   DW_AT_name        : (indirect string, offset: 0x89875): HAL_StatusTypeDef
    <84d>   DW_AT_decl_file   : 8
    <84e>   DW_AT_decl_line   : 44
    <84f>   DW_AT_decl_column : 3
    <850>   DW_AT_type        : <0x821>
 <1><854>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <855>   DW_AT_encoding    : 7	(unsigned)
    <856>   DW_AT_byte_size   : 1
    <857>   DW_AT_type        : <0x27d>
    <85b>   DW_AT_decl_file   : 8
    <85c>   DW_AT_decl_line   : 50
    <85d>   DW_AT_decl_column : 1
    <85e>   DW_AT_sibling     : <0x86f>
 <2><862>: Abbrev Number: 4 (DW_TAG_enumerator)
    <863>   DW_AT_name        : (indirect string, offset: 0x8d693): HAL_UNLOCKED
    <867>   DW_AT_const_value : 0
 <2><868>: Abbrev Number: 4 (DW_TAG_enumerator)
    <869>   DW_AT_name        : (indirect string, offset: 0x8f036): HAL_LOCKED
    <86d>   DW_AT_const_value : 1
 <2><86e>: Abbrev Number: 0
 <1><86f>: Abbrev Number: 6 (DW_TAG_typedef)
    <870>   DW_AT_name        : (indirect string, offset: 0x8c927): HAL_LockTypeDef
    <874>   DW_AT_decl_file   : 8
    <875>   DW_AT_decl_line   : 53
    <876>   DW_AT_decl_column : 3
    <877>   DW_AT_type        : <0x854>
 <1><87b>: Abbrev Number: 12 (DW_TAG_structure_type)
    <87c>   DW_AT_byte_size   : 24
    <87d>   DW_AT_decl_file   : 9
    <87e>   DW_AT_decl_line   : 45
    <87f>   DW_AT_decl_column : 9
    <880>   DW_AT_sibling     : <0x8d3>
 <2><884>: Abbrev Number: 14 (DW_TAG_member)
    <885>   DW_AT_name        : (indirect string, offset: 0x8d174): PLLState
    <889>   DW_AT_decl_file   : 9
    <88a>   DW_AT_decl_line   : 47
    <88b>   DW_AT_decl_column : 12
    <88c>   DW_AT_type        : <0x2f6>
    <890>   DW_AT_data_member_location: 0
 <2><891>: Abbrev Number: 14 (DW_TAG_member)
    <892>   DW_AT_name        : (indirect string, offset: 0x8d1e1): PLLSource
    <896>   DW_AT_decl_file   : 9
    <897>   DW_AT_decl_line   : 50
    <898>   DW_AT_decl_column : 12
    <899>   DW_AT_type        : <0x2f6>
    <89d>   DW_AT_data_member_location: 4
 <2><89e>: Abbrev Number: 14 (DW_TAG_member)
    <89f>   DW_AT_name        : (indirect string, offset: 0x8dc50): PLLM
    <8a3>   DW_AT_decl_file   : 9
    <8a4>   DW_AT_decl_line   : 53
    <8a5>   DW_AT_decl_column : 12
    <8a6>   DW_AT_type        : <0x2f6>
    <8aa>   DW_AT_data_member_location: 8
 <2><8ab>: Abbrev Number: 14 (DW_TAG_member)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x8dc55): PLLN
    <8b0>   DW_AT_decl_file   : 9
    <8b1>   DW_AT_decl_line   : 56
    <8b2>   DW_AT_decl_column : 12
    <8b3>   DW_AT_type        : <0x2f6>
    <8b7>   DW_AT_data_member_location: 12
 <2><8b8>: Abbrev Number: 14 (DW_TAG_member)
    <8b9>   DW_AT_name        : (indirect string, offset: 0x8bccb): PLLP
    <8bd>   DW_AT_decl_file   : 9
    <8be>   DW_AT_decl_line   : 60
    <8bf>   DW_AT_decl_column : 12
    <8c0>   DW_AT_type        : <0x2f6>
    <8c4>   DW_AT_data_member_location: 16
 <2><8c5>: Abbrev Number: 14 (DW_TAG_member)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x77b05): PLLQ
    <8ca>   DW_AT_decl_file   : 9
    <8cb>   DW_AT_decl_line   : 63
    <8cc>   DW_AT_decl_column : 12
    <8cd>   DW_AT_type        : <0x2f6>
    <8d1>   DW_AT_data_member_location: 20
 <2><8d2>: Abbrev Number: 0
 <1><8d3>: Abbrev Number: 6 (DW_TAG_typedef)
    <8d4>   DW_AT_name        : (indirect string, offset: 0x8ede8): RCC_PLLInitTypeDef
    <8d8>   DW_AT_decl_file   : 9
    <8d9>   DW_AT_decl_line   : 73
    <8da>   DW_AT_decl_column : 2
    <8db>   DW_AT_type        : <0x87b>
 <1><8df>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8e0>   DW_AT_byte_size   : 48
    <8e1>   DW_AT_decl_file   : 10
    <8e2>   DW_AT_decl_line   : 49
    <8e3>   DW_AT_decl_column : 9
    <8e4>   DW_AT_sibling     : <0x944>
 <2><8e8>: Abbrev Number: 14 (DW_TAG_member)
    <8e9>   DW_AT_name        : (indirect string, offset: 0x8db99): OscillatorType
    <8ed>   DW_AT_decl_file   : 10
    <8ee>   DW_AT_decl_line   : 51
    <8ef>   DW_AT_decl_column : 12
    <8f0>   DW_AT_type        : <0x2f6>
    <8f4>   DW_AT_data_member_location: 0
 <2><8f5>: Abbrev Number: 14 (DW_TAG_member)
    <8f6>   DW_AT_name        : (indirect string, offset: 0x8d1d8): HSEState
    <8fa>   DW_AT_decl_file   : 10
    <8fb>   DW_AT_decl_line   : 54
    <8fc>   DW_AT_decl_column : 12
    <8fd>   DW_AT_type        : <0x2f6>
    <901>   DW_AT_data_member_location: 4
 <2><902>: Abbrev Number: 14 (DW_TAG_member)
    <903>   DW_AT_name        : (indirect string, offset: 0x8cc17): LSEState
    <907>   DW_AT_decl_file   : 10
    <908>   DW_AT_decl_line   : 57
    <909>   DW_AT_decl_column : 12
    <90a>   DW_AT_type        : <0x2f6>
    <90e>   DW_AT_data_member_location: 8
 <2><90f>: Abbrev Number: 14 (DW_TAG_member)
    <910>   DW_AT_name        : (indirect string, offset: 0x8bb79): HSIState
    <914>   DW_AT_decl_file   : 10
    <915>   DW_AT_decl_line   : 60
    <916>   DW_AT_decl_column : 12
    <917>   DW_AT_type        : <0x2f6>
    <91b>   DW_AT_data_member_location: 12
 <2><91c>: Abbrev Number: 14 (DW_TAG_member)
    <91d>   DW_AT_name        : (indirect string, offset: 0x8df6c): HSICalibrationValue
    <921>   DW_AT_decl_file   : 10
    <922>   DW_AT_decl_line   : 63
    <923>   DW_AT_decl_column : 12
    <924>   DW_AT_type        : <0x2f6>
    <928>   DW_AT_data_member_location: 16
 <2><929>: Abbrev Number: 14 (DW_TAG_member)
    <92a>   DW_AT_name        : (indirect string, offset: 0x8e292): LSIState
    <92e>   DW_AT_decl_file   : 10
    <92f>   DW_AT_decl_line   : 66
    <930>   DW_AT_decl_column : 12
    <931>   DW_AT_type        : <0x2f6>
    <935>   DW_AT_data_member_location: 20
 <2><936>: Abbrev Number: 13 (DW_TAG_member)
    <937>   DW_AT_name        : PLL
    <93b>   DW_AT_decl_file   : 10
    <93c>   DW_AT_decl_line   : 69
    <93d>   DW_AT_decl_column : 22
    <93e>   DW_AT_type        : <0x8d3>
    <942>   DW_AT_data_member_location: 24
 <2><943>: Abbrev Number: 0
 <1><944>: Abbrev Number: 6 (DW_TAG_typedef)
    <945>   DW_AT_name        : (indirect string, offset: 0x8c309): RCC_OscInitTypeDef
    <949>   DW_AT_decl_file   : 10
    <94a>   DW_AT_decl_line   : 70
    <94b>   DW_AT_decl_column : 2
    <94c>   DW_AT_type        : <0x8df>
 <1><950>: Abbrev Number: 12 (DW_TAG_structure_type)
    <951>   DW_AT_byte_size   : 20
    <952>   DW_AT_decl_file   : 10
    <953>   DW_AT_decl_line   : 75
    <954>   DW_AT_decl_column : 9
    <955>   DW_AT_sibling     : <0x99b>
 <2><959>: Abbrev Number: 14 (DW_TAG_member)
    <95a>   DW_AT_name        : (indirect string, offset: 0x8b1b6): ClockType
    <95e>   DW_AT_decl_file   : 10
    <95f>   DW_AT_decl_line   : 77
    <960>   DW_AT_decl_column : 12
    <961>   DW_AT_type        : <0x2f6>
    <965>   DW_AT_data_member_location: 0
 <2><966>: Abbrev Number: 14 (DW_TAG_member)
    <967>   DW_AT_name        : (indirect string, offset: 0x8c057): SYSCLKSource
    <96b>   DW_AT_decl_file   : 10
    <96c>   DW_AT_decl_line   : 80
    <96d>   DW_AT_decl_column : 12
    <96e>   DW_AT_type        : <0x2f6>
    <972>   DW_AT_data_member_location: 4
 <2><973>: Abbrev Number: 14 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0x8dc0a): AHBCLKDivider
    <978>   DW_AT_decl_file   : 10
    <979>   DW_AT_decl_line   : 83
    <97a>   DW_AT_decl_column : 12
    <97b>   DW_AT_type        : <0x2f6>
    <97f>   DW_AT_data_member_location: 8
 <2><980>: Abbrev Number: 14 (DW_TAG_member)
    <981>   DW_AT_name        : (indirect string, offset: 0x89a56): APB1CLKDivider
    <985>   DW_AT_decl_file   : 10
    <986>   DW_AT_decl_line   : 86
    <987>   DW_AT_decl_column : 12
    <988>   DW_AT_type        : <0x2f6>
    <98c>   DW_AT_data_member_location: 12
 <2><98d>: Abbrev Number: 14 (DW_TAG_member)
    <98e>   DW_AT_name        : (indirect string, offset: 0x8bc1c): APB2CLKDivider
    <992>   DW_AT_decl_file   : 10
    <993>   DW_AT_decl_line   : 89
    <994>   DW_AT_decl_column : 12
    <995>   DW_AT_type        : <0x2f6>
    <999>   DW_AT_data_member_location: 16
 <2><99a>: Abbrev Number: 0
 <1><99b>: Abbrev Number: 6 (DW_TAG_typedef)
    <99c>   DW_AT_name        : (indirect string, offset: 0x8d4da): RCC_ClkInitTypeDef
    <9a0>   DW_AT_decl_file   : 10
    <9a1>   DW_AT_decl_line   : 92
    <9a2>   DW_AT_decl_column : 2
    <9a3>   DW_AT_type        : <0x950>
 <1><9a7>: Abbrev Number: 12 (DW_TAG_structure_type)
    <9a8>   DW_AT_byte_size   : 20
    <9a9>   DW_AT_decl_file   : 11
    <9aa>   DW_AT_decl_line   : 46
    <9ab>   DW_AT_decl_column : 9
    <9ac>   DW_AT_sibling     : <0x9f2>
 <2><9b0>: Abbrev Number: 13 (DW_TAG_member)
    <9b1>   DW_AT_name        : Pin
    <9b5>   DW_AT_decl_file   : 11
    <9b6>   DW_AT_decl_line   : 48
    <9b7>   DW_AT_decl_column : 12
    <9b8>   DW_AT_type        : <0x2f6>
    <9bc>   DW_AT_data_member_location: 0
 <2><9bd>: Abbrev Number: 14 (DW_TAG_member)
    <9be>   DW_AT_name        : (indirect string, offset: 0x904f8): Mode
    <9c2>   DW_AT_decl_file   : 11
    <9c3>   DW_AT_decl_line   : 51
    <9c4>   DW_AT_decl_column : 12
    <9c5>   DW_AT_type        : <0x2f6>
    <9c9>   DW_AT_data_member_location: 4
 <2><9ca>: Abbrev Number: 14 (DW_TAG_member)
    <9cb>   DW_AT_name        : (indirect string, offset: 0x8c073): Pull
    <9cf>   DW_AT_decl_file   : 11
    <9d0>   DW_AT_decl_line   : 54
    <9d1>   DW_AT_decl_column : 12
    <9d2>   DW_AT_type        : <0x2f6>
    <9d6>   DW_AT_data_member_location: 8
 <2><9d7>: Abbrev Number: 14 (DW_TAG_member)
    <9d8>   DW_AT_name        : (indirect string, offset: 0x8c7b2): Speed
    <9dc>   DW_AT_decl_file   : 11
    <9dd>   DW_AT_decl_line   : 57
    <9de>   DW_AT_decl_column : 12
    <9df>   DW_AT_type        : <0x2f6>
    <9e3>   DW_AT_data_member_location: 12
 <2><9e4>: Abbrev Number: 14 (DW_TAG_member)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x8bc12): Alternate
    <9e9>   DW_AT_decl_file   : 11
    <9ea>   DW_AT_decl_line   : 60
    <9eb>   DW_AT_decl_column : 12
    <9ec>   DW_AT_type        : <0x2f6>
    <9f0>   DW_AT_data_member_location: 16
 <2><9f1>: Abbrev Number: 0
 <1><9f2>: Abbrev Number: 6 (DW_TAG_typedef)
    <9f3>   DW_AT_name        : (indirect string, offset: 0x8d941): GPIO_InitTypeDef
    <9f7>   DW_AT_decl_file   : 11
    <9f8>   DW_AT_decl_line   : 62
    <9f9>   DW_AT_decl_column : 2
    <9fa>   DW_AT_type        : <0x9a7>
 <1><9fe>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <9ff>   DW_AT_encoding    : 7	(unsigned)
    <a00>   DW_AT_byte_size   : 1
    <a01>   DW_AT_type        : <0x27d>
    <a05>   DW_AT_decl_file   : 11
    <a06>   DW_AT_decl_line   : 68
    <a07>   DW_AT_decl_column : 1
    <a08>   DW_AT_sibling     : <0xa19>
 <2><a0c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x8aabc): GPIO_PIN_RESET
    <a11>   DW_AT_const_value : 0
 <2><a12>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a13>   DW_AT_name        : (indirect string, offset: 0x8a6c3): GPIO_PIN_SET
    <a17>   DW_AT_const_value : 1
 <2><a18>: Abbrev Number: 0
 <1><a19>: Abbrev Number: 6 (DW_TAG_typedef)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x8ee1c): GPIO_PinState
    <a1e>   DW_AT_decl_file   : 11
    <a1f>   DW_AT_decl_line   : 71
    <a20>   DW_AT_decl_column : 2
    <a21>   DW_AT_type        : <0x9fe>
 <1><a25>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a26>   DW_AT_byte_size   : 48
    <a27>   DW_AT_decl_file   : 12
    <a28>   DW_AT_decl_line   : 48
    <a29>   DW_AT_decl_column : 9
    <a2a>   DW_AT_sibling     : <0xacb>
 <2><a2e>: Abbrev Number: 14 (DW_TAG_member)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x8e2f5): Channel
    <a33>   DW_AT_decl_file   : 12
    <a34>   DW_AT_decl_line   : 50
    <a35>   DW_AT_decl_column : 12
    <a36>   DW_AT_type        : <0x2f6>
    <a3a>   DW_AT_data_member_location: 0
 <2><a3b>: Abbrev Number: 14 (DW_TAG_member)
    <a3c>   DW_AT_name        : (indirect string, offset: 0x8b507): Direction
    <a40>   DW_AT_decl_file   : 12
    <a41>   DW_AT_decl_line   : 53
    <a42>   DW_AT_decl_column : 12
    <a43>   DW_AT_type        : <0x2f6>
    <a47>   DW_AT_data_member_location: 4
 <2><a48>: Abbrev Number: 14 (DW_TAG_member)
    <a49>   DW_AT_name        : (indirect string, offset: 0x89d3b): PeriphInc
    <a4d>   DW_AT_decl_file   : 12
    <a4e>   DW_AT_decl_line   : 57
    <a4f>   DW_AT_decl_column : 12
    <a50>   DW_AT_type        : <0x2f6>
    <a54>   DW_AT_data_member_location: 8
 <2><a55>: Abbrev Number: 14 (DW_TAG_member)
    <a56>   DW_AT_name        : (indirect string, offset: 0x8a465): MemInc
    <a5a>   DW_AT_decl_file   : 12
    <a5b>   DW_AT_decl_line   : 60
    <a5c>   DW_AT_decl_column : 12
    <a5d>   DW_AT_type        : <0x2f6>
    <a61>   DW_AT_data_member_location: 12
 <2><a62>: Abbrev Number: 14 (DW_TAG_member)
    <a63>   DW_AT_name        : (indirect string, offset: 0x8c01e): PeriphDataAlignment
    <a67>   DW_AT_decl_file   : 12
    <a68>   DW_AT_decl_line   : 63
    <a69>   DW_AT_decl_column : 12
    <a6a>   DW_AT_type        : <0x2f6>
    <a6e>   DW_AT_data_member_location: 16
 <2><a6f>: Abbrev Number: 14 (DW_TAG_member)
    <a70>   DW_AT_name        : (indirect string, offset: 0x8e3ec): MemDataAlignment
    <a74>   DW_AT_decl_file   : 12
    <a75>   DW_AT_decl_line   : 66
    <a76>   DW_AT_decl_column : 12
    <a77>   DW_AT_type        : <0x2f6>
    <a7b>   DW_AT_data_member_location: 20
 <2><a7c>: Abbrev Number: 14 (DW_TAG_member)
    <a7d>   DW_AT_name        : (indirect string, offset: 0x904f8): Mode
    <a81>   DW_AT_decl_file   : 12
    <a82>   DW_AT_decl_line   : 69
    <a83>   DW_AT_decl_column : 12
    <a84>   DW_AT_type        : <0x2f6>
    <a88>   DW_AT_data_member_location: 24
 <2><a89>: Abbrev Number: 14 (DW_TAG_member)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x8fb50): Priority
    <a8e>   DW_AT_decl_file   : 12
    <a8f>   DW_AT_decl_line   : 74
    <a90>   DW_AT_decl_column : 12
    <a91>   DW_AT_type        : <0x2f6>
    <a95>   DW_AT_data_member_location: 28
 <2><a96>: Abbrev Number: 14 (DW_TAG_member)
    <a97>   DW_AT_name        : (indirect string, offset: 0x8ba90): FIFOMode
    <a9b>   DW_AT_decl_file   : 12
    <a9c>   DW_AT_decl_line   : 77
    <a9d>   DW_AT_decl_column : 12
    <a9e>   DW_AT_type        : <0x2f6>
    <aa2>   DW_AT_data_member_location: 32
 <2><aa3>: Abbrev Number: 14 (DW_TAG_member)
    <aa4>   DW_AT_name        : (indirect string, offset: 0x8d760): FIFOThreshold
    <aa8>   DW_AT_decl_file   : 12
    <aa9>   DW_AT_decl_line   : 82
    <aaa>   DW_AT_decl_column : 12
    <aab>   DW_AT_type        : <0x2f6>
    <aaf>   DW_AT_data_member_location: 36
 <2><ab0>: Abbrev Number: 14 (DW_TAG_member)
    <ab1>   DW_AT_name        : (indirect string, offset: 0x8d72a): MemBurst
    <ab5>   DW_AT_decl_file   : 12
    <ab6>   DW_AT_decl_line   : 85
    <ab7>   DW_AT_decl_column : 12
    <ab8>   DW_AT_type        : <0x2f6>
    <abc>   DW_AT_data_member_location: 40
 <2><abd>: Abbrev Number: 14 (DW_TAG_member)
    <abe>   DW_AT_name        : (indirect string, offset: 0x8b393): PeriphBurst
    <ac2>   DW_AT_decl_file   : 12
    <ac3>   DW_AT_decl_line   : 91
    <ac4>   DW_AT_decl_column : 12
    <ac5>   DW_AT_type        : <0x2f6>
    <ac9>   DW_AT_data_member_location: 44
 <2><aca>: Abbrev Number: 0
 <1><acb>: Abbrev Number: 6 (DW_TAG_typedef)
    <acc>   DW_AT_name        : (indirect string, offset: 0x8af69): DMA_InitTypeDef
    <ad0>   DW_AT_decl_file   : 12
    <ad1>   DW_AT_decl_line   : 96
    <ad2>   DW_AT_decl_column : 2
    <ad3>   DW_AT_type        : <0xa25>
 <1><ad7>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <ad8>   DW_AT_encoding    : 7	(unsigned)
    <ad9>   DW_AT_byte_size   : 1
    <ada>   DW_AT_type        : <0x27d>
    <ade>   DW_AT_decl_file   : 12
    <adf>   DW_AT_decl_line   : 103
    <ae0>   DW_AT_decl_column : 1
    <ae1>   DW_AT_sibling     : <0xb0a>
 <2><ae5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x8d6b2): HAL_DMA_STATE_RESET
    <aea>   DW_AT_const_value : 0
 <2><aeb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <aec>   DW_AT_name        : (indirect string, offset: 0x8afe4): HAL_DMA_STATE_READY
    <af0>   DW_AT_const_value : 1
 <2><af1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <af2>   DW_AT_name        : (indirect string, offset: 0x8d3f1): HAL_DMA_STATE_BUSY
    <af6>   DW_AT_const_value : 2
 <2><af7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <af8>   DW_AT_name        : (indirect string, offset: 0x8ee2a): HAL_DMA_STATE_TIMEOUT
    <afc>   DW_AT_const_value : 3
 <2><afd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <afe>   DW_AT_name        : (indirect string, offset: 0x8df35): HAL_DMA_STATE_ERROR
    <b02>   DW_AT_const_value : 4
 <2><b03>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b04>   DW_AT_name        : (indirect string, offset: 0x8ace1): HAL_DMA_STATE_ABORT
    <b08>   DW_AT_const_value : 5
 <2><b09>: Abbrev Number: 0
 <1><b0a>: Abbrev Number: 6 (DW_TAG_typedef)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x8d117): HAL_DMA_StateTypeDef
    <b0f>   DW_AT_decl_file   : 12
    <b10>   DW_AT_decl_line   : 110
    <b11>   DW_AT_decl_column : 2
    <b12>   DW_AT_type        : <0xad7>
 <1><b16>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <b17>   DW_AT_type        : <0xb0a>
 <1><b1b>: Abbrev Number: 20 (DW_TAG_structure_type)
    <b1c>   DW_AT_name        : (indirect string, offset: 0x8dec3): __DMA_HandleTypeDef
    <b20>   DW_AT_byte_size   : 96
    <b21>   DW_AT_decl_file   : 12
    <b22>   DW_AT_decl_line   : 138
    <b23>   DW_AT_decl_column : 16
    <b24>   DW_AT_sibling     : <0xbdf>
 <2><b28>: Abbrev Number: 14 (DW_TAG_member)
    <b29>   DW_AT_name        : (indirect string, offset: 0x8b714): Instance
    <b2d>   DW_AT_decl_file   : 12
    <b2e>   DW_AT_decl_line   : 140
    <b2f>   DW_AT_decl_column : 31
    <b30>   DW_AT_type        : <0xbdf>
    <b34>   DW_AT_data_member_location: 0
 <2><b35>: Abbrev Number: 14 (DW_TAG_member)
    <b36>   DW_AT_name        : (indirect string, offset: 0x8a130): Init
    <b3a>   DW_AT_decl_file   : 12
    <b3b>   DW_AT_decl_line   : 142
    <b3c>   DW_AT_decl_column : 30
    <b3d>   DW_AT_type        : <0xacb>
    <b41>   DW_AT_data_member_location: 4
 <2><b42>: Abbrev Number: 14 (DW_TAG_member)
    <b43>   DW_AT_name        : (indirect string, offset: 0x46229): Lock
    <b47>   DW_AT_decl_file   : 12
    <b48>   DW_AT_decl_line   : 144
    <b49>   DW_AT_decl_column : 30
    <b4a>   DW_AT_type        : <0x86f>
    <b4e>   DW_AT_data_member_location: 52
 <2><b4f>: Abbrev Number: 14 (DW_TAG_member)
    <b50>   DW_AT_name        : (indirect string, offset: 0x8d1db): State
    <b54>   DW_AT_decl_file   : 12
    <b55>   DW_AT_decl_line   : 146
    <b56>   DW_AT_decl_column : 30
    <b57>   DW_AT_type        : <0xb16>
    <b5b>   DW_AT_data_member_location: 53
 <2><b5c>: Abbrev Number: 14 (DW_TAG_member)
    <b5d>   DW_AT_name        : (indirect string, offset: 0x8ec5d): Parent
    <b61>   DW_AT_decl_file   : 12
    <b62>   DW_AT_decl_line   : 148
    <b63>   DW_AT_decl_column : 31
    <b64>   DW_AT_type        : <0xbe5>
    <b68>   DW_AT_data_member_location: 56
 <2><b69>: Abbrev Number: 14 (DW_TAG_member)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x8ef7a): XferCpltCallback
    <b6e>   DW_AT_decl_file   : 12
    <b6f>   DW_AT_decl_line   : 150
    <b70>   DW_AT_decl_column : 33
    <b71>   DW_AT_type        : <0xbf8>
    <b75>   DW_AT_data_member_location: 60
 <2><b76>: Abbrev Number: 14 (DW_TAG_member)
    <b77>   DW_AT_name        : (indirect string, offset: 0x8d8b1): XferHalfCpltCallback
    <b7b>   DW_AT_decl_file   : 12
    <b7c>   DW_AT_decl_line   : 152
    <b7d>   DW_AT_decl_column : 33
    <b7e>   DW_AT_type        : <0xbf8>
    <b82>   DW_AT_data_member_location: 64
 <2><b83>: Abbrev Number: 14 (DW_TAG_member)
    <b84>   DW_AT_name        : (indirect string, offset: 0x8ae13): XferM1CpltCallback
    <b88>   DW_AT_decl_file   : 12
    <b89>   DW_AT_decl_line   : 154
    <b8a>   DW_AT_decl_column : 33
    <b8b>   DW_AT_type        : <0xbf8>
    <b8f>   DW_AT_data_member_location: 68
 <2><b90>: Abbrev Number: 14 (DW_TAG_member)
    <b91>   DW_AT_name        : (indirect string, offset: 0x8c4d2): XferM1HalfCpltCallback
    <b95>   DW_AT_decl_file   : 12
    <b96>   DW_AT_decl_line   : 156
    <b97>   DW_AT_decl_column : 33
    <b98>   DW_AT_type        : <0xbf8>
    <b9c>   DW_AT_data_member_location: 72
 <2><b9d>: Abbrev Number: 14 (DW_TAG_member)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x8a297): XferErrorCallback
    <ba2>   DW_AT_decl_file   : 12
    <ba3>   DW_AT_decl_line   : 158
    <ba4>   DW_AT_decl_column : 33
    <ba5>   DW_AT_type        : <0xbf8>
    <ba9>   DW_AT_data_member_location: 76
 <2><baa>: Abbrev Number: 14 (DW_TAG_member)
    <bab>   DW_AT_name        : (indirect string, offset: 0x8ea08): XferAbortCallback
    <baf>   DW_AT_decl_file   : 12
    <bb0>   DW_AT_decl_line   : 160
    <bb1>   DW_AT_decl_column : 33
    <bb2>   DW_AT_type        : <0xbf8>
    <bb6>   DW_AT_data_member_location: 80
 <2><bb7>: Abbrev Number: 14 (DW_TAG_member)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x8edb8): ErrorCode
    <bbc>   DW_AT_decl_file   : 12
    <bbd>   DW_AT_decl_line   : 162
    <bbe>   DW_AT_decl_column : 30
    <bbf>   DW_AT_type        : <0x302>
    <bc3>   DW_AT_data_member_location: 84
 <2><bc4>: Abbrev Number: 14 (DW_TAG_member)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x8d74e): StreamBaseAddress
    <bc9>   DW_AT_decl_file   : 12
    <bca>   DW_AT_decl_line   : 164
    <bcb>   DW_AT_decl_column : 30
    <bcc>   DW_AT_type        : <0x2f6>
    <bd0>   DW_AT_data_member_location: 88
 <2><bd1>: Abbrev Number: 14 (DW_TAG_member)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x8dd5e): StreamIndex
    <bd6>   DW_AT_decl_file   : 12
    <bd7>   DW_AT_decl_line   : 166
    <bd8>   DW_AT_decl_column : 30
    <bd9>   DW_AT_type        : <0x2f6>
    <bdd>   DW_AT_data_member_location: 92
 <2><bde>: Abbrev Number: 0
 <1><bdf>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <be0>   DW_AT_byte_size   : 4
    <be1>   DW_AT_type        : <0x37e>
 <1><be5>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <be6>   DW_AT_byte_size   : 4
 <1><be7>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <be8>   DW_AT_prototyped  : 1
    <be8>   DW_AT_sibling     : <0xbf2>
 <2><bec>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <bed>   DW_AT_type        : <0xbf2>
 <2><bf1>: Abbrev Number: 0
 <1><bf2>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <bf3>   DW_AT_byte_size   : 4
    <bf4>   DW_AT_type        : <0xb1b>
 <1><bf8>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <bf9>   DW_AT_byte_size   : 4
    <bfa>   DW_AT_type        : <0xbe7>
 <1><bfe>: Abbrev Number: 6 (DW_TAG_typedef)
    <bff>   DW_AT_name        : (indirect string, offset: 0x8dec5): DMA_HandleTypeDef
    <c03>   DW_AT_decl_file   : 12
    <c04>   DW_AT_decl_line   : 168
    <c05>   DW_AT_decl_column : 2
    <c06>   DW_AT_type        : <0xb1b>
 <1><c0a>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c0b>   DW_AT_byte_size   : 24
    <c0c>   DW_AT_decl_file   : 13
    <c0d>   DW_AT_decl_line   : 46
    <c0e>   DW_AT_decl_column : 9
    <c0f>   DW_AT_sibling     : <0xc62>
 <2><c13>: Abbrev Number: 14 (DW_TAG_member)
    <c14>   DW_AT_name        : (indirect string, offset: 0x9076d): Prescaler
    <c18>   DW_AT_decl_file   : 13
    <c19>   DW_AT_decl_line   : 48
    <c1a>   DW_AT_decl_column : 12
    <c1b>   DW_AT_type        : <0x2f6>
    <c1f>   DW_AT_data_member_location: 0
 <2><c20>: Abbrev Number: 14 (DW_TAG_member)
    <c21>   DW_AT_name        : (indirect string, offset: 0x8e87a): CounterMode
    <c25>   DW_AT_decl_file   : 13
    <c26>   DW_AT_decl_line   : 51
    <c27>   DW_AT_decl_column : 12
    <c28>   DW_AT_type        : <0x2f6>
    <c2c>   DW_AT_data_member_location: 4
 <2><c2d>: Abbrev Number: 14 (DW_TAG_member)
    <c2e>   DW_AT_name        : (indirect string, offset: 0x9614d): Period
    <c32>   DW_AT_decl_file   : 13
    <c33>   DW_AT_decl_line   : 54
    <c34>   DW_AT_decl_column : 12
    <c35>   DW_AT_type        : <0x2f6>
    <c39>   DW_AT_data_member_location: 8
 <2><c3a>: Abbrev Number: 14 (DW_TAG_member)
    <c3b>   DW_AT_name        : (indirect string, offset: 0x8b7ba): ClockDivision
    <c3f>   DW_AT_decl_file   : 13
    <c40>   DW_AT_decl_line   : 58
    <c41>   DW_AT_decl_column : 12
    <c42>   DW_AT_type        : <0x2f6>
    <c46>   DW_AT_data_member_location: 12
 <2><c47>: Abbrev Number: 14 (DW_TAG_member)
    <c48>   DW_AT_name        : (indirect string, offset: 0x8d4c8): RepetitionCounter
    <c4c>   DW_AT_decl_file   : 13
    <c4d>   DW_AT_decl_line   : 61
    <c4e>   DW_AT_decl_column : 12
    <c4f>   DW_AT_type        : <0x2f6>
    <c53>   DW_AT_data_member_location: 16
 <2><c54>: Abbrev Number: 14 (DW_TAG_member)
    <c55>   DW_AT_name        : (indirect string, offset: 0x8e978): AutoReloadPreload
    <c59>   DW_AT_decl_file   : 13
    <c5a>   DW_AT_decl_line   : 72
    <c5b>   DW_AT_decl_column : 12
    <c5c>   DW_AT_type        : <0x2f6>
    <c60>   DW_AT_data_member_location: 20
 <2><c61>: Abbrev Number: 0
 <1><c62>: Abbrev Number: 6 (DW_TAG_typedef)
    <c63>   DW_AT_name        : (indirect string, offset: 0x8e2fd): TIM_Base_InitTypeDef
    <c67>   DW_AT_decl_file   : 13
    <c68>   DW_AT_decl_line   : 74
    <c69>   DW_AT_decl_column : 3
    <c6a>   DW_AT_type        : <0xc0a>
 <1><c6e>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c6f>   DW_AT_byte_size   : 16
    <c70>   DW_AT_decl_file   : 13
    <c71>   DW_AT_decl_line   : 198
    <c72>   DW_AT_decl_column : 9
    <c73>   DW_AT_sibling     : <0xcac>
 <2><c77>: Abbrev Number: 14 (DW_TAG_member)
    <c78>   DW_AT_name        : (indirect string, offset: 0x8a387): ClockSource
    <c7c>   DW_AT_decl_file   : 13
    <c7d>   DW_AT_decl_line   : 200
    <c7e>   DW_AT_decl_column : 12
    <c7f>   DW_AT_type        : <0x2f6>
    <c83>   DW_AT_data_member_location: 0
 <2><c84>: Abbrev Number: 14 (DW_TAG_member)
    <c85>   DW_AT_name        : (indirect string, offset: 0x8c4e9): ClockPolarity
    <c89>   DW_AT_decl_file   : 13
    <c8a>   DW_AT_decl_line   : 202
    <c8b>   DW_AT_decl_column : 12
    <c8c>   DW_AT_type        : <0x2f6>
    <c90>   DW_AT_data_member_location: 4
 <2><c91>: Abbrev Number: 14 (DW_TAG_member)
    <c92>   DW_AT_name        : (indirect string, offset: 0x8e192): ClockPrescaler
    <c96>   DW_AT_decl_file   : 13
    <c97>   DW_AT_decl_line   : 204
    <c98>   DW_AT_decl_column : 12
    <c99>   DW_AT_type        : <0x2f6>
    <c9d>   DW_AT_data_member_location: 8
 <2><c9e>: Abbrev Number: 14 (DW_TAG_member)
    <c9f>   DW_AT_name        : (indirect string, offset: 0x8cf0f): ClockFilter
    <ca3>   DW_AT_decl_file   : 13
    <ca4>   DW_AT_decl_line   : 206
    <ca5>   DW_AT_decl_column : 12
    <ca6>   DW_AT_type        : <0x2f6>
    <caa>   DW_AT_data_member_location: 12
 <2><cab>: Abbrev Number: 0
 <1><cac>: Abbrev Number: 6 (DW_TAG_typedef)
    <cad>   DW_AT_name        : (indirect string, offset: 0x89a1f): TIM_ClockConfigTypeDef
    <cb1>   DW_AT_decl_file   : 13
    <cb2>   DW_AT_decl_line   : 208
    <cb3>   DW_AT_decl_column : 3
    <cb4>   DW_AT_type        : <0xc6e>
 <1><cb8>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cb9>   DW_AT_byte_size   : 8
    <cba>   DW_AT_decl_file   : 13
    <cbb>   DW_AT_decl_line   : 231
    <cbc>   DW_AT_decl_column : 9
    <cbd>   DW_AT_sibling     : <0xcdc>
 <2><cc1>: Abbrev Number: 14 (DW_TAG_member)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x8c7cd): MasterOutputTrigger
    <cc6>   DW_AT_decl_file   : 13
    <cc7>   DW_AT_decl_line   : 233
    <cc8>   DW_AT_decl_column : 13
    <cc9>   DW_AT_type        : <0x2f6>
    <ccd>   DW_AT_data_member_location: 0
 <2><cce>: Abbrev Number: 14 (DW_TAG_member)
    <ccf>   DW_AT_name        : (indirect string, offset: 0x8c2b2): MasterSlaveMode
    <cd3>   DW_AT_decl_file   : 13
    <cd4>   DW_AT_decl_line   : 235
    <cd5>   DW_AT_decl_column : 13
    <cd6>   DW_AT_type        : <0x2f6>
    <cda>   DW_AT_data_member_location: 4
 <2><cdb>: Abbrev Number: 0
 <1><cdc>: Abbrev Number: 6 (DW_TAG_typedef)
    <cdd>   DW_AT_name        : (indirect string, offset: 0x8d5d4): TIM_MasterConfigTypeDef
    <ce1>   DW_AT_decl_file   : 13
    <ce2>   DW_AT_decl_line   : 242
    <ce3>   DW_AT_decl_column : 3
    <ce4>   DW_AT_type        : <0xcb8>
 <1><ce8>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <ce9>   DW_AT_encoding    : 7	(unsigned)
    <cea>   DW_AT_byte_size   : 1
    <ceb>   DW_AT_type        : <0x27d>
    <cef>   DW_AT_decl_file   : 13
    <cf0>   DW_AT_decl_line   : 291
    <cf2>   DW_AT_decl_column : 1
    <cf3>   DW_AT_sibling     : <0xd16>
 <2><cf7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cf8>   DW_AT_name        : (indirect string, offset: 0x8e087): HAL_TIM_STATE_RESET
    <cfc>   DW_AT_const_value : 0
 <2><cfd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x89a42): HAL_TIM_STATE_READY
    <d02>   DW_AT_const_value : 1
 <2><d03>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d04>   DW_AT_name        : (indirect string, offset: 0x8ae8d): HAL_TIM_STATE_BUSY
    <d08>   DW_AT_const_value : 2
 <2><d09>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d0a>   DW_AT_name        : (indirect string, offset: 0x8dd3b): HAL_TIM_STATE_TIMEOUT
    <d0e>   DW_AT_const_value : 3
 <2><d0f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d10>   DW_AT_name        : (indirect string, offset: 0x8b46d): HAL_TIM_STATE_ERROR
    <d14>   DW_AT_const_value : 4
 <2><d15>: Abbrev Number: 0
 <1><d16>: Abbrev Number: 18 (DW_TAG_typedef)
    <d17>   DW_AT_name        : (indirect string, offset: 0x8d5f8): HAL_TIM_StateTypeDef
    <d1b>   DW_AT_decl_file   : 13
    <d1c>   DW_AT_decl_line   : 297
    <d1e>   DW_AT_decl_column : 3
    <d1f>   DW_AT_type        : <0xce8>
 <1><d23>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <d24>   DW_AT_type        : <0xd16>
 <1><d28>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <d29>   DW_AT_encoding    : 7	(unsigned)
    <d2a>   DW_AT_byte_size   : 1
    <d2b>   DW_AT_type        : <0x27d>
    <d2f>   DW_AT_decl_file   : 13
    <d30>   DW_AT_decl_line   : 303
    <d32>   DW_AT_decl_column : 1
    <d33>   DW_AT_sibling     : <0xd4a>
 <2><d37>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d38>   DW_AT_name        : (indirect string, offset: 0x8d51b): HAL_TIM_CHANNEL_STATE_RESET
    <d3c>   DW_AT_const_value : 0
 <2><d3d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x8d844): HAL_TIM_CHANNEL_STATE_READY
    <d42>   DW_AT_const_value : 1
 <2><d43>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d44>   DW_AT_name        : (indirect string, offset: 0x8ec20): HAL_TIM_CHANNEL_STATE_BUSY
    <d48>   DW_AT_const_value : 2
 <2><d49>: Abbrev Number: 0
 <1><d4a>: Abbrev Number: 18 (DW_TAG_typedef)
    <d4b>   DW_AT_name        : (indirect string, offset: 0x8ab6e): HAL_TIM_ChannelStateTypeDef
    <d4f>   DW_AT_decl_file   : 13
    <d50>   DW_AT_decl_line   : 307
    <d52>   DW_AT_decl_column : 3
    <d53>   DW_AT_type        : <0xd28>
 <1><d57>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <d58>   DW_AT_type        : <0xd4a>
 <1><d5c>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <d5d>   DW_AT_encoding    : 7	(unsigned)
    <d5e>   DW_AT_byte_size   : 1
    <d5f>   DW_AT_type        : <0x27d>
    <d63>   DW_AT_decl_file   : 13
    <d64>   DW_AT_decl_line   : 313
    <d66>   DW_AT_decl_column : 1
    <d67>   DW_AT_sibling     : <0xd7e>
 <2><d6b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d6c>   DW_AT_name        : (indirect string, offset: 0x8997d): HAL_DMA_BURST_STATE_RESET
    <d70>   DW_AT_const_value : 0
 <2><d71>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d72>   DW_AT_name        : (indirect string, offset: 0x8c498): HAL_DMA_BURST_STATE_READY
    <d76>   DW_AT_const_value : 1
 <2><d77>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d78>   DW_AT_name        : (indirect string, offset: 0x8b33d): HAL_DMA_BURST_STATE_BUSY
    <d7c>   DW_AT_const_value : 2
 <2><d7d>: Abbrev Number: 0
 <1><d7e>: Abbrev Number: 18 (DW_TAG_typedef)
    <d7f>   DW_AT_name        : (indirect string, offset: 0x8a229): HAL_TIM_DMABurstStateTypeDef
    <d83>   DW_AT_decl_file   : 13
    <d84>   DW_AT_decl_line   : 317
    <d86>   DW_AT_decl_column : 3
    <d87>   DW_AT_type        : <0xd5c>
 <1><d8b>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <d8c>   DW_AT_type        : <0xd7e>
 <1><d90>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <d91>   DW_AT_encoding    : 7	(unsigned)
    <d92>   DW_AT_byte_size   : 1
    <d93>   DW_AT_type        : <0x27d>
    <d97>   DW_AT_decl_file   : 13
    <d98>   DW_AT_decl_line   : 323
    <d9a>   DW_AT_decl_column : 1
    <d9b>   DW_AT_sibling     : <0xdbe>
 <2><d9f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <da0>   DW_AT_name        : (indirect string, offset: 0x8c540): HAL_TIM_ACTIVE_CHANNEL_1
    <da4>   DW_AT_const_value : 1
 <2><da5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <da6>   DW_AT_name        : (indirect string, offset: 0x8c559): HAL_TIM_ACTIVE_CHANNEL_2
    <daa>   DW_AT_const_value : 2
 <2><dab>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dac>   DW_AT_name        : (indirect string, offset: 0x8c572): HAL_TIM_ACTIVE_CHANNEL_3
    <db0>   DW_AT_const_value : 4
 <2><db1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <db2>   DW_AT_name        : (indirect string, offset: 0x8c58b): HAL_TIM_ACTIVE_CHANNEL_4
    <db6>   DW_AT_const_value : 8
 <2><db7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <db8>   DW_AT_name        : (indirect string, offset: 0x8b81c): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <dbc>   DW_AT_const_value : 0
 <2><dbd>: Abbrev Number: 0
 <1><dbe>: Abbrev Number: 18 (DW_TAG_typedef)
    <dbf>   DW_AT_name        : (indirect string, offset: 0x8c234): HAL_TIM_ActiveChannel
    <dc3>   DW_AT_decl_file   : 13
    <dc4>   DW_AT_decl_line   : 329
    <dc6>   DW_AT_decl_column : 3
    <dc7>   DW_AT_type        : <0xd90>
 <1><dcb>: Abbrev Number: 15 (DW_TAG_structure_type)
    <dcc>   DW_AT_byte_size   : 72
    <dcd>   DW_AT_decl_file   : 13
    <dce>   DW_AT_decl_line   : 337
    <dd0>   DW_AT_decl_column : 9
    <dd1>   DW_AT_sibling     : <0xe54>
 <2><dd5>: Abbrev Number: 16 (DW_TAG_member)
    <dd6>   DW_AT_name        : (indirect string, offset: 0x8b714): Instance
    <dda>   DW_AT_decl_file   : 13
    <ddb>   DW_AT_decl_line   : 340
    <ddd>   DW_AT_decl_column : 39
    <dde>   DW_AT_type        : <0xe54>
    <de2>   DW_AT_data_member_location: 0
 <2><de3>: Abbrev Number: 16 (DW_TAG_member)
    <de4>   DW_AT_name        : (indirect string, offset: 0x8a130): Init
    <de8>   DW_AT_decl_file   : 13
    <de9>   DW_AT_decl_line   : 341
    <deb>   DW_AT_decl_column : 38
    <dec>   DW_AT_type        : <0xc62>
    <df0>   DW_AT_data_member_location: 4
 <2><df1>: Abbrev Number: 16 (DW_TAG_member)
    <df2>   DW_AT_name        : (indirect string, offset: 0x8e2f5): Channel
    <df6>   DW_AT_decl_file   : 13
    <df7>   DW_AT_decl_line   : 342
    <df9>   DW_AT_decl_column : 38
    <dfa>   DW_AT_type        : <0xdbe>
    <dfe>   DW_AT_data_member_location: 28
 <2><dff>: Abbrev Number: 16 (DW_TAG_member)
    <e00>   DW_AT_name        : (indirect string, offset: 0x8c8ce): hdma
    <e04>   DW_AT_decl_file   : 13
    <e05>   DW_AT_decl_line   : 343
    <e07>   DW_AT_decl_column : 39
    <e08>   DW_AT_type        : <0xe5a>
    <e0c>   DW_AT_data_member_location: 32
 <2><e0d>: Abbrev Number: 16 (DW_TAG_member)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x46229): Lock
    <e12>   DW_AT_decl_file   : 13
    <e13>   DW_AT_decl_line   : 345
    <e15>   DW_AT_decl_column : 38
    <e16>   DW_AT_type        : <0x86f>
    <e1a>   DW_AT_data_member_location: 60
 <2><e1b>: Abbrev Number: 16 (DW_TAG_member)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x8d1db): State
    <e20>   DW_AT_decl_file   : 13
    <e21>   DW_AT_decl_line   : 346
    <e23>   DW_AT_decl_column : 38
    <e24>   DW_AT_type        : <0xd23>
    <e28>   DW_AT_data_member_location: 61
 <2><e29>: Abbrev Number: 16 (DW_TAG_member)
    <e2a>   DW_AT_name        : (indirect string, offset: 0x90f3c): ChannelState
    <e2e>   DW_AT_decl_file   : 13
    <e2f>   DW_AT_decl_line   : 347
    <e31>   DW_AT_decl_column : 38
    <e32>   DW_AT_type        : <0xe80>
    <e36>   DW_AT_data_member_location: 62
 <2><e37>: Abbrev Number: 16 (DW_TAG_member)
    <e38>   DW_AT_name        : (indirect string, offset: 0x91484): ChannelNState
    <e3c>   DW_AT_decl_file   : 13
    <e3d>   DW_AT_decl_line   : 348
    <e3f>   DW_AT_decl_column : 38
    <e40>   DW_AT_type        : <0xe80>
    <e44>   DW_AT_data_member_location: 66
 <2><e45>: Abbrev Number: 16 (DW_TAG_member)
    <e46>   DW_AT_name        : (indirect string, offset: 0x905eb): DMABurstState
    <e4a>   DW_AT_decl_file   : 13
    <e4b>   DW_AT_decl_line   : 349
    <e4d>   DW_AT_decl_column : 38
    <e4e>   DW_AT_type        : <0xd8b>
    <e52>   DW_AT_data_member_location: 70
 <2><e53>: Abbrev Number: 0
 <1><e54>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <e55>   DW_AT_byte_size   : 4
    <e56>   DW_AT_type        : <0x76e>
 <1><e5a>: Abbrev Number: 10 (DW_TAG_array_type)
    <e5b>   DW_AT_type        : <0xe6a>
    <e5f>   DW_AT_sibling     : <0xe6a>
 <2><e63>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <e64>   DW_AT_type        : <0x2cd>
    <e68>   DW_AT_upper_bound : 6
 <2><e69>: Abbrev Number: 0
 <1><e6a>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <e6b>   DW_AT_byte_size   : 4
    <e6c>   DW_AT_type        : <0xbfe>
 <1><e70>: Abbrev Number: 10 (DW_TAG_array_type)
    <e71>   DW_AT_type        : <0xd57>
    <e75>   DW_AT_sibling     : <0xe80>
 <2><e79>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <e7a>   DW_AT_type        : <0x2cd>
    <e7e>   DW_AT_upper_bound : 3
 <2><e7f>: Abbrev Number: 0
 <1><e80>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <e81>   DW_AT_type        : <0xe70>
 <1><e85>: Abbrev Number: 18 (DW_TAG_typedef)
    <e86>   DW_AT_name        : (indirect string, offset: 0x8b39f): TIM_HandleTypeDef
    <e8a>   DW_AT_decl_file   : 13
    <e8b>   DW_AT_decl_line   : 380
    <e8d>   DW_AT_decl_column : 3
    <e8e>   DW_AT_type        : <0xdcb>
 <1><e92>: Abbrev Number: 12 (DW_TAG_structure_type)
    <e93>   DW_AT_byte_size   : 28
    <e94>   DW_AT_decl_file   : 14
    <e95>   DW_AT_decl_line   : 46
    <e96>   DW_AT_decl_column : 9
    <e97>   DW_AT_sibling     : <0xef7>
 <2><e9b>: Abbrev Number: 14 (DW_TAG_member)
    <e9c>   DW_AT_name        : (indirect string, offset: 0x8e918): BaudRate
    <ea0>   DW_AT_decl_file   : 14
    <ea1>   DW_AT_decl_line   : 48
    <ea2>   DW_AT_decl_column : 12
    <ea3>   DW_AT_type        : <0x2f6>
    <ea7>   DW_AT_data_member_location: 0
 <2><ea8>: Abbrev Number: 14 (DW_TAG_member)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x89a09): WordLength
    <ead>   DW_AT_decl_file   : 14
    <eae>   DW_AT_decl_line   : 54
    <eaf>   DW_AT_decl_column : 12
    <eb0>   DW_AT_type        : <0x2f6>
    <eb4>   DW_AT_data_member_location: 4
 <2><eb5>: Abbrev Number: 14 (DW_TAG_member)
    <eb6>   DW_AT_name        : (indirect string, offset: 0x8e921): StopBits
    <eba>   DW_AT_decl_file   : 14
    <ebb>   DW_AT_decl_line   : 57
    <ebc>   DW_AT_decl_column : 12
    <ebd>   DW_AT_type        : <0x2f6>
    <ec1>   DW_AT_data_member_location: 8
 <2><ec2>: Abbrev Number: 14 (DW_TAG_member)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x8b445): Parity
    <ec7>   DW_AT_decl_file   : 14
    <ec8>   DW_AT_decl_line   : 60
    <ec9>   DW_AT_decl_column : 12
    <eca>   DW_AT_type        : <0x2f6>
    <ece>   DW_AT_data_member_location: 12
 <2><ecf>: Abbrev Number: 14 (DW_TAG_member)
    <ed0>   DW_AT_name        : (indirect string, offset: 0x904f8): Mode
    <ed4>   DW_AT_decl_file   : 14
    <ed5>   DW_AT_decl_line   : 67
    <ed6>   DW_AT_decl_column : 12
    <ed7>   DW_AT_type        : <0x2f6>
    <edb>   DW_AT_data_member_location: 16
 <2><edc>: Abbrev Number: 14 (DW_TAG_member)
    <edd>   DW_AT_name        : (indirect string, offset: 0x8a135): HwFlowCtl
    <ee1>   DW_AT_decl_file   : 14
    <ee2>   DW_AT_decl_line   : 70
    <ee3>   DW_AT_decl_column : 12
    <ee4>   DW_AT_type        : <0x2f6>
    <ee8>   DW_AT_data_member_location: 20
 <2><ee9>: Abbrev Number: 14 (DW_TAG_member)
    <eea>   DW_AT_name        : (indirect string, offset: 0x8dd51): OverSampling
    <eee>   DW_AT_decl_file   : 14
    <eef>   DW_AT_decl_line   : 73
    <ef0>   DW_AT_decl_column : 12
    <ef1>   DW_AT_type        : <0x2f6>
    <ef5>   DW_AT_data_member_location: 24
 <2><ef6>: Abbrev Number: 0
 <1><ef7>: Abbrev Number: 6 (DW_TAG_typedef)
    <ef8>   DW_AT_name        : (indirect string, offset: 0x8b079): UART_InitTypeDef
    <efc>   DW_AT_decl_file   : 14
    <efd>   DW_AT_decl_line   : 75
    <efe>   DW_AT_decl_column : 3
    <eff>   DW_AT_type        : <0xe92>
 <1><f03>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <f04>   DW_AT_encoding    : 7	(unsigned)
    <f05>   DW_AT_byte_size   : 1
    <f06>   DW_AT_type        : <0x27d>
    <f0a>   DW_AT_decl_file   : 14
    <f0b>   DW_AT_decl_line   : 117
    <f0c>   DW_AT_decl_column : 1
    <f0d>   DW_AT_sibling     : <0xf42>
 <2><f11>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f12>   DW_AT_name        : (indirect string, offset: 0x8c7b8): HAL_UART_STATE_RESET
    <f16>   DW_AT_const_value : 0
 <2><f17>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f18>   DW_AT_name        : (indirect string, offset: 0x8a101): HAL_UART_STATE_READY
    <f1c>   DW_AT_const_value : 32
 <2><f1d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f1e>   DW_AT_name        : (indirect string, offset: 0x8e1fd): HAL_UART_STATE_BUSY
    <f22>   DW_AT_const_value : 36
 <2><f23>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f24>   DW_AT_name        : (indirect string, offset: 0x89887): HAL_UART_STATE_BUSY_TX
    <f28>   DW_AT_const_value : 33
 <2><f29>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f2a>   DW_AT_name        : (indirect string, offset: 0x89852): HAL_UART_STATE_BUSY_RX
    <f2e>   DW_AT_const_value : 34
 <2><f2f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f30>   DW_AT_name        : (indirect string, offset: 0x8ac9d): HAL_UART_STATE_BUSY_TX_RX
    <f34>   DW_AT_const_value : 35
 <2><f35>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f36>   DW_AT_name        : (indirect string, offset: 0x8be01): HAL_UART_STATE_TIMEOUT
    <f3a>   DW_AT_const_value : 160
 <2><f3b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x8d483): HAL_UART_STATE_ERROR
    <f40>   DW_AT_const_value : 224
 <2><f41>: Abbrev Number: 0
 <1><f42>: Abbrev Number: 6 (DW_TAG_typedef)
    <f43>   DW_AT_name        : (indirect string, offset: 0x8b199): HAL_UART_StateTypeDef
    <f47>   DW_AT_decl_file   : 14
    <f48>   DW_AT_decl_line   : 135
    <f49>   DW_AT_decl_column : 3
    <f4a>   DW_AT_type        : <0xf03>
 <1><f4e>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <f4f>   DW_AT_type        : <0xf42>
 <1><f53>: Abbrev Number: 6 (DW_TAG_typedef)
    <f54>   DW_AT_name        : (indirect string, offset: 0x8b7e8): HAL_UART_RxTypeTypeDef
    <f58>   DW_AT_decl_file   : 14
    <f59>   DW_AT_decl_line   : 144
    <f5a>   DW_AT_decl_column : 18
    <f5b>   DW_AT_type        : <0x2f6>
 <1><f5f>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <f60>   DW_AT_type        : <0xf53>
 <1><f64>: Abbrev Number: 20 (DW_TAG_structure_type)
    <f65>   DW_AT_name        : (indirect string, offset: 0x8c73c): __UART_HandleTypeDef
    <f69>   DW_AT_byte_size   : 68
    <f6a>   DW_AT_decl_file   : 14
    <f6b>   DW_AT_decl_line   : 149
    <f6c>   DW_AT_decl_column : 16
    <f6d>   DW_AT_sibling     : <0x1035>
 <2><f71>: Abbrev Number: 14 (DW_TAG_member)
    <f72>   DW_AT_name        : (indirect string, offset: 0x8b714): Instance
    <f76>   DW_AT_decl_file   : 14
    <f77>   DW_AT_decl_line   : 151
    <f78>   DW_AT_decl_column : 34
    <f79>   DW_AT_type        : <0x1035>
    <f7d>   DW_AT_data_member_location: 0
 <2><f7e>: Abbrev Number: 14 (DW_TAG_member)
    <f7f>   DW_AT_name        : (indirect string, offset: 0x8a130): Init
    <f83>   DW_AT_decl_file   : 14
    <f84>   DW_AT_decl_line   : 153
    <f85>   DW_AT_decl_column : 33
    <f86>   DW_AT_type        : <0xef7>
    <f8a>   DW_AT_data_member_location: 4
 <2><f8b>: Abbrev Number: 14 (DW_TAG_member)
    <f8c>   DW_AT_name        : (indirect string, offset: 0x8bdbd): pTxBuffPtr
    <f90>   DW_AT_decl_file   : 14
    <f91>   DW_AT_decl_line   : 155
    <f92>   DW_AT_decl_column : 34
    <f93>   DW_AT_type        : <0x103b>
    <f97>   DW_AT_data_member_location: 32
 <2><f98>: Abbrev Number: 14 (DW_TAG_member)
    <f99>   DW_AT_name        : (indirect string, offset: 0x89a14): TxXferSize
    <f9d>   DW_AT_decl_file   : 14
    <f9e>   DW_AT_decl_line   : 157
    <f9f>   DW_AT_decl_column : 33
    <fa0>   DW_AT_type        : <0x2e5>
    <fa4>   DW_AT_data_member_location: 36
 <2><fa5>: Abbrev Number: 14 (DW_TAG_member)
    <fa6>   DW_AT_name        : (indirect string, offset: 0x8bddf): TxXferCount
    <faa>   DW_AT_decl_file   : 14
    <fab>   DW_AT_decl_line   : 159
    <fac>   DW_AT_decl_column : 33
    <fad>   DW_AT_type        : <0x2f1>
    <fb1>   DW_AT_data_member_location: 38
 <2><fb2>: Abbrev Number: 14 (DW_TAG_member)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x8e9e5): pRxBuffPtr
    <fb7>   DW_AT_decl_file   : 14
    <fb8>   DW_AT_decl_line   : 161
    <fb9>   DW_AT_decl_column : 34
    <fba>   DW_AT_type        : <0x1041>
    <fbe>   DW_AT_data_member_location: 40
 <2><fbf>: Abbrev Number: 14 (DW_TAG_member)
    <fc0>   DW_AT_name        : (indirect string, offset: 0x8c032): RxXferSize
    <fc4>   DW_AT_decl_file   : 14
    <fc5>   DW_AT_decl_line   : 163
    <fc6>   DW_AT_decl_column : 33
    <fc7>   DW_AT_type        : <0x2e5>
    <fcb>   DW_AT_data_member_location: 44
 <2><fcc>: Abbrev Number: 14 (DW_TAG_member)
    <fcd>   DW_AT_name        : (indirect string, offset: 0x8c8d3): RxXferCount
    <fd1>   DW_AT_decl_file   : 14
    <fd2>   DW_AT_decl_line   : 165
    <fd3>   DW_AT_decl_column : 33
    <fd4>   DW_AT_type        : <0x2f1>
    <fd8>   DW_AT_data_member_location: 46
 <2><fd9>: Abbrev Number: 14 (DW_TAG_member)
    <fda>   DW_AT_name        : (indirect string, offset: 0x8dd14): ReceptionType
    <fde>   DW_AT_decl_file   : 14
    <fdf>   DW_AT_decl_line   : 167
    <fe0>   DW_AT_decl_column : 31
    <fe1>   DW_AT_type        : <0xf5f>
    <fe5>   DW_AT_data_member_location: 48
 <2><fe6>: Abbrev Number: 14 (DW_TAG_member)
    <fe7>   DW_AT_name        : (indirect string, offset: 0x8ed6d): hdmatx
    <feb>   DW_AT_decl_file   : 14
    <fec>   DW_AT_decl_line   : 169
    <fed>   DW_AT_decl_column : 34
    <fee>   DW_AT_type        : <0xe6a>
    <ff2>   DW_AT_data_member_location: 52
 <2><ff3>: Abbrev Number: 14 (DW_TAG_member)
    <ff4>   DW_AT_name        : (indirect string, offset: 0x8ed2c): hdmarx
    <ff8>   DW_AT_decl_file   : 14
    <ff9>   DW_AT_decl_line   : 171
    <ffa>   DW_AT_decl_column : 34
    <ffb>   DW_AT_type        : <0xe6a>
    <fff>   DW_AT_data_member_location: 56
 <2><1000>: Abbrev Number: 14 (DW_TAG_member)
    <1001>   DW_AT_name        : (indirect string, offset: 0x46229): Lock
    <1005>   DW_AT_decl_file   : 14
    <1006>   DW_AT_decl_line   : 173
    <1007>   DW_AT_decl_column : 33
    <1008>   DW_AT_type        : <0x86f>
    <100c>   DW_AT_data_member_location: 60
 <2><100d>: Abbrev Number: 14 (DW_TAG_member)
    <100e>   DW_AT_name        : (indirect string, offset: 0x8b7b3): gState
    <1012>   DW_AT_decl_file   : 14
    <1013>   DW_AT_decl_line   : 175
    <1014>   DW_AT_decl_column : 33
    <1015>   DW_AT_type        : <0xf4e>
    <1019>   DW_AT_data_member_location: 61
 <2><101a>: Abbrev Number: 14 (DW_TAG_member)
    <101b>   DW_AT_name        : (indirect string, offset: 0x8e358): RxState
    <101f>   DW_AT_decl_file   : 14
    <1020>   DW_AT_decl_line   : 179
    <1021>   DW_AT_decl_column : 33
    <1022>   DW_AT_type        : <0xf4e>
    <1026>   DW_AT_data_member_location: 62
 <2><1027>: Abbrev Number: 14 (DW_TAG_member)
    <1028>   DW_AT_name        : (indirect string, offset: 0x8edb8): ErrorCode
    <102c>   DW_AT_decl_file   : 14
    <102d>   DW_AT_decl_line   : 182
    <102e>   DW_AT_decl_column : 33
    <102f>   DW_AT_type        : <0x302>
    <1033>   DW_AT_data_member_location: 64
 <2><1034>: Abbrev Number: 0
 <1><1035>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1036>   DW_AT_byte_size   : 4
    <1037>   DW_AT_type        : <0x7e6>
 <1><103b>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <103c>   DW_AT_byte_size   : 4
    <103d>   DW_AT_type        : <0x2e0>
 <1><1041>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1042>   DW_AT_byte_size   : 4
    <1043>   DW_AT_type        : <0x2d4>
 <1><1047>: Abbrev Number: 6 (DW_TAG_typedef)
    <1048>   DW_AT_name        : (indirect string, offset: 0x8c73e): UART_HandleTypeDef
    <104c>   DW_AT_decl_file   : 14
    <104d>   DW_AT_decl_line   : 200
    <104e>   DW_AT_decl_column : 3
    <104f>   DW_AT_type        : <0xf64>
 <1><1053>: Abbrev Number: 5 (DW_TAG_base_type)
    <1054>   DW_AT_byte_size   : 1
    <1055>   DW_AT_encoding    : 8	(unsigned char)
    <1056>   DW_AT_name        : (indirect string, offset: 0x3a5d2): char
 <1><105a>: Abbrev Number: 8 (DW_TAG_const_type)
    <105b>   DW_AT_type        : <0x1053>
 <1><105f>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1060>   DW_AT_byte_size   : 4
    <1061>   DW_AT_type        : <0x105a>
 <1><1065>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1066>   DW_AT_name        : (indirect string, offset: 0x8d9dd): MyListItem
    <106a>   DW_AT_byte_size   : 12
    <106b>   DW_AT_decl_file   : 15
    <106c>   DW_AT_decl_line   : 14
    <106d>   DW_AT_decl_column : 16
    <106e>   DW_AT_sibling     : <0x109a>
 <2><1072>: Abbrev Number: 14 (DW_TAG_member)
    <1073>   DW_AT_name        : (indirect string, offset: 0x918d6): data
    <1077>   DW_AT_decl_file   : 15
    <1078>   DW_AT_decl_line   : 16
    <1079>   DW_AT_decl_column : 12
    <107a>   DW_AT_type        : <0x1041>
    <107e>   DW_AT_data_member_location: 0
 <2><107f>: Abbrev Number: 14 (DW_TAG_member)
    <1080>   DW_AT_name        : (indirect string, offset: 0x8c902): next
    <1084>   DW_AT_decl_file   : 15
    <1085>   DW_AT_decl_line   : 17
    <1086>   DW_AT_decl_column : 22
    <1087>   DW_AT_type        : <0x109a>
    <108b>   DW_AT_data_member_location: 4
 <2><108c>: Abbrev Number: 14 (DW_TAG_member)
    <108d>   DW_AT_name        : (indirect string, offset: 0x8eda1): prev
    <1091>   DW_AT_decl_file   : 15
    <1092>   DW_AT_decl_line   : 18
    <1093>   DW_AT_decl_column : 22
    <1094>   DW_AT_type        : <0x109a>
    <1098>   DW_AT_data_member_location: 8
 <2><1099>: Abbrev Number: 0
 <1><109a>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <109b>   DW_AT_byte_size   : 4
    <109c>   DW_AT_type        : <0x1065>
 <1><10a0>: Abbrev Number: 6 (DW_TAG_typedef)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x8bdc8): MyListItem_t
    <10a5>   DW_AT_decl_file   : 15
    <10a6>   DW_AT_decl_line   : 19
    <10a7>   DW_AT_decl_column : 3
    <10a8>   DW_AT_type        : <0x1065>
 <1><10ac>: Abbrev Number: 20 (DW_TAG_structure_type)
    <10ad>   DW_AT_name        : (indirect string, offset: 0x8e28b): MyList
    <10b1>   DW_AT_byte_size   : 12
    <10b2>   DW_AT_decl_file   : 15
    <10b3>   DW_AT_decl_line   : 21
    <10b4>   DW_AT_decl_column : 16
    <10b5>   DW_AT_sibling     : <0x10e1>
 <2><10b9>: Abbrev Number: 14 (DW_TAG_member)
    <10ba>   DW_AT_name        : (indirect string, offset: 0x8a9e2): first
    <10be>   DW_AT_decl_file   : 15
    <10bf>   DW_AT_decl_line   : 23
    <10c0>   DW_AT_decl_column : 17
    <10c1>   DW_AT_type        : <0x10e1>
    <10c5>   DW_AT_data_member_location: 0
 <2><10c6>: Abbrev Number: 14 (DW_TAG_member)
    <10c7>   DW_AT_name        : (indirect string, offset: 0x8ed97): data_size
    <10cb>   DW_AT_decl_file   : 15
    <10cc>   DW_AT_decl_line   : 24
    <10cd>   DW_AT_decl_column : 10
    <10ce>   DW_AT_type        : <0x80e>
    <10d2>   DW_AT_data_member_location: 4
 <2><10d3>: Abbrev Number: 14 (DW_TAG_member)
    <10d4>   DW_AT_name        : (indirect string, offset: 0x8ed9c): size
    <10d8>   DW_AT_decl_file   : 15
    <10d9>   DW_AT_decl_line   : 25
    <10da>   DW_AT_decl_column : 10
    <10db>   DW_AT_type        : <0x80e>
    <10df>   DW_AT_data_member_location: 8
 <2><10e0>: Abbrev Number: 0
 <1><10e1>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <10e2>   DW_AT_byte_size   : 4
    <10e3>   DW_AT_type        : <0x10a0>
 <1><10e7>: Abbrev Number: 6 (DW_TAG_typedef)
    <10e8>   DW_AT_name        : (indirect string, offset: 0x8ed15): MyList_t
    <10ec>   DW_AT_decl_file   : 15
    <10ed>   DW_AT_decl_line   : 26
    <10ee>   DW_AT_decl_column : 3
    <10ef>   DW_AT_type        : <0x10ac>
 <1><10f3>: Abbrev Number: 6 (DW_TAG_typedef)
    <10f4>   DW_AT_name        : (indirect string, offset: 0x8c3b5): callback_ptr
    <10f8>   DW_AT_decl_file   : 16
    <10f9>   DW_AT_decl_line   : 17
    <10fa>   DW_AT_decl_column : 3
    <10fb>   DW_AT_type        : <0x10ff>
 <1><10ff>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1100>   DW_AT_byte_size   : 4
    <1101>   DW_AT_type        : <0x1105>
 <1><1105>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <1106>   DW_AT_prototyped  : 1
    <1106>   DW_AT_sibling     : <0x1115>
 <2><110a>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <110b>   DW_AT_type        : <0xbe5>
 <2><110f>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <1110>   DW_AT_type        : <0x2e5>
 <2><1114>: Abbrev Number: 0
 <1><1115>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <1116>   DW_AT_encoding    : 7	(unsigned)
    <1117>   DW_AT_byte_size   : 1
    <1118>   DW_AT_type        : <0x27d>
    <111c>   DW_AT_decl_file   : 16
    <111d>   DW_AT_decl_line   : 20
    <111e>   DW_AT_decl_column : 1
    <111f>   DW_AT_sibling     : <0x1178>
 <2><1123>: Abbrev Number: 19 (DW_TAG_enumerator)
    <1124>   DW_AT_name        : CH1
    <1128>   DW_AT_const_value : 0
 <2><1129>: Abbrev Number: 19 (DW_TAG_enumerator)
    <112a>   DW_AT_name        : CH2
    <112e>   DW_AT_const_value : 1
 <2><112f>: Abbrev Number: 19 (DW_TAG_enumerator)
    <1130>   DW_AT_name        : CH3
    <1134>   DW_AT_const_value : 2
 <2><1135>: Abbrev Number: 19 (DW_TAG_enumerator)
    <1136>   DW_AT_name        : CH4
    <113a>   DW_AT_const_value : 3
 <2><113b>: Abbrev Number: 19 (DW_TAG_enumerator)
    <113c>   DW_AT_name        : CH5
    <1140>   DW_AT_const_value : 4
 <2><1141>: Abbrev Number: 19 (DW_TAG_enumerator)
    <1142>   DW_AT_name        : CH6
    <1146>   DW_AT_const_value : 5
 <2><1147>: Abbrev Number: 19 (DW_TAG_enumerator)
    <1148>   DW_AT_name        : CH7
    <114c>   DW_AT_const_value : 6
 <2><114d>: Abbrev Number: 19 (DW_TAG_enumerator)
    <114e>   DW_AT_name        : CH8
    <1152>   DW_AT_const_value : 7
 <2><1153>: Abbrev Number: 19 (DW_TAG_enumerator)
    <1154>   DW_AT_name        : CH9
    <1158>   DW_AT_const_value : 8
 <2><1159>: Abbrev Number: 4 (DW_TAG_enumerator)
    <115a>   DW_AT_name        : (indirect string, offset: 0x8dcec): CH10
    <115e>   DW_AT_const_value : 9
 <2><115f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1160>   DW_AT_name        : (indirect string, offset: 0x8dcf1): CH11
    <1164>   DW_AT_const_value : 10
 <2><1165>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1166>   DW_AT_name        : (indirect string, offset: 0x8dcf6): CH12
    <116a>   DW_AT_const_value : 11
 <2><116b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <116c>   DW_AT_name        : (indirect string, offset: 0x8dcfb): CH13
    <1170>   DW_AT_const_value : 12
 <2><1171>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1172>   DW_AT_name        : (indirect string, offset: 0x8dd00): CH14
    <1176>   DW_AT_const_value : 13
 <2><1177>: Abbrev Number: 0
 <1><1178>: Abbrev Number: 6 (DW_TAG_typedef)
    <1179>   DW_AT_name        : (indirect string, offset: 0x8e2f0): IBUS_Channel
    <117d>   DW_AT_decl_file   : 16
    <117e>   DW_AT_decl_line   : 22
    <117f>   DW_AT_decl_column : 3
    <1180>   DW_AT_type        : <0x1115>
 <1><1184>: Abbrev Number: 12 (DW_TAG_structure_type)
    <1185>   DW_AT_byte_size   : 8
    <1186>   DW_AT_decl_file   : 16
    <1187>   DW_AT_decl_line   : 24
    <1188>   DW_AT_decl_column : 9
    <1189>   DW_AT_sibling     : <0x11a8>
 <2><118d>: Abbrev Number: 14 (DW_TAG_member)
    <118e>   DW_AT_name        : (indirect string, offset: 0x91555): channel
    <1192>   DW_AT_decl_file   : 16
    <1193>   DW_AT_decl_line   : 26
    <1194>   DW_AT_decl_column : 16
    <1195>   DW_AT_type        : <0x1178>
    <1199>   DW_AT_data_member_location: 0
 <2><119a>: Abbrev Number: 14 (DW_TAG_member)
    <119b>   DW_AT_name        : (indirect string, offset: 0x8dca8): callback
    <119f>   DW_AT_decl_file   : 16
    <11a0>   DW_AT_decl_line   : 27
    <11a1>   DW_AT_decl_column : 16
    <11a2>   DW_AT_type        : <0x10f3>
    <11a6>   DW_AT_data_member_location: 4
 <2><11a7>: Abbrev Number: 0
 <1><11a8>: Abbrev Number: 6 (DW_TAG_typedef)
    <11a9>   DW_AT_name        : (indirect string, offset: 0x8d7ea): IBusCommand_t
    <11ad>   DW_AT_decl_file   : 16
    <11ae>   DW_AT_decl_line   : 28
    <11af>   DW_AT_decl_column : 3
    <11b0>   DW_AT_type        : <0x1184>
 <1><11b4>: Abbrev Number: 12 (DW_TAG_structure_type)
    <11b5>   DW_AT_byte_size   : 64
    <11b6>   DW_AT_decl_file   : 16
    <11b7>   DW_AT_decl_line   : 30
    <11b8>   DW_AT_decl_column : 9
    <11b9>   DW_AT_sibling     : <0x120c>
 <2><11bd>: Abbrev Number: 14 (DW_TAG_member)
    <11be>   DW_AT_name        : (indirect string, offset: 0x8d60d): rx_list
    <11c2>   DW_AT_decl_file   : 16
    <11c3>   DW_AT_decl_line   : 32
    <11c4>   DW_AT_decl_column : 13
    <11c5>   DW_AT_type        : <0x120c>
    <11c9>   DW_AT_data_member_location: 0
 <2><11ca>: Abbrev Number: 14 (DW_TAG_member)
    <11cb>   DW_AT_name        : (indirect string, offset: 0x8d537): huart
    <11cf>   DW_AT_decl_file   : 16
    <11d0>   DW_AT_decl_line   : 33
    <11d1>   DW_AT_decl_column : 23
    <11d2>   DW_AT_type        : <0x1212>
    <11d6>   DW_AT_data_member_location: 4
 <2><11d7>: Abbrev Number: 14 (DW_TAG_member)
    <11d8>   DW_AT_name        : (indirect string, offset: 0x8b1c0): buffer
    <11dc>   DW_AT_decl_file   : 16
    <11dd>   DW_AT_decl_line   : 34
    <11de>   DW_AT_decl_column : 11
    <11df>   DW_AT_type        : <0x1218>
    <11e3>   DW_AT_data_member_location: 8
 <2><11e4>: Abbrev Number: 14 (DW_TAG_member)
    <11e5>   DW_AT_name        : (indirect string, offset: 0x8bdd5): callbacks
    <11e9>   DW_AT_decl_file   : 16
    <11ea>   DW_AT_decl_line   : 35
    <11eb>   DW_AT_decl_column : 18
    <11ec>   DW_AT_type        : <0x1228>
    <11f0>   DW_AT_data_member_location: 44
 <2><11f1>: Abbrev Number: 14 (DW_TAG_member)
    <11f2>   DW_AT_name        : (indirect string, offset: 0x8aff8): callback_count
    <11f6>   DW_AT_decl_file   : 16
    <11f7>   DW_AT_decl_line   : 36
    <11f8>   DW_AT_decl_column : 10
    <11f9>   DW_AT_type        : <0x80e>
    <11fd>   DW_AT_data_member_location: 48
 <2><11fe>: Abbrev Number: 14 (DW_TAG_member)
    <11ff>   DW_AT_name        : (indirect string, offset: 0x8b687): tdata
    <1203>   DW_AT_decl_file   : 16
    <1204>   DW_AT_decl_line   : 37
    <1205>   DW_AT_decl_column : 11
    <1206>   DW_AT_type        : <0x122e>
    <120a>   DW_AT_data_member_location: 52
 <2><120b>: Abbrev Number: 0
 <1><120c>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <120d>   DW_AT_byte_size   : 4
    <120e>   DW_AT_type        : <0x10e7>
 <1><1212>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1213>   DW_AT_byte_size   : 4
    <1214>   DW_AT_type        : <0x1047>
 <1><1218>: Abbrev Number: 10 (DW_TAG_array_type)
    <1219>   DW_AT_type        : <0x2d4>
    <121d>   DW_AT_sibling     : <0x1228>
 <2><1221>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1222>   DW_AT_type        : <0x2cd>
    <1226>   DW_AT_upper_bound : 32
 <2><1227>: Abbrev Number: 0
 <1><1228>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1229>   DW_AT_byte_size   : 4
    <122a>   DW_AT_type        : <0x11a8>
 <1><122e>: Abbrev Number: 10 (DW_TAG_array_type)
    <122f>   DW_AT_type        : <0x2d4>
    <1233>   DW_AT_sibling     : <0x123e>
 <2><1237>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1238>   DW_AT_type        : <0x2cd>
    <123c>   DW_AT_upper_bound : 8
 <2><123d>: Abbrev Number: 0
 <1><123e>: Abbrev Number: 6 (DW_TAG_typedef)
    <123f>   DW_AT_name        : (indirect string, offset: 0x8b680): IBus_t
    <1243>   DW_AT_decl_file   : 16
    <1244>   DW_AT_decl_line   : 38
    <1245>   DW_AT_decl_column : 3
    <1246>   DW_AT_type        : <0x11b4>
 <1><124a>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <124b>   DW_AT_byte_size   : 4
    <124c>   DW_AT_type        : <0x1250>
 <1><1250>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <1251>   DW_AT_prototyped  : 1
    <1251>   DW_AT_sibling     : <0x125b>
 <2><1255>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <1256>   DW_AT_type        : <0xbe5>
 <2><125a>: Abbrev Number: 0
 <1><125b>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <125c>   DW_AT_encoding    : 5	(signed)
    <125d>   DW_AT_byte_size   : 4
    <125e>   DW_AT_type        : <0x2c6>
    <1262>   DW_AT_decl_file   : 17
    <1263>   DW_AT_decl_line   : 82
    <1264>   DW_AT_decl_column : 14
    <1265>   DW_AT_sibling     : <0x13ab>
 <2><1269>: Abbrev Number: 4 (DW_TAG_enumerator)
    <126a>   DW_AT_name        : (indirect string, offset: 0x89d94): osPriorityNone
    <126e>   DW_AT_const_value : 0
 <2><126f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1270>   DW_AT_name        : (indirect string, offset: 0x8e05f): osPriorityIdle
    <1274>   DW_AT_const_value : 1
 <2><1275>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1276>   DW_AT_name        : (indirect string, offset: 0x8e95d): osPriorityLow
    <127a>   DW_AT_const_value : 8
 <2><127b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <127c>   DW_AT_name        : (indirect string, offset: 0x8ebe4): osPriorityLow1
    <1280>   DW_AT_const_value : 9
 <2><1281>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1282>   DW_AT_name        : (indirect string, offset: 0x8ebf3): osPriorityLow2
    <1286>   DW_AT_const_value : 10
 <2><1287>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1288>   DW_AT_name        : (indirect string, offset: 0x8b511): osPriorityLow3
    <128c>   DW_AT_const_value : 11
 <2><128d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <128e>   DW_AT_name        : (indirect string, offset: 0x8ec02): osPriorityLow4
    <1292>   DW_AT_const_value : 12
 <2><1293>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1294>   DW_AT_name        : (indirect string, offset: 0x8b520): osPriorityLow5
    <1298>   DW_AT_const_value : 13
 <2><1299>: Abbrev Number: 4 (DW_TAG_enumerator)
    <129a>   DW_AT_name        : (indirect string, offset: 0x8ec11): osPriorityLow6
    <129e>   DW_AT_const_value : 14
 <2><129f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12a0>   DW_AT_name        : (indirect string, offset: 0x8da79): osPriorityLow7
    <12a4>   DW_AT_const_value : 15
 <2><12a5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12a6>   DW_AT_name        : (indirect string, offset: 0x8ecff): osPriorityBelowNormal
    <12aa>   DW_AT_const_value : 16
 <2><12ab>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12ac>   DW_AT_name        : (indirect string, offset: 0x8d7f8): osPriorityBelowNormal1
    <12b0>   DW_AT_const_value : 17
 <2><12b1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12b2>   DW_AT_name        : (indirect string, offset: 0x8ddb2): osPriorityBelowNormal2
    <12b6>   DW_AT_const_value : 18
 <2><12b7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12b8>   DW_AT_name        : (indirect string, offset: 0x8d80f): osPriorityBelowNormal3
    <12bc>   DW_AT_const_value : 19
 <2><12bd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12be>   DW_AT_name        : (indirect string, offset: 0x8ddc9): osPriorityBelowNormal4
    <12c2>   DW_AT_const_value : 20
 <2><12c3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12c4>   DW_AT_name        : (indirect string, offset: 0x8dde0): osPriorityBelowNormal5
    <12c8>   DW_AT_const_value : 21
 <2><12c9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <12ca>   DW_AT_name        : (indirect string, offset: 0x8ddf7): osPriorityBelowNormal6
    <12ce>   DW_AT_const_value : 22
 <2><12cf>: Abbrev Number: 4 (DW_TAG_enumerator)
