Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xa2 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x689f2): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x25997): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x31267): C:/Users/Kamil/Documents/ST_Projects/NITI_TestTask/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x4a112): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x367c1): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8

    <244>   DW_AT_const_value : 71
 <2><245>: Abbrev Number: 4 (DW_TAG_enumerator)
    <246>   DW_AT_name        : (indirect string, offset: 0x8e272): I2C3_EV_IRQn
    <24a>   DW_AT_const_value : 72
 <2><24b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <24c>   DW_AT_name        : (indirect string, offset: 0x8a63c): I2C3_ER_IRQn
    <250>   DW_AT_const_value : 73
 <2><251>: Abbrev Number: 4 (DW_TAG_enumerator)
    <252>   DW_AT_name        : (indirect string, offset: 0x89dc5): FPU_IRQn
    <256>   DW_AT_const_value : 81
 <2><257>: Abbrev Number: 4 (DW_TAG_enumerator)
    <258>   DW_AT_name        : (indirect string, offset: 0x8b9d3): SPI4_IRQn
    <25c>   DW_AT_const_value : 84
 <2><25d>: Abbrev Number: 0
 <1><25e>: Abbrev Number: 5 (DW_TAG_base_type)
    <25f>   DW_AT_byte_size   : 1
    <260>   DW_AT_encoding    : 6	(signed char)
    <261>   DW_AT_name        : (indirect string, offset: 0x671a5): signed char
 <1><265>: Abbrev Number: 6 (DW_TAG_typedef)
    <266>   DW_AT_name        : (indirect string, offset: 0x8e0a7): IRQn_Type
    <26a>   DW_AT_decl_file   : 3
    <26b>   DW_AT_decl_line   : 133
    <26c>   DW_AT_decl_column : 3
    <26d>   DW_AT_type        : <0xcf>
 <1><271>: Abbrev Number: 6 (DW_TAG_typedef)
    <272>   DW_AT_name        : (indirect string, offset: 0x8b0f1): __uint8_t
    <276>   DW_AT_decl_file   : 4
    <277>   DW_AT_decl_line   : 43
    <278>   DW_AT_decl_column : 24
    <279>   DW_AT_type        : <0x27d>
 <1><27d>: Abbrev Number: 5 (DW_TAG_base_type)
    <27e>   DW_AT_byte_size   : 1
    <27f>   DW_AT_encoding    : 8	(unsigned char)
    <280>   DW_AT_name        : (indirect string, offset: 0x630da): unsigned char
 <1><284>: Abbrev Number: 5 (DW_TAG_base_type)
    <285>   DW_AT_byte_size   : 2
    <286>   DW_AT_encoding    : 5	(signed)
    <287>   DW_AT_name        : (indirect string, offset: 0x5288): short int
 <1><28b>: Abbrev Number: 6 (DW_TAG_typedef)
    <28c>   DW_AT_name        : (indirect string, offset: 0x8dbf7): __uint16_t
    <290>   DW_AT_decl_file   : 4
    <291>   DW_AT_decl_line   : 57
    <292>   DW_AT_decl_column : 25
    <293>   DW_AT_type        : <0x297>
 <1><297>: Abbrev Number: 5 (DW_TAG_base_type)
    <298>   DW_AT_byte_size   : 2
    <299>   DW_AT_encoding    : 7	(unsigned)
    <29a>   DW_AT_name        : (indirect string, offset: 0x44a3d): short unsigned int
 <1><29e>: Abbrev Number: 5 (DW_TAG_base_type)
    <29f>   DW_AT_byte_size   : 4
    <2a0>   DW_AT_encoding    : 5	(signed)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x1b255): long int
 <1><2a5>: Abbrev Number: 6 (DW_TAG_typedef)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x8ce97): __uint32_t
    <2aa>   DW_AT_decl_file   : 4
    <2ab>   DW_AT_decl_line   : 79
    <2ac>   DW_AT_decl_column : 25
    <2ad>   DW_AT_type        : <0x2b1>
 <1><2b1>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b2>   DW_AT_byte_size   : 4
    <2b3>   DW_AT_encoding    : 7	(unsigned)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x50c3f): long unsigned int
 <1><2b8>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b9>   DW_AT_byte_size   : 8
    <2ba>   DW_AT_encoding    : 5	(signed)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x367c1): long long int
 <1><2bf>: Abbrev Number: 5 (DW_TAG_base_type)
    <2c0>   DW_AT_byte_size   : 8
    <2c1>   DW_AT_encoding    : 7	(unsigned)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x2e8a1): long long unsigned int
 <1><2c6>: Abbrev Number: 7 (DW_TAG_base_type)
    <2c7>   DW_AT_byte_size   : 4
    <2c8>   DW_AT_encoding    : 5	(signed)
    <2c9>   DW_AT_name        : int
 <1><2cd>: Abbrev Number: 5 (DW_TAG_base_type)
    <2ce>   DW_AT_byte_size   : 4
    <2cf>   DW_AT_encoding    : 7	(unsigned)
    <2d0>   DW_AT_name        : (indirect string, offset: 0x4a112): unsigned int
 <1><2d4>: Abbrev Number: 6 (DW_TAG_typedef)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x8b0f3): uint8_t
    <2d9>   DW_AT_decl_file   : 5
    <2da>   DW_AT_decl_line   : 24
    <2db>   DW_AT_decl_column : 19
    <2dc>   DW_AT_type        : <0x271>
 <1><2e0>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <2e1>   DW_AT_type        : <0x2d4>
 <1><2e5>: Abbrev Number: 9 (DW_TAG_const_type)
    <2e6>   DW_AT_type        : <0x2d4>
 <1><2ea>: Abbrev Number: 6 (DW_TAG_typedef)
    <2eb>   DW_AT_name        : (indirect string, offset: 0x4ee99): uint16_t
    <2ef>   DW_AT_decl_file   : 5
    <2f0>   DW_AT_decl_line   : 36
    <2f1>   DW_AT_decl_column : 20
    <2f2>   DW_AT_type        : <0x28b>
 <1><2f6>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <2f7>   DW_AT_type        : <0x2ea>
 <1><2fb>: Abbrev Number: 6 (DW_TAG_typedef)
    <2fc>   DW_AT_name        : (indirect string, offset: 0x353ba): uint32_t
    <300>   DW_AT_decl_file   : 5
    <301>   DW_AT_decl_line   : 48
    <302>   DW_AT_decl_column : 20
    <303>   DW_AT_type        : <0x2a5>
 <1><307>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <308>   DW_AT_type        : <0x2fb>
 <1><30c>: Abbrev Number: 10 (DW_TAG_array_type)
    <30d>   DW_AT_type        : <0x2fb>
    <311>   DW_AT_sibling     : <0x31c>
 <2><315>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <316>   DW_AT_type        : <0x2cd>
    <31a>   DW_AT_upper_bound : 0
 <2><31b>: Abbrev Number: 0
 <1><31c>: Abbrev Number: 10 (DW_TAG_array_type)
    <31d>   DW_AT_type        : <0x2fb>
    <321>   DW_AT_sibling     : <0x32c>
 <2><325>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <326>   DW_AT_type        : <0x2cd>
    <32a>   DW_AT_upper_bound : 1
 <2><32b>: Abbrev Number: 0
 <1><32c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <32d>   DW_AT_byte_size   : 24
    <32e>   DW_AT_decl_file   : 3
    <32f>   DW_AT_decl_line   : 213
    <330>   DW_AT_decl_column : 9
    <331>   DW_AT_sibling     : <0x383>
 <2><335>: Abbrev Number: 13 (DW_TAG_member)
    <336>   DW_AT_name        : CR
    <339>   DW_AT_decl_file   : 3
    <33a>   DW_AT_decl_line   : 215
    <33b>   DW_AT_decl_column : 17
    <33c>   DW_AT_type        : <0x307>
    <340>   DW_AT_data_member_location: 0
 <2><341>: Abbrev Number: 14 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x8be34): NDTR
    <346>   DW_AT_decl_file   : 3
    <347>   DW_AT_decl_line   : 216
    <348>   DW_AT_decl_column : 17
    <349>   DW_AT_type        : <0x307>
    <34d>   DW_AT_data_member_location: 4
 <2><34e>: Abbrev Number: 13 (DW_TAG_member)
    <34f>   DW_AT_name        : PAR
    <353>   DW_AT_decl_file   : 3
    <354>   DW_AT_decl_line   : 217
    <355>   DW_AT_decl_column : 17
    <356>   DW_AT_type        : <0x307>
    <35a>   DW_AT_data_member_location: 8
 <2><35b>: Abbrev Number: 14 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0x8b84c): M0AR
    <360>   DW_AT_decl_file   : 3
    <361>   DW_AT_decl_line   : 218
    <362>   DW_AT_decl_column : 17
    <363>   DW_AT_type        : <0x307>
    <367>   DW_AT_data_member_location: 12
 <2><368>: Abbrev Number: 14 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x89f1a): M1AR
    <36d>   DW_AT_decl_file   : 3
    <36e>   DW_AT_decl_line   : 219
    <36f>   DW_AT_decl_column : 17
    <370>   DW_AT_type        : <0x307>
    <374>   DW_AT_data_member_location: 16
 <2><375>: Abbrev Number: 13 (DW_TAG_member)
    <376>   DW_AT_name        : FCR
    <37a>   DW_AT_decl_file   : 3
    <37b>   DW_AT_decl_line   : 220
    <37c>   DW_AT_decl_column : 17
    <37d>   DW_AT_type        : <0x307>
    <381>   DW_AT_data_member_location: 20
 <2><382>: Abbrev Number: 0
 <1><383>: Abbrev Number: 6 (DW_TAG_typedef)
    <384>   DW_AT_name        : (indirect string, offset: 0x8e782): DMA_Stream_TypeDef
    <388>   DW_AT_decl_file   : 3
    <389>   DW_AT_decl_line   : 221
    <38a>   DW_AT_decl_column : 3
    <38b>   DW_AT_type        : <0x32c>
 <1><38f>: Abbrev Number: 15 (DW_TAG_structure_type)
    <390>   DW_AT_byte_size   : 40
    <391>   DW_AT_decl_file   : 3
    <392>   DW_AT_decl_line   : 264
    <394>   DW_AT_decl_column : 9
    <395>   DW_AT_sibling     : <0x418>
 <2><399>: Abbrev Number: 16 (DW_TAG_member)
    <39a>   DW_AT_name        : (indirect string, offset: 0x898a9): MODER
    <39e>   DW_AT_decl_file   : 3
    <39f>   DW_AT_decl_line   : 266
    <3a1>   DW_AT_decl_column : 17
    <3a2>   DW_AT_type        : <0x307>
    <3a6>   DW_AT_data_member_location: 0
 <2><3a7>: Abbrev Number: 16 (DW_TAG_member)
    <3a8>   DW_AT_name        : (indirect string, offset: 0x8d8bb): OTYPER
    <3ac>   DW_AT_decl_file   : 3
    <3ad>   DW_AT_decl_line   : 267
    <3af>   DW_AT_decl_column : 17
    <3b0>   DW_AT_type        : <0x307>
    <3b4>   DW_AT_data_member_location: 4
 <2><3b5>: Abbrev Number: 16 (DW_TAG_member)
    <3b6>   DW_AT_name        : (indirect string, offset: 0x8e080): OSPEEDR
    <3ba>   DW_AT_decl_file   : 3
    <3bb>   DW_AT_decl_line   : 268
    <3bd>   DW_AT_decl_column : 17
    <3be>   DW_AT_type        : <0x307>
    <3c2>   DW_AT_data_member_location: 8
 <2><3c3>: Abbrev Number: 16 (DW_TAG_member)
    <3c4>   DW_AT_name        : (indirect string, offset: 0x8a72c): PUPDR
    <3c8>   DW_AT_decl_file   : 3
    <3c9>   DW_AT_decl_line   : 269
    <3cb>   DW_AT_decl_column : 17
    <3cc>   DW_AT_type        : <0x307>
    <3d0>   DW_AT_data_member_location: 12
 <2><3d1>: Abbrev Number: 17 (DW_TAG_member)
    <3d2>   DW_AT_name        : IDR
    <3d6>   DW_AT_decl_file   : 3
    <3d7>   DW_AT_decl_line   : 270
    <3d9>   DW_AT_decl_column : 17
    <3da>   DW_AT_type        : <0x307>
    <3de>   DW_AT_data_member_location: 16
 <2><3df>: Abbrev Number: 17 (DW_TAG_member)
    <3e0>   DW_AT_name        : ODR
    <3e4>   DW_AT_decl_file   : 3
    <3e5>   DW_AT_decl_line   : 271
    <3e7>   DW_AT_decl_column : 17
    <3e8>   DW_AT_type        : <0x307>
    <3ec>   DW_AT_data_member_location: 20
 <2><3ed>: Abbrev Number: 16 (DW_TAG_member)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x8ac82): BSRR
    <3f2>   DW_AT_decl_file   : 3
    <3f3>   DW_AT_decl_line   : 272
    <3f5>   DW_AT_decl_column : 17
    <3f6>   DW_AT_type        : <0x307>
    <3fa>   DW_AT_data_member_location: 24
 <2><3fb>: Abbrev Number: 16 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0x8df40): LCKR
    <400>   DW_AT_decl_file   : 3
    <401>   DW_AT_decl_line   : 273
    <403>   DW_AT_decl_column : 17
    <404>   DW_AT_type        : <0x307>
    <408>   DW_AT_data_member_location: 28
 <2><409>: Abbrev Number: 17 (DW_TAG_member)
    <40a>   DW_AT_name        : AFR
    <40e>   DW_AT_decl_file   : 3
    <40f>   DW_AT_decl_line   : 274
    <411>   DW_AT_decl_column : 17
    <412>   DW_AT_type        : <0x428>
    <416>   DW_AT_data_member_location: 32
 <2><417>: Abbrev Number: 0
 <1><418>: Abbrev Number: 10 (DW_TAG_array_type)
    <419>   DW_AT_type        : <0x307>
    <41d>   DW_AT_sibling     : <0x428>
 <2><421>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <422>   DW_AT_type        : <0x2cd>
    <426>   DW_AT_upper_bound : 1
 <2><427>: Abbrev Number: 0
 <1><428>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <429>   DW_AT_type        : <0x418>
 <1><42d>: Abbrev Number: 18 (DW_TAG_typedef)
    <42e>   DW_AT_name        : (indirect string, offset: 0x8ed69): GPIO_TypeDef
    <432>   DW_AT_decl_file   : 3
    <433>   DW_AT_decl_line   : 275
    <435>   DW_AT_decl_column : 3
    <436>   DW_AT_type        : <0x38f>
 <1><43a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <43b>   DW_AT_byte_size   : 8
    <43c>   DW_AT_decl_file   : 3
    <43d>   DW_AT_decl_line   : 325
    <43f>   DW_AT_decl_column : 9
    <440>   DW_AT_sibling     : <0x460>
 <2><444>: Abbrev Number: 17 (DW_TAG_member)
    <445>   DW_AT_name        : CR
    <448>   DW_AT_decl_file   : 3
    <449>   DW_AT_decl_line   : 327
    <44b>   DW_AT_decl_column : 17
    <44c>   DW_AT_type        : <0x307>
    <450>   DW_AT_data_member_location: 0
 <2><451>: Abbrev Number: 17 (DW_TAG_member)
    <452>   DW_AT_name        : CSR
    <456>   DW_AT_decl_file   : 3
    <457>   DW_AT_decl_line   : 328
    <459>   DW_AT_decl_column : 17
    <45a>   DW_AT_type        : <0x307>
    <45e>   DW_AT_data_member_location: 4
 <2><45f>: Abbrev Number: 0
 <1><460>: Abbrev Number: 18 (DW_TAG_typedef)
    <461>   DW_AT_name        : (indirect string, offset: 0x8d60c): PWR_TypeDef
    <465>   DW_AT_decl_file   : 3
    <466>   DW_AT_decl_line   : 329
    <468>   DW_AT_decl_column : 3
    <469>   DW_AT_type        : <0x43a>
 <1><46d>: Abbrev Number: 15 (DW_TAG_structure_type)
    <46e>   DW_AT_byte_size   : 144
    <46f>   DW_AT_decl_file   : 3
    <470>   DW_AT_decl_line   : 335
    <472>   DW_AT_decl_column : 9
    <473>   DW_AT_sibling     : <0x637>
 <2><477>: Abbrev Number: 17 (DW_TAG_member)
    <478>   DW_AT_name        : CR
    <47b>   DW_AT_decl_file   : 3
    <47c>   DW_AT_decl_line   : 337
    <47e>   DW_AT_decl_column : 17
    <47f>   DW_AT_type        : <0x307>
    <483>   DW_AT_data_member_location: 0
 <2><484>: Abbrev Number: 16 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0x8d50d): PLLCFGR
    <489>   DW_AT_decl_file   : 3
    <48a>   DW_AT_decl_line   : 338
    <48c>   DW_AT_decl_column : 17
    <48d>   DW_AT_type        : <0x307>
    <491>   DW_AT_data_member_location: 4
 <2><492>: Abbrev Number: 16 (DW_TAG_member)
    <493>   DW_AT_name        : (indirect string, offset: 0x8bab5): CFGR
    <497>   DW_AT_decl_file   : 3
    <498>   DW_AT_decl_line   : 339
    <49a>   DW_AT_decl_column : 17
    <49b>   DW_AT_type        : <0x307>
    <49f>   DW_AT_data_member_location: 8
 <2><4a0>: Abbrev Number: 17 (DW_TAG_member)
    <4a1>   DW_AT_name        : CIR
    <4a5>   DW_AT_decl_file   : 3
    <4a6>   DW_AT_decl_line   : 340
    <4a8>   DW_AT_decl_column : 17
    <4a9>   DW_AT_type        : <0x307>
    <4ad>   DW_AT_data_member_location: 12
 <2><4ae>: Abbrev Number: 16 (DW_TAG_member)
    <4af>   DW_AT_name        : (indirect string, offset: 0x8da9d): AHB1RSTR
    <4b3>   DW_AT_decl_file   : 3
    <4b4>   DW_AT_decl_line   : 341
    <4b6>   DW_AT_decl_column : 17
    <4b7>   DW_AT_type        : <0x307>
    <4bb>   DW_AT_data_member_location: 16
 <2><4bc>: Abbrev Number: 16 (DW_TAG_member)
    <4bd>   DW_AT_name        : (indirect string, offset: 0x8a10b): AHB2RSTR
    <4c1>   DW_AT_decl_file   : 3
    <4c2>   DW_AT_decl_line   : 342
    <4c4>   DW_AT_decl_column : 17
    <4c5>   DW_AT_type        : <0x307>
    <4c9>   DW_AT_data_member_location: 20
 <2><4ca>: Abbrev Number: 16 (DW_TAG_member)
    <4cb>   DW_AT_name        : (indirect string, offset: 0x8baa9): AHB3RSTR
    <4cf>   DW_AT_decl_file   : 3
    <4d0>   DW_AT_decl_line   : 343
    <4d2>   DW_AT_decl_column : 17
    <4d3>   DW_AT_type        : <0x307>
    <4d7>   DW_AT_data_member_location: 24
 <2><4d8>: Abbrev Number: 16 (DW_TAG_member)
    <4d9>   DW_AT_name        : (indirect string, offset: 0x8eb7a): RESERVED0
    <4dd>   DW_AT_decl_file   : 3
    <4de>   DW_AT_decl_line   : 344
    <4e0>   DW_AT_decl_column : 17
    <4e1>   DW_AT_type        : <0x2fb>
    <4e5>   DW_AT_data_member_location: 28
 <2><4e6>: Abbrev Number: 16 (DW_TAG_member)
    <4e7>   DW_AT_name        : (indirect string, offset: 0x8a0ca): APB1RSTR
    <4eb>   DW_AT_decl_file   : 3
    <4ec>   DW_AT_decl_line   : 345
    <4ee>   DW_AT_decl_column : 17
    <4ef>   DW_AT_type        : <0x307>
    <4f3>   DW_AT_data_member_location: 32
 <2><4f4>: Abbrev Number: 16 (DW_TAG_member)
    <4f5>   DW_AT_name        : (indirect string, offset: 0x8baa0): APB2RSTR
    <4f9>   DW_AT_decl_file   : 3
    <4fa>   DW_AT_decl_line   : 346
    <4fc>   DW_AT_decl_column : 17
    <4fd>   DW_AT_type        : <0x307>
    <501>   DW_AT_data_member_location: 36
 <2><502>: Abbrev Number: 16 (DW_TAG_member)
    <503>   DW_AT_name        : (indirect string, offset: 0x8eb84): RESERVED1
    <507>   DW_AT_decl_file   : 3
    <508>   DW_AT_decl_line   : 347
    <50a>   DW_AT_decl_column : 17
    <50b>   DW_AT_type        : <0x31c>
    <50f>   DW_AT_data_member_location: 40
 <2><510>: Abbrev Number: 16 (DW_TAG_member)
    <511>   DW_AT_name        : (indirect string, offset: 0x89dce): AHB1ENR
    <515>   DW_AT_decl_file   : 3
    <516>   DW_AT_decl_line   : 348
    <518>   DW_AT_decl_column : 17
    <519>   DW_AT_type        : <0x307>
    <51d>   DW_AT_data_member_location: 48
 <2><51e>: Abbrev Number: 16 (DW_TAG_member)
    <51f>   DW_AT_name        : (indirect string, offset: 0x8af41): AHB2ENR
    <523>   DW_AT_decl_file   : 3
    <524>   DW_AT_decl_line   : 349
    <526>   DW_AT_decl_column : 17
    <527>   DW_AT_type        : <0x307>
    <52b>   DW_AT_data_member_location: 52
 <2><52c>: Abbrev Number: 16 (DW_TAG_member)
    <52d>   DW_AT_name        : (indirect string, offset: 0x8bbe3): AHB3ENR
    <531>   DW_AT_decl_file   : 3
    <532>   DW_AT_decl_line   : 350
    <534>   DW_AT_decl_column : 17
    <535>   DW_AT_type        : <0x307>
    <539>   DW_AT_data_member_location: 56
 <2><53a>: Abbrev Number: 16 (DW_TAG_member)
    <53b>   DW_AT_name        : (indirect string, offset: 0x8eb8e): RESERVED2
    <53f>   DW_AT_decl_file   : 3
    <540>   DW_AT_decl_line   : 351
    <542>   DW_AT_decl_column : 17
    <543>   DW_AT_type        : <0x2fb>
    <547>   DW_AT_data_member_location: 60
 <2><548>: Abbrev Number: 16 (DW_TAG_member)
    <549>   DW_AT_name        : (indirect string, offset: 0x8d75c): APB1ENR
    <54d>   DW_AT_decl_file   : 3
    <54e>   DW_AT_decl_line   : 352
    <550>   DW_AT_decl_column : 17
    <551>   DW_AT_type        : <0x307>
    <555>   DW_AT_data_member_location: 64
 <2><556>: Abbrev Number: 16 (DW_TAG_member)
    <557>   DW_AT_name        : (indirect string, offset: 0x8a1b6): APB2ENR
    <55b>   DW_AT_decl_file   : 3
    <55c>   DW_AT_decl_line   : 353
    <55e>   DW_AT_decl_column : 17
    <55f>   DW_AT_type        : <0x307>
    <563>   DW_AT_data_member_location: 68
 <2><564>: Abbrev Number: 16 (DW_TAG_member)
    <565>   DW_AT_name        : (indirect string, offset: 0x8eb98): RESERVED3
    <569>   DW_AT_decl_file   : 3
    <56a>   DW_AT_decl_line   : 354
    <56c>   DW_AT_decl_column : 17
    <56d>   DW_AT_type        : <0x31c>
    <571>   DW_AT_data_member_location: 72
 <2><572>: Abbrev Number: 16 (DW_TAG_member)
    <573>   DW_AT_name        : (indirect string, offset: 0x8bfd8): AHB1LPENR
    <577>   DW_AT_decl_file   : 3
    <578>   DW_AT_decl_line   : 355
    <57a>   DW_AT_decl_column : 17
    <57b>   DW_AT_type        : <0x307>
    <57f>   DW_AT_data_member_location: 80
 <2><580>: Abbrev Number: 16 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0x8ac5e): AHB2LPENR
    <585>   DW_AT_decl_file   : 3
    <586>   DW_AT_decl_line   : 356
    <588>   DW_AT_decl_column : 17
    <589>   DW_AT_type        : <0x307>
    <58d>   DW_AT_data_member_location: 84
 <2><58e>: Abbrev Number: 16 (DW_TAG_member)
    <58f>   DW_AT_name        : (indirect string, offset: 0x8d1cb): AHB3LPENR
    <593>   DW_AT_decl_file   : 3
    <594>   DW_AT_decl_line   : 357
    <596>   DW_AT_decl_column : 17
    <597>   DW_AT_type        : <0x307>
    <59b>   DW_AT_data_member_location: 88
 <2><59c>: Abbrev Number: 16 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0x8eba2): RESERVED4
    <5a1>   DW_AT_decl_file   : 3
    <5a2>   DW_AT_decl_line   : 358
    <5a4>   DW_AT_decl_column : 17
    <5a5>   DW_AT_type        : <0x2fb>
    <5a9>   DW_AT_data_member_location: 92
 <2><5aa>: Abbrev Number: 16 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x8d179): APB1LPENR
    <5af>   DW_AT_decl_file   : 3
    <5b0>   DW_AT_decl_line   : 359
    <5b2>   DW_AT_decl_column : 17
    <5b3>   DW_AT_type        : <0x307>
    <5b7>   DW_AT_data_member_location: 96
 <2><5b8>: Abbrev Number: 16 (DW_TAG_member)
    <5b9>   DW_AT_name        : (indirect string, offset: 0x89dac): APB2LPENR
    <5bd>   DW_AT_decl_file   : 3
    <5be>   DW_AT_decl_line   : 360
    <5c0>   DW_AT_decl_column : 17
    <5c1>   DW_AT_type        : <0x307>
    <5c5>   DW_AT_data_member_location: 100
 <2><5c6>: Abbrev Number: 16 (DW_TAG_member)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x8ebac): RESERVED5
    <5cb>   DW_AT_decl_file   : 3
    <5cc>   DW_AT_decl_line   : 361
    <5ce>   DW_AT_decl_column : 17
    <5cf>   DW_AT_type        : <0x31c>
    <5d3>   DW_AT_data_member_location: 104
 <2><5d4>: Abbrev Number: 16 (DW_TAG_member)
    <5d5>   DW_AT_name        : (indirect string, offset: 0x8a269): BDCR
    <5d9>   DW_AT_decl_file   : 3
    <5da>   DW_AT_decl_line   : 362
    <5dc>   DW_AT_decl_column : 17
    <5dd>   DW_AT_type        : <0x307>
    <5e1>   DW_AT_data_member_location: 112
 <2><5e2>: Abbrev Number: 17 (DW_TAG_member)
    <5e3>   DW_AT_name        : CSR
    <5e7>   DW_AT_decl_file   : 3
    <5e8>   DW_AT_decl_line   : 363
    <5ea>   DW_AT_decl_column : 17
    <5eb>   DW_AT_type        : <0x307>
    <5ef>   DW_AT_data_member_location: 116
 <2><5f0>: Abbrev Number: 16 (DW_TAG_member)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x8ebb6): RESERVED6
    <5f5>   DW_AT_decl_file   : 3
    <5f6>   DW_AT_decl_line   : 364
    <5f8>   DW_AT_decl_column : 17
    <5f9>   DW_AT_type        : <0x31c>
    <5fd>   DW_AT_data_member_location: 120
 <2><5fe>: Abbrev Number: 16 (DW_TAG_member)
    <5ff>   DW_AT_name        : (indirect string, offset: 0x8c307): SSCGR
    <603>   DW_AT_decl_file   : 3
    <604>   DW_AT_decl_line   : 365
    <606>   DW_AT_decl_column : 17
    <607>   DW_AT_type        : <0x307>
    <60b>   DW_AT_data_member_location: 128
 <2><60c>: Abbrev Number: 16 (DW_TAG_member)
    <60d>   DW_AT_name        : (indirect string, offset: 0x8b356): PLLI2SCFGR
    <611>   DW_AT_decl_file   : 3
    <612>   DW_AT_decl_line   : 366
    <614>   DW_AT_decl_column : 17
    <615>   DW_AT_type        : <0x307>
    <619>   DW_AT_data_member_location: 132
 <2><61a>: Abbrev Number: 16 (DW_TAG_member)
    <61b>   DW_AT_name        : (indirect string, offset: 0x8ebc0): RESERVED7
    <61f>   DW_AT_decl_file   : 3
    <620>   DW_AT_decl_line   : 367
    <622>   DW_AT_decl_column : 17
    <623>   DW_AT_type        : <0x30c>
    <627>   DW_AT_data_member_location: 136
 <2><628>: Abbrev Number: 16 (DW_TAG_member)
    <629>   DW_AT_name        : (indirect string, offset: 0x8bab2): DCKCFGR
    <62d>   DW_AT_decl_file   : 3
    <62e>   DW_AT_decl_line   : 368
    <630>   DW_AT_decl_column : 17
    <631>   DW_AT_type        : <0x307>
    <635>   DW_AT_data_member_location: 140
 <2><636>: Abbrev Number: 0
 <1><637>: Abbrev Number: 18 (DW_TAG_typedef)
    <638>   DW_AT_name        : (indirect string, offset: 0x8bcdf): RCC_TypeDef
    <63c>   DW_AT_decl_file   : 3
    <63d>   DW_AT_decl_line   : 369
    <63f>   DW_AT_decl_column : 3
    <640>   DW_AT_type        : <0x46d>
 <1><644>: Abbrev Number: 15 (DW_TAG_structure_type)
    <645>   DW_AT_byte_size   : 84
    <646>   DW_AT_decl_file   : 3
    <647>   DW_AT_decl_line   : 469
    <649>   DW_AT_decl_column : 9
    <64a>   DW_AT_sibling     : <0x773>
 <2><64e>: Abbrev Number: 17 (DW_TAG_member)
    <64f>   DW_AT_name        : CR1
    <653>   DW_AT_decl_file   : 3
    <654>   DW_AT_decl_line   : 471
    <656>   DW_AT_decl_column : 17
    <657>   DW_AT_type        : <0x307>
    <65b>   DW_AT_data_member_location: 0
 <2><65c>: Abbrev Number: 17 (DW_TAG_member)
    <65d>   DW_AT_name        : CR2
    <661>   DW_AT_decl_file   : 3
    <662>   DW_AT_decl_line   : 472
    <664>   DW_AT_decl_column : 17
    <665>   DW_AT_type        : <0x307>
    <669>   DW_AT_data_member_location: 4
 <2><66a>: Abbrev Number: 16 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0x855e2): SMCR
    <66f>   DW_AT_decl_file   : 3
    <670>   DW_AT_decl_line   : 473
    <672>   DW_AT_decl_column : 17
    <673>   DW_AT_type        : <0x307>
    <677>   DW_AT_data_member_location: 8
 <2><678>: Abbrev Number: 16 (DW_TAG_member)
    <679>   DW_AT_name        : (indirect string, offset: 0x63e17): DIER
    <67d>   DW_AT_decl_file   : 3
    <67e>   DW_AT_decl_line   : 474
    <680>   DW_AT_decl_column : 17
    <681>   DW_AT_type        : <0x307>
    <685>   DW_AT_data_member_location: 12
 <2><686>: Abbrev Number: 17 (DW_TAG_member)
    <687>   DW_AT_name        : SR
    <68a>   DW_AT_decl_file   : 3
    <68b>   DW_AT_decl_line   : 475
    <68d>   DW_AT_decl_column : 17
    <68e>   DW_AT_type        : <0x307>
    <692>   DW_AT_data_member_location: 16
 <2><693>: Abbrev Number: 17 (DW_TAG_member)
    <694>   DW_AT_name        : EGR
    <698>   DW_AT_decl_file   : 3
    <699>   DW_AT_decl_line   : 476
    <69b>   DW_AT_decl_column : 17
    <69c>   DW_AT_type        : <0x307>
    <6a0>   DW_AT_data_member_location: 20
 <2><6a1>: Abbrev Number: 16 (DW_TAG_member)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x57a39): CCMR1
    <6a6>   DW_AT_decl_file   : 3
    <6a7>   DW_AT_decl_line   : 477
    <6a9>   DW_AT_decl_column : 17
    <6aa>   DW_AT_type        : <0x307>
    <6ae>   DW_AT_data_member_location: 24
 <2><6af>: Abbrev Number: 16 (DW_TAG_member)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x5617b): CCMR2
    <6b4>   DW_AT_decl_file   : 3
    <6b5>   DW_AT_decl_line   : 478
    <6b7>   DW_AT_decl_column : 17
    <6b8>   DW_AT_type        : <0x307>
    <6bc>   DW_AT_data_member_location: 28
 <2><6bd>: Abbrev Number: 16 (DW_TAG_member)
    <6be>   DW_AT_name        : (indirect string, offset: 0x83b22): CCER
    <6c2>   DW_AT_decl_file   : 3
    <6c3>   DW_AT_decl_line   : 479
    <6c5>   DW_AT_decl_column : 17
    <6c6>   DW_AT_type        : <0x307>
    <6ca>   DW_AT_data_member_location: 32
 <2><6cb>: Abbrev Number: 17 (DW_TAG_member)
    <6cc>   DW_AT_name        : CNT
    <6d0>   DW_AT_decl_file   : 3
    <6d1>   DW_AT_decl_line   : 480
    <6d3>   DW_AT_decl_column : 17
    <6d4>   DW_AT_type        : <0x307>
    <6d8>   DW_AT_data_member_location: 36
 <2><6d9>: Abbrev Number: 17 (DW_TAG_member)
    <6da>   DW_AT_name        : PSC
    <6de>   DW_AT_decl_file   : 3
    <6df>   DW_AT_decl_line   : 481
    <6e1>   DW_AT_decl_column : 17
    <6e2>   DW_AT_type        : <0x307>
    <6e6>   DW_AT_data_member_location: 40
 <2><6e7>: Abbrev Number: 17 (DW_TAG_member)
    <6e8>   DW_AT_name        : ARR
    <6ec>   DW_AT_decl_file   : 3
    <6ed>   DW_AT_decl_line   : 482
    <6ef>   DW_AT_decl_column : 17
    <6f0>   DW_AT_type        : <0x307>
    <6f4>   DW_AT_data_member_location: 44
 <2><6f5>: Abbrev Number: 17 (DW_TAG_member)
    <6f6>   DW_AT_name        : RCR
    <6fa>   DW_AT_decl_file   : 3
    <6fb>   DW_AT_decl_line   : 483
    <6fd>   DW_AT_decl_column : 17
    <6fe>   DW_AT_type        : <0x307>
    <702>   DW_AT_data_member_location: 48
 <2><703>: Abbrev Number: 16 (DW_TAG_member)
    <704>   DW_AT_name        : (indirect string, offset: 0x71e6e): CCR1
    <708>   DW_AT_decl_file   : 3
    <709>   DW_AT_decl_line   : 484
    <70b>   DW_AT_decl_column : 17
    <70c>   DW_AT_type        : <0x307>
    <710>   DW_AT_data_member_location: 52
 <2><711>: Abbrev Number: 16 (DW_TAG_member)
    <712>   DW_AT_name        : (indirect string, offset: 0x3a2fd): CCR2
    <716>   DW_AT_decl_file   : 3
    <717>   DW_AT_decl_line   : 485
    <719>   DW_AT_decl_column : 17
    <71a>   DW_AT_type        : <0x307>
    <71e>   DW_AT_data_member_location: 56
 <2><71f>: Abbrev Number: 16 (DW_TAG_member)
    <720>   DW_AT_name        : (indirect string, offset: 0x36158): CCR3
    <724>   DW_AT_decl_file   : 3
    <725>   DW_AT_decl_line   : 486
    <727>   DW_AT_decl_column : 17
    <728>   DW_AT_type        : <0x307>
    <72c>   DW_AT_data_member_location: 60
 <2><72d>: Abbrev Number: 16 (DW_TAG_member)
    <72e>   DW_AT_name        : (indirect string, offset: 0xf8fe): CCR4
    <732>   DW_AT_decl_file   : 3
    <733>   DW_AT_decl_line   : 487
    <735>   DW_AT_decl_column : 17
    <736>   DW_AT_type        : <0x307>
    <73a>   DW_AT_data_member_location: 64
 <2><73b>: Abbrev Number: 16 (DW_TAG_member)
    <73c>   DW_AT_name        : (indirect string, offset: 0xa562): BDTR
    <740>   DW_AT_decl_file   : 3
    <741>   DW_AT_decl_line   : 488
    <743>   DW_AT_decl_column : 17
    <744>   DW_AT_type        : <0x307>
    <748>   DW_AT_data_member_location: 68
 <2><749>: Abbrev Number: 17 (DW_TAG_member)
    <74a>   DW_AT_name        : DCR
    <74e>   DW_AT_decl_file   : 3
    <74f>   DW_AT_decl_line   : 489
    <751>   DW_AT_decl_column : 17
    <752>   DW_AT_type        : <0x307>
    <756>   DW_AT_data_member_location: 72
 <2><757>: Abbrev Number: 16 (DW_TAG_member)
    <758>   DW_AT_name        : (indirect string, offset: 0x3c73): DMAR
    <75c>   DW_AT_decl_file   : 3
    <75d>   DW_AT_decl_line   : 490
    <75f>   DW_AT_decl_column : 17
    <760>   DW_AT_type        : <0x307>
    <764>   DW_AT_data_member_location: 76
 <2><765>: Abbrev Number: 17 (DW_TAG_member)
    <766>   DW_AT_name        : OR
    <769>   DW_AT_decl_file   : 3
    <76a>   DW_AT_decl_line   : 491
    <76c>   DW_AT_decl_column : 17
    <76d>   DW_AT_type        : <0x307>
    <771>   DW_AT_data_member_location: 80
 <2><772>: Abbrev Number: 0
 <1><773>: Abbrev Number: 18 (DW_TAG_typedef)
    <774>   DW_AT_name        : (indirect string, offset: 0x89abe): TIM_TypeDef
    <778>   DW_AT_decl_file   : 3
    <779>   DW_AT_decl_line   : 492
    <77b>   DW_AT_decl_column : 3
    <77c>   DW_AT_type        : <0x644>
 <1><780>: Abbrev Number: 15 (DW_TAG_structure_type)
    <781>   DW_AT_byte_size   : 28
    <782>   DW_AT_decl_file   : 3
    <783>   DW_AT_decl_line   : 498
    <785>   DW_AT_decl_column : 9
    <786>   DW_AT_sibling     : <0x7eb>
 <2><78a>: Abbrev Number: 17 (DW_TAG_member)
    <78b>   DW_AT_name        : SR
    <78e>   DW_AT_decl_file   : 3
    <78f>   DW_AT_decl_line   : 500
    <791>   DW_AT_decl_column : 17
    <792>   DW_AT_type        : <0x307>
    <796>   DW_AT_data_member_location: 0
 <2><797>: Abbrev Number: 17 (DW_TAG_member)
    <798>   DW_AT_name        : DR
    <79b>   DW_AT_decl_file   : 3
    <79c>   DW_AT_decl_line   : 501
    <79e>   DW_AT_decl_column : 17
    <79f>   DW_AT_type        : <0x307>
    <7a3>   DW_AT_data_member_location: 4
 <2><7a4>: Abbrev Number: 17 (DW_TAG_member)
    <7a5>   DW_AT_name        : BRR
    <7a9>   DW_AT_decl_file   : 3
    <7aa>   DW_AT_decl_line   : 502
    <7ac>   DW_AT_decl_column : 17
    <7ad>   DW_AT_type        : <0x307>
    <7b1>   DW_AT_data_member_location: 8
 <2><7b2>: Abbrev Number: 17 (DW_TAG_member)
    <7b3>   DW_AT_name        : CR1
    <7b7>   DW_AT_decl_file   : 3
    <7b8>   DW_AT_decl_line   : 503
    <7ba>   DW_AT_decl_column : 17
    <7bb>   DW_AT_type        : <0x307>
    <7bf>   DW_AT_data_member_location: 12
 <2><7c0>: Abbrev Number: 17 (DW_TAG_member)
    <7c1>   DW_AT_name        : CR2
    <7c5>   DW_AT_decl_file   : 3
    <7c6>   DW_AT_decl_line   : 504
    <7c8>   DW_AT_decl_column : 17
    <7c9>   DW_AT_type        : <0x307>
    <7cd>   DW_AT_data_member_location: 16
 <2><7ce>: Abbrev Number: 17 (DW_TAG_member)
    <7cf>   DW_AT_name        : CR3
    <7d3>   DW_AT_decl_file   : 3
    <7d4>   DW_AT_decl_line   : 505
    <7d6>   DW_AT_decl_column : 17
    <7d7>   DW_AT_type        : <0x307>
    <7db>   DW_AT_data_member_location: 20
 <2><7dc>: Abbrev Number: 16 (DW_TAG_member)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x8b022): GTPR
    <7e1>   DW_AT_decl_file   : 3
    <7e2>   DW_AT_decl_line   : 506
    <7e4>   DW_AT_decl_column : 17
    <7e5>   DW_AT_type        : <0x307>
    <7e9>   DW_AT_data_member_location: 24
 <2><7ea>: Abbrev Number: 0
 <1><7eb>: Abbrev Number: 18 (DW_TAG_typedef)
    <7ec>   DW_AT_name        : (indirect string, offset: 0x8ee92): USART_TypeDef
    <7f0>   DW_AT_decl_file   : 3
    <7f1>   DW_AT_decl_line   : 507
    <7f3>   DW_AT_decl_column : 3
    <7f4>   DW_AT_type        : <0x780>
 <1><7f8>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <7f9>   DW_AT_encoding    : 7	(unsigned)
    <7fa>   DW_AT_byte_size   : 1
    <7fb>   DW_AT_type        : <0x27d>
    <7ff>   DW_AT_decl_file   : 6
    <800>   DW_AT_decl_line   : 185
    <801>   DW_AT_decl_column : 1
    <802>   DW_AT_sibling     : <0x813>
 <2><806>: Abbrev Number: 4 (DW_TAG_enumerator)
    <807>   DW_AT_name        : (indirect string, offset: 0x38151): RESET
    <80b>   DW_AT_const_value : 0
 <2><80c>: Abbrev Number: 19 (DW_TAG_enumerator)
    <80d>   DW_AT_name        : SET
    <811>   DW_AT_const_value : 1
 <2><812>: Abbrev Number: 0
 <1><813>: Abbrev Number: 6 (DW_TAG_typedef)
    <814>   DW_AT_name        : (indirect string, offset: 0x2e58d): size_t
    <818>   DW_AT_decl_file   : 7
    <819>   DW_AT_decl_line   : 209
    <81a>   DW_AT_decl_column : 23
    <81b>   DW_AT_type        : <0x2cd>
 <1><81f>: Abbrev Number: 5 (DW_TAG_base_type)
    <820>   DW_AT_byte_size   : 8
    <821>   DW_AT_encoding    : 4	(float)
    <822>   DW_AT_name        : (indirect string, offset: 0x8dc25): long double
 <1><826>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <827>   DW_AT_encoding    : 7	(unsigned)
    <828>   DW_AT_byte_size   : 1
    <829>   DW_AT_type        : <0x27d>
    <82d>   DW_AT_decl_file   : 8
    <82e>   DW_AT_decl_line   : 39
    <82f>   DW_AT_decl_column : 1
    <830>   DW_AT_sibling     : <0x84d>
 <2><834>: Abbrev Number: 4 (DW_TAG_enumerator)
    <835>   DW_AT_name        : (indirect string, offset: 0x8b3a1): HAL_OK
    <839>   DW_AT_const_value : 0
 <2><83a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <83b>   DW_AT_name        : (indirect string, offset: 0x8cb73): HAL_ERROR
    <83f>   DW_AT_const_value : 1
 <2><840>: Abbrev Number: 4 (DW_TAG_enumerator)
    <841>   DW_AT_name        : (indirect string, offset: 0x8dd68): HAL_BUSY
    <845>   DW_AT_const_value : 2
 <2><846>: Abbrev Number: 4 (DW_TAG_enumerator)
    <847>   DW_AT_name        : (indirect string, offset: 0x8b0fb): HAL_TIMEOUT
    <84b>   DW_AT_const_value : 3
 <2><84c>: Abbrev Number: 0
 <1><84d>: Abbrev Number: 6 (DW_TAG_typedef)
    <84e>   DW_AT_name        : (indirect string, offset: 0x898ea): HAL_StatusTypeDef
    <852>   DW_AT_decl_file   : 8
    <853>   DW_AT_decl_line   : 44
    <854>   DW_AT_decl_column : 3
    <855>   DW_AT_type        : <0x826>
 <1><859>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <85a>   DW_AT_encoding    : 7	(unsigned)
    <85b>   DW_AT_byte_size   : 1
    <85c>   DW_AT_type        : <0x27d>
    <860>   DW_AT_decl_file   : 8
    <861>   DW_AT_decl_line   : 50
    <862>   DW_AT_decl_column : 1
    <863>   DW_AT_sibling     : <0x874>
 <2><867>: Abbrev Number: 4 (DW_TAG_enumerator)
    <868>   DW_AT_name        : (indirect string, offset: 0x8d6a5): HAL_UNLOCKED
    <86c>   DW_AT_const_value : 0
 <2><86d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <86e>   DW_AT_name        : (indirect string, offset: 0x8f027): HAL_LOCKED
    <872>   DW_AT_const_value : 1
 <2><873>: Abbrev Number: 0
 <1><874>: Abbrev Number: 6 (DW_TAG_typedef)
    <875>   DW_AT_name        : (indirect string, offset: 0x8c91f): HAL_LockTypeDef
    <879>   DW_AT_decl_file   : 8
    <87a>   DW_AT_decl_line   : 53
    <87b>   DW_AT_decl_column : 3
    <87c>   DW_AT_type        : <0x859>
 <1><880>: Abbrev Number: 12 (DW_TAG_structure_type)
    <881>   DW_AT_byte_size   : 24
    <882>   DW_AT_decl_file   : 9
    <883>   DW_AT_decl_line   : 45
    <884>   DW_AT_decl_column : 9
    <885>   DW_AT_sibling     : <0x8d8>
 <2><889>: Abbrev Number: 14 (DW_TAG_member)
    <88a>   DW_AT_name        : (indirect string, offset: 0x8d183): PLLState
    <88e>   DW_AT_decl_file   : 9
    <88f>   DW_AT_decl_line   : 47
    <890>   DW_AT_decl_column : 12
    <891>   DW_AT_type        : <0x2fb>
    <895>   DW_AT_data_member_location: 0
 <2><896>: Abbrev Number: 14 (DW_TAG_member)
    <897>   DW_AT_name        : (indirect string, offset: 0x8d206): PLLSource
    <89b>   DW_AT_decl_file   : 9
    <89c>   DW_AT_decl_line   : 50
    <89d>   DW_AT_decl_column : 12
    <89e>   DW_AT_type        : <0x2fb>
    <8a2>   DW_AT_data_member_location: 4
 <2><8a3>: Abbrev Number: 14 (DW_TAG_member)
    <8a4>   DW_AT_name        : (indirect string, offset: 0x8dc9f): PLLM
    <8a8>   DW_AT_decl_file   : 9
    <8a9>   DW_AT_decl_line   : 53
    <8aa>   DW_AT_decl_column : 12
    <8ab>   DW_AT_type        : <0x2fb>
    <8af>   DW_AT_data_member_location: 8
 <2><8b0>: Abbrev Number: 14 (DW_TAG_member)
    <8b1>   DW_AT_name        : (indirect string, offset: 0x8dca4): PLLN
    <8b5>   DW_AT_decl_file   : 9
    <8b6>   DW_AT_decl_line   : 56
    <8b7>   DW_AT_decl_column : 12
    <8b8>   DW_AT_type        : <0x2fb>
    <8bc>   DW_AT_data_member_location: 12
 <2><8bd>: Abbrev Number: 14 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0x8bceb): PLLP
    <8c2>   DW_AT_decl_file   : 9
    <8c3>   DW_AT_decl_line   : 60
    <8c4>   DW_AT_decl_column : 12
    <8c5>   DW_AT_type        : <0x2fb>
    <8c9>   DW_AT_data_member_location: 16
 <2><8ca>: Abbrev Number: 14 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x77b05): PLLQ
    <8cf>   DW_AT_decl_file   : 9
    <8d0>   DW_AT_decl_line   : 63
    <8d1>   DW_AT_decl_column : 12
    <8d2>   DW_AT_type        : <0x2fb>
    <8d6>   DW_AT_data_member_location: 20
 <2><8d7>: Abbrev Number: 0
 <1><8d8>: Abbrev Number: 6 (DW_TAG_typedef)
    <8d9>   DW_AT_name        : (indirect string, offset: 0x8ee05): RCC_PLLInitTypeDef
    <8dd>   DW_AT_decl_file   : 9
    <8de>   DW_AT_decl_line   : 73
    <8df>   DW_AT_decl_column : 2
    <8e0>   DW_AT_type        : <0x880>
 <1><8e4>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8e5>   DW_AT_byte_size   : 48
    <8e6>   DW_AT_decl_file   : 10
    <8e7>   DW_AT_decl_line   : 49
    <8e8>   DW_AT_decl_column : 9
    <8e9>   DW_AT_sibling     : <0x949>
 <2><8ed>: Abbrev Number: 14 (DW_TAG_member)
    <8ee>   DW_AT_name        : (indirect string, offset: 0x8dbe8): OscillatorType
    <8f2>   DW_AT_decl_file   : 10
    <8f3>   DW_AT_decl_line   : 51
    <8f4>   DW_AT_decl_column : 12
    <8f5>   DW_AT_type        : <0x2fb>
    <8f9>   DW_AT_data_member_location: 0
 <2><8fa>: Abbrev Number: 14 (DW_TAG_member)
    <8fb>   DW_AT_name        : (indirect string, offset: 0x8d1fd): HSEState
    <8ff>   DW_AT_decl_file   : 10
    <900>   DW_AT_decl_line   : 54
    <901>   DW_AT_decl_column : 12
    <902>   DW_AT_type        : <0x2fb>
    <906>   DW_AT_data_member_location: 4
 <2><907>: Abbrev Number: 14 (DW_TAG_member)
    <908>   DW_AT_name        : (indirect string, offset: 0x8cc23): LSEState
    <90c>   DW_AT_decl_file   : 10
    <90d>   DW_AT_decl_line   : 57
    <90e>   DW_AT_decl_column : 12
    <90f>   DW_AT_type        : <0x2fb>
    <913>   DW_AT_data_member_location: 8
 <2><914>: Abbrev Number: 14 (DW_TAG_member)
    <915>   DW_AT_name        : (indirect string, offset: 0x8bbb5): HSIState
    <919>   DW_AT_decl_file   : 10
    <91a>   DW_AT_decl_line   : 60
    <91b>   DW_AT_decl_column : 12
    <91c>   DW_AT_type        : <0x2fb>
    <920>   DW_AT_data_member_location: 12
 <2><921>: Abbrev Number: 14 (DW_TAG_member)
    <922>   DW_AT_name        : (indirect string, offset: 0x8df55): HSICalibrationValue
    <926>   DW_AT_decl_file   : 10
    <927>   DW_AT_decl_line   : 63
    <928>   DW_AT_decl_column : 12
    <929>   DW_AT_type        : <0x2fb>
    <92d>   DW_AT_data_member_location: 16
 <2><92e>: Abbrev Number: 14 (DW_TAG_member)
    <92f>   DW_AT_name        : (indirect string, offset: 0x8e286): LSIState
    <933>   DW_AT_decl_file   : 10
    <934>   DW_AT_decl_line   : 66
    <935>   DW_AT_decl_column : 12
    <936>   DW_AT_type        : <0x2fb>
    <93a>   DW_AT_data_member_location: 20
 <2><93b>: Abbrev Number: 13 (DW_TAG_member)
    <93c>   DW_AT_name        : PLL
    <940>   DW_AT_decl_file   : 10
    <941>   DW_AT_decl_line   : 69
    <942>   DW_AT_decl_column : 22
    <943>   DW_AT_type        : <0x8d8>
    <947>   DW_AT_data_member_location: 24
 <2><948>: Abbrev Number: 0
 <1><949>: Abbrev Number: 6 (DW_TAG_typedef)
    <94a>   DW_AT_name        : (indirect string, offset: 0x8c30d): RCC_OscInitTypeDef
    <94e>   DW_AT_decl_file   : 10
    <94f>   DW_AT_decl_line   : 70
    <950>   DW_AT_decl_column : 2
    <951>   DW_AT_type        : <0x8e4>
 <1><955>: Abbrev Number: 12 (DW_TAG_structure_type)
    <956>   DW_AT_byte_size   : 20
    <957>   DW_AT_decl_file   : 10
    <958>   DW_AT_decl_line   : 75
    <959>   DW_AT_decl_column : 9
    <95a>   DW_AT_sibling     : <0x9a0>
 <2><95e>: Abbrev Number: 14 (DW_TAG_member)
    <95f>   DW_AT_name        : (indirect string, offset: 0x8b1da): ClockType
    <963>   DW_AT_decl_file   : 10
    <964>   DW_AT_decl_line   : 77
    <965>   DW_AT_decl_column : 12
    <966>   DW_AT_type        : <0x2fb>
    <96a>   DW_AT_data_member_location: 0
 <2><96b>: Abbrev Number: 14 (DW_TAG_member)
    <96c>   DW_AT_name        : (indirect string, offset: 0x8c060): SYSCLKSource
    <970>   DW_AT_decl_file   : 10
    <971>   DW_AT_decl_line   : 80
    <972>   DW_AT_decl_column : 12
    <973>   DW_AT_type        : <0x2fb>
    <977>   DW_AT_data_member_location: 4
 <2><978>: Abbrev Number: 14 (DW_TAG_member)
    <979>   DW_AT_name        : (indirect string, offset: 0x8dc59): AHBCLKDivider
    <97d>   DW_AT_decl_file   : 10
    <97e>   DW_AT_decl_line   : 83
    <97f>   DW_AT_decl_column : 12
    <980>   DW_AT_type        : <0x2fb>
    <984>   DW_AT_data_member_location: 8
 <2><985>: Abbrev Number: 14 (DW_TAG_member)
    <986>   DW_AT_name        : (indirect string, offset: 0x89ade): APB1CLKDivider
    <98a>   DW_AT_decl_file   : 10
    <98b>   DW_AT_decl_line   : 86
    <98c>   DW_AT_decl_column : 12
    <98d>   DW_AT_type        : <0x2fb>
    <991>   DW_AT_data_member_location: 12
 <2><992>: Abbrev Number: 14 (DW_TAG_member)
    <993>   DW_AT_name        : (indirect string, offset: 0x8bc58): APB2CLKDivider
    <997>   DW_AT_decl_file   : 10
    <998>   DW_AT_decl_line   : 89
    <999>   DW_AT_decl_column : 12
    <99a>   DW_AT_type        : <0x2fb>
    <99e>   DW_AT_data_member_location: 16
 <2><99f>: Abbrev Number: 0
 <1><9a0>: Abbrev Number: 6 (DW_TAG_typedef)
    <9a1>   DW_AT_name        : (indirect string, offset: 0x8d4fa): RCC_ClkInitTypeDef
    <9a5>   DW_AT_decl_file   : 10
    <9a6>   DW_AT_decl_line   : 92
    <9a7>   DW_AT_decl_column : 2
    <9a8>   DW_AT_type        : <0x955>
 <1><9ac>: Abbrev Number: 12 (DW_TAG_structure_type)
    <9ad>   DW_AT_byte_size   : 20
    <9ae>   DW_AT_decl_file   : 11
    <9af>   DW_AT_decl_line   : 46
    <9b0>   DW_AT_decl_column : 9
    <9b1>   DW_AT_sibling     : <0x9f7>
 <2><9b5>: Abbrev Number: 13 (DW_TAG_member)
    <9b6>   DW_AT_name        : Pin
    <9ba>   DW_AT_decl_file   : 11
    <9bb>   DW_AT_decl_line   : 48
    <9bc>   DW_AT_decl_column : 12
    <9bd>   DW_AT_type        : <0x2fb>
    <9c1>   DW_AT_data_member_location: 0
 <2><9c2>: Abbrev Number: 14 (DW_TAG_member)
    <9c3>   DW_AT_name        : (indirect string, offset: 0x904a4): Mode
    <9c7>   DW_AT_decl_file   : 11
    <9c8>   DW_AT_decl_line   : 51
    <9c9>   DW_AT_decl_column : 12
    <9ca>   DW_AT_type        : <0x2fb>
    <9ce>   DW_AT_data_member_location: 4
 <2><9cf>: Abbrev Number: 14 (DW_TAG_member)
    <9d0>   DW_AT_name        : (indirect string, offset: 0x8c07c): Pull
    <9d4>   DW_AT_decl_file   : 11
    <9d5>   DW_AT_decl_line   : 54
    <9d6>   DW_AT_decl_column : 12
    <9d7>   DW_AT_type        : <0x2fb>
    <9db>   DW_AT_data_member_location: 8
 <2><9dc>: Abbrev Number: 14 (DW_TAG_member)
    <9dd>   DW_AT_name        : (indirect string, offset: 0x8c7b9): Speed
    <9e1>   DW_AT_decl_file   : 11
    <9e2>   DW_AT_decl_line   : 57
    <9e3>   DW_AT_decl_column : 12
    <9e4>   DW_AT_type        : <0x2fb>
    <9e8>   DW_AT_data_member_location: 12
 <2><9e9>: Abbrev Number: 14 (DW_TAG_member)
    <9ea>   DW_AT_name        : (indirect string, offset: 0x8bc4e): Alternate
    <9ee>   DW_AT_decl_file   : 11
    <9ef>   DW_AT_decl_line   : 60
    <9f0>   DW_AT_decl_column : 12
    <9f1>   DW_AT_type        : <0x2fb>
    <9f5>   DW_AT_data_member_location: 16
 <2><9f6>: Abbrev Number: 0
 <1><9f7>: Abbrev Number: 6 (DW_TAG_typedef)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x8d97b): GPIO_InitTypeDef
    <9fc>   DW_AT_decl_file   : 11
    <9fd>   DW_AT_decl_line   : 62
    <9fe>   DW_AT_decl_column : 2
    <9ff>   DW_AT_type        : <0x9ac>
 <1><a03>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <a04>   DW_AT_encoding    : 7	(unsigned)
    <a05>   DW_AT_byte_size   : 1
    <a06>   DW_AT_type        : <0x27d>
    <a0a>   DW_AT_decl_file   : 11
    <a0b>   DW_AT_decl_line   : 68
    <a0c>   DW_AT_decl_column : 1
    <a0d>   DW_AT_sibling     : <0xa1e>
 <2><a11>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a12>   DW_AT_name        : (indirect string, offset: 0x8aaab): GPIO_PIN_RESET
    <a16>   DW_AT_const_value : 0
 <2><a17>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a18>   DW_AT_name        : (indirect string, offset: 0x8a6b2): GPIO_PIN_SET
    <a1c>   DW_AT_const_value : 1
 <2><a1d>: Abbrev Number: 0
 <1><a1e>: Abbrev Number: 6 (DW_TAG_typedef)
    <a1f>   DW_AT_name        : (indirect string, offset: 0x8ee39): GPIO_PinState
    <a23>   DW_AT_decl_file   : 11
    <a24>   DW_AT_decl_line   : 71
    <a25>   DW_AT_decl_column : 2
    <a26>   DW_AT_type        : <0xa03>
 <1><a2a>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a2b>   DW_AT_byte_size   : 48
    <a2c>   DW_AT_decl_file   : 12
    <a2d>   DW_AT_decl_line   : 48
    <a2e>   DW_AT_decl_column : 9
    <a2f>   DW_AT_sibling     : <0xad0>
 <2><a33>: Abbrev Number: 14 (DW_TAG_member)
    <a34>   DW_AT_name        : (indirect string, offset: 0x8c24b): Channel
    <a38>   DW_AT_decl_file   : 12
    <a39>   DW_AT_decl_line   : 50
    <a3a>   DW_AT_decl_column : 12
    <a3b>   DW_AT_type        : <0x2fb>
    <a3f>   DW_AT_data_member_location: 0
 <2><a40>: Abbrev Number: 14 (DW_TAG_member)
    <a41>   DW_AT_name        : (indirect string, offset: 0x8b543): Direction
    <a45>   DW_AT_decl_file   : 12
    <a46>   DW_AT_decl_line   : 53
    <a47>   DW_AT_decl_column : 12
    <a48>   DW_AT_type        : <0x2fb>
    <a4c>   DW_AT_data_member_location: 4
 <2><a4d>: Abbrev Number: 14 (DW_TAG_member)
    <a4e>   DW_AT_name        : (indirect string, offset: 0x89d5d): PeriphInc
    <a52>   DW_AT_decl_file   : 12
    <a53>   DW_AT_decl_line   : 57
    <a54>   DW_AT_decl_column : 12
    <a55>   DW_AT_type        : <0x2fb>
    <a59>   DW_AT_data_member_location: 8
 <2><a5a>: Abbrev Number: 14 (DW_TAG_member)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x8a474): MemInc
    <a5f>   DW_AT_decl_file   : 12
    <a60>   DW_AT_decl_line   : 60
    <a61>   DW_AT_decl_column : 12
    <a62>   DW_AT_type        : <0x2fb>
    <a66>   DW_AT_data_member_location: 12
 <2><a67>: Abbrev Number: 14 (DW_TAG_member)
    <a68>   DW_AT_name        : (indirect string, offset: 0x8c017): PeriphDataAlignment
    <a6c>   DW_AT_decl_file   : 12
    <a6d>   DW_AT_decl_line   : 63
    <a6e>   DW_AT_decl_column : 12
    <a6f>   DW_AT_type        : <0x2fb>
    <a73>   DW_AT_data_member_location: 16
 <2><a74>: Abbrev Number: 14 (DW_TAG_member)
    <a75>   DW_AT_name        : (indirect string, offset: 0x8e3d3): MemDataAlignment
    <a79>   DW_AT_decl_file   : 12
    <a7a>   DW_AT_decl_line   : 66
    <a7b>   DW_AT_decl_column : 12
    <a7c>   DW_AT_type        : <0x2fb>
    <a80>   DW_AT_data_member_location: 20
 <2><a81>: Abbrev Number: 14 (DW_TAG_member)
    <a82>   DW_AT_name        : (indirect string, offset: 0x904a4): Mode
    <a86>   DW_AT_decl_file   : 12
    <a87>   DW_AT_decl_line   : 69
    <a88>   DW_AT_decl_column : 12
    <a89>   DW_AT_type        : <0x2fb>
    <a8d>   DW_AT_data_member_location: 24
 <2><a8e>: Abbrev Number: 14 (DW_TAG_member)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x8fb20): Priority
    <a93>   DW_AT_decl_file   : 12
    <a94>   DW_AT_decl_line   : 74
    <a95>   DW_AT_decl_column : 12
    <a96>   DW_AT_type        : <0x2fb>
    <a9a>   DW_AT_data_member_location: 28
 <2><a9b>: Abbrev Number: 14 (DW_TAG_member)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x8ba97): FIFOMode
    <aa0>   DW_AT_decl_file   : 12
    <aa1>   DW_AT_decl_line   : 77
    <aa2>   DW_AT_decl_column : 12
    <aa3>   DW_AT_type        : <0x2fb>
    <aa7>   DW_AT_data_member_location: 32
 <2><aa8>: Abbrev Number: 14 (DW_TAG_member)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x8d7a8): FIFOThreshold
    <aad>   DW_AT_decl_file   : 12
    <aae>   DW_AT_decl_line   : 82
    <aaf>   DW_AT_decl_column : 12
    <ab0>   DW_AT_type        : <0x2fb>
    <ab4>   DW_AT_data_member_location: 36
 <2><ab5>: Abbrev Number: 14 (DW_TAG_member)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x8d753): MemBurst
    <aba>   DW_AT_decl_file   : 12
    <abb>   DW_AT_decl_line   : 85
    <abc>   DW_AT_decl_column : 12
    <abd>   DW_AT_type        : <0x2fb>
    <ac1>   DW_AT_data_member_location: 40
 <2><ac2>: Abbrev Number: 14 (DW_TAG_member)
    <ac3>   DW_AT_name        : (indirect string, offset: 0x8b3cf): PeriphBurst
    <ac7>   DW_AT_decl_file   : 12
    <ac8>   DW_AT_decl_line   : 91
    <ac9>   DW_AT_decl_column : 12
    <aca>   DW_AT_type        : <0x2fb>
    <ace>   DW_AT_data_member_location: 44
 <2><acf>: Abbrev Number: 0
 <1><ad0>: Abbrev Number: 6 (DW_TAG_typedef)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x8af49): DMA_InitTypeDef
    <ad5>   DW_AT_decl_file   : 12
    <ad6>   DW_AT_decl_line   : 96
    <ad7>   DW_AT_decl_column : 2
    <ad8>   DW_AT_type        : <0xa2a>
 <1><adc>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <add>   DW_AT_encoding    : 7	(unsigned)
    <ade>   DW_AT_byte_size   : 1
    <adf>   DW_AT_type        : <0x27d>
    <ae3>   DW_AT_decl_file   : 12
    <ae4>   DW_AT_decl_line   : 103
    <ae5>   DW_AT_decl_column : 1
    <ae6>   DW_AT_sibling     : <0xb0f>
 <2><aea>: Abbrev Number: 4 (DW_TAG_enumerator)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x8d6db): HAL_DMA_STATE_RESET
    <aef>   DW_AT_const_value : 0
 <2><af0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <af1>   DW_AT_name        : (indirect string, offset: 0x8afc4): HAL_DMA_STATE_READY
    <af5>   DW_AT_const_value : 1
 <2><af6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <af7>   DW_AT_name        : (indirect string, offset: 0x8d411): HAL_DMA_STATE_BUSY
    <afb>   DW_AT_const_value : 2
 <2><afc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <afd>   DW_AT_name        : (indirect string, offset: 0x8ee47): HAL_DMA_STATE_TIMEOUT
    <b01>   DW_AT_const_value : 3
 <2><b02>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b03>   DW_AT_name        : (indirect string, offset: 0x8df1e): HAL_DMA_STATE_ERROR
    <b07>   DW_AT_const_value : 4
 <2><b08>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b09>   DW_AT_name        : (indirect string, offset: 0x8acac): HAL_DMA_STATE_ABORT
    <b0d>   DW_AT_const_value : 5
 <2><b0e>: Abbrev Number: 0
 <1><b0f>: Abbrev Number: 6 (DW_TAG_typedef)
    <b10>   DW_AT_name        : (indirect string, offset: 0x8d13a): HAL_DMA_StateTypeDef
    <b14>   DW_AT_decl_file   : 12
    <b15>   DW_AT_decl_line   : 110
    <b16>   DW_AT_decl_column : 2
    <b17>   DW_AT_type        : <0xadc>
 <1><b1b>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <b1c>   DW_AT_type        : <0xb0f>
 <1><b20>: Abbrev Number: 20 (DW_TAG_structure_type)
    <b21>   DW_AT_name        : (indirect string, offset: 0x8deac): __DMA_HandleTypeDef
    <b25>   DW_AT_byte_size   : 96
    <b26>   DW_AT_decl_file   : 12
    <b27>   DW_AT_decl_line   : 138
    <b28>   DW_AT_decl_column : 16
    <b29>   DW_AT_sibling     : <0xbe4>
 <2><b2d>: Abbrev Number: 14 (DW_TAG_member)
    <b2e>   DW_AT_name        : (indirect string, offset: 0x8b725): Instance
    <b32>   DW_AT_decl_file   : 12
    <b33>   DW_AT_decl_line   : 140
    <b34>   DW_AT_decl_column : 31
    <b35>   DW_AT_type        : <0xbe4>
    <b39>   DW_AT_data_member_location: 0
 <2><b3a>: Abbrev Number: 14 (DW_TAG_member)
    <b3b>   DW_AT_name        : (indirect string, offset: 0x8a143): Init
    <b3f>   DW_AT_decl_file   : 12
    <b40>   DW_AT_decl_line   : 142
    <b41>   DW_AT_decl_column : 30
    <b42>   DW_AT_type        : <0xad0>
    <b46>   DW_AT_data_member_location: 4
 <2><b47>: Abbrev Number: 14 (DW_TAG_member)
    <b48>   DW_AT_name        : (indirect string, offset: 0x46229): Lock
    <b4c>   DW_AT_decl_file   : 12
    <b4d>   DW_AT_decl_line   : 144
    <b4e>   DW_AT_decl_column : 30
    <b4f>   DW_AT_type        : <0x874>
    <b53>   DW_AT_data_member_location: 52
 <2><b54>: Abbrev Number: 14 (DW_TAG_member)
    <b55>   DW_AT_name        : (indirect string, offset: 0x8d200): State
    <b59>   DW_AT_decl_file   : 12
    <b5a>   DW_AT_decl_line   : 146
    <b5b>   DW_AT_decl_column : 30
    <b5c>   DW_AT_type        : <0xb1b>
    <b60>   DW_AT_data_member_location: 53
 <2><b61>: Abbrev Number: 14 (DW_TAG_member)
    <b62>   DW_AT_name        : (indirect string, offset: 0x8ec84): Parent
    <b66>   DW_AT_decl_file   : 12
    <b67>   DW_AT_decl_line   : 148
    <b68>   DW_AT_decl_column : 31
    <b69>   DW_AT_type        : <0xbea>
    <b6d>   DW_AT_data_member_location: 56
 <2><b6e>: Abbrev Number: 14 (DW_TAG_member)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x8ef6b): XferCpltCallback
    <b73>   DW_AT_decl_file   : 12
    <b74>   DW_AT_decl_line   : 150
    <b75>   DW_AT_decl_column : 33
    <b76>   DW_AT_type        : <0xbfd>
    <b7a>   DW_AT_data_member_location: 60
 <2><b7b>: Abbrev Number: 14 (DW_TAG_member)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x8d8eb): XferHalfCpltCallback
    <b80>   DW_AT_decl_file   : 12
    <b81>   DW_AT_decl_line   : 152
    <b82>   DW_AT_decl_column : 33
    <b83>   DW_AT_type        : <0xbfd>
    <b87>   DW_AT_data_member_location: 64
 <2><b88>: Abbrev Number: 14 (DW_TAG_member)
    <b89>   DW_AT_name        : (indirect string, offset: 0x8adde): XferM1CpltCallback
    <b8d>   DW_AT_decl_file   : 12
    <b8e>   DW_AT_decl_line   : 154
    <b8f>   DW_AT_decl_column : 33
    <b90>   DW_AT_type        : <0xbfd>
    <b94>   DW_AT_data_member_location: 68
 <2><b95>: Abbrev Number: 14 (DW_TAG_member)
    <b96>   DW_AT_name        : (indirect string, offset: 0x8c4de): XferM1HalfCpltCallback
    <b9a>   DW_AT_decl_file   : 12
    <b9b>   DW_AT_decl_line   : 156
    <b9c>   DW_AT_decl_column : 33
    <b9d>   DW_AT_type        : <0xbfd>
    <ba1>   DW_AT_data_member_location: 72
 <2><ba2>: Abbrev Number: 14 (DW_TAG_member)
    <ba3>   DW_AT_name        : (indirect string, offset: 0x8a2ba): XferErrorCallback
    <ba7>   DW_AT_decl_file   : 12
    <ba8>   DW_AT_decl_line   : 158
    <ba9>   DW_AT_decl_column : 33
    <baa>   DW_AT_type        : <0xbfd>
    <bae>   DW_AT_data_member_location: 76
 <2><baf>: Abbrev Number: 14 (DW_TAG_member)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x8ea01): XferAbortCallback
    <bb4>   DW_AT_decl_file   : 12
    <bb5>   DW_AT_decl_line   : 160
    <bb6>   DW_AT_decl_column : 33
    <bb7>   DW_AT_type        : <0xbfd>
    <bbb>   DW_AT_data_member_location: 80
 <2><bbc>: Abbrev Number: 14 (DW_TAG_member)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x8edd5): ErrorCode
    <bc1>   DW_AT_decl_file   : 12
    <bc2>   DW_AT_decl_line   : 162
    <bc3>   DW_AT_decl_column : 30
    <bc4>   DW_AT_type        : <0x307>
    <bc8>   DW_AT_data_member_location: 84
 <2><bc9>: Abbrev Number: 14 (DW_TAG_member)
    <bca>   DW_AT_name        : (indirect string, offset: 0x8d777): StreamBaseAddress
    <bce>   DW_AT_decl_file   : 12
    <bcf>   DW_AT_decl_line   : 164
    <bd0>   DW_AT_decl_column : 30
    <bd1>   DW_AT_type        : <0x2fb>
    <bd5>   DW_AT_data_member_location: 88
 <2><bd6>: Abbrev Number: 14 (DW_TAG_member)
    <bd7>   DW_AT_name        : (indirect string, offset: 0x8dd94): StreamIndex
    <bdb>   DW_AT_decl_file   : 12
    <bdc>   DW_AT_decl_line   : 166
    <bdd>   DW_AT_decl_column : 30
    <bde>   DW_AT_type        : <0x2fb>
    <be2>   DW_AT_data_member_location: 92
 <2><be3>: Abbrev Number: 0
 <1><be4>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <be5>   DW_AT_byte_size   : 4
    <be6>   DW_AT_type        : <0x383>
 <1><bea>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <beb>   DW_AT_byte_size   : 4
 <1><bec>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <bed>   DW_AT_prototyped  : 1
    <bed>   DW_AT_sibling     : <0xbf7>
 <2><bf1>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <bf2>   DW_AT_type        : <0xbf7>
 <2><bf6>: Abbrev Number: 0
 <1><bf7>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <bf8>   DW_AT_byte_size   : 4
    <bf9>   DW_AT_type        : <0xb20>
 <1><bfd>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <bfe>   DW_AT_byte_size   : 4
    <bff>   DW_AT_type        : <0xbec>
 <1><c03>: Abbrev Number: 6 (DW_TAG_typedef)
    <c04>   DW_AT_name        : (indirect string, offset: 0x8deae): DMA_HandleTypeDef
    <c08>   DW_AT_decl_file   : 12
    <c09>   DW_AT_decl_line   : 168
    <c0a>   DW_AT_decl_column : 2
    <c0b>   DW_AT_type        : <0xb20>
 <1><c0f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c10>   DW_AT_byte_size   : 24
    <c11>   DW_AT_decl_file   : 13
    <c12>   DW_AT_decl_line   : 46
    <c13>   DW_AT_decl_column : 9
    <c14>   DW_AT_sibling     : <0xc67>
 <2><c18>: Abbrev Number: 14 (DW_TAG_member)
    <c19>   DW_AT_name        : (indirect string, offset: 0x90719): Prescaler
    <c1d>   DW_AT_decl_file   : 13
    <c1e>   DW_AT_decl_line   : 48
    <c1f>   DW_AT_decl_column : 12
    <c20>   DW_AT_type        : <0x2fb>
    <c24>   DW_AT_data_member_location: 0
 <2><c25>: Abbrev Number: 14 (DW_TAG_member)
    <c26>   DW_AT_name        : (indirect string, offset: 0x8e861): CounterMode
    <c2a>   DW_AT_decl_file   : 13
    <c2b>   DW_AT_decl_line   : 51
    <c2c>   DW_AT_decl_column : 12
    <c2d>   DW_AT_type        : <0x2fb>
    <c31>   DW_AT_data_member_location: 4
 <2><c32>: Abbrev Number: 14 (DW_TAG_member)
    <c33>   DW_AT_name        : (indirect string, offset: 0x960ea): Period
    <c37>   DW_AT_decl_file   : 13
    <c38>   DW_AT_decl_line   : 54
    <c39>   DW_AT_decl_column : 12
    <c3a>   DW_AT_type        : <0x2fb>
    <c3e>   DW_AT_data_member_location: 8
 <2><c3f>: Abbrev Number: 14 (DW_TAG_member)
    <c40>   DW_AT_name        : (indirect string, offset: 0x8b7cb): ClockDivision
    <c44>   DW_AT_decl_file   : 13
    <c45>   DW_AT_decl_line   : 58
    <c46>   DW_AT_decl_column : 12
    <c47>   DW_AT_type        : <0x2fb>
    <c4b>   DW_AT_data_member_location: 12
 <2><c4c>: Abbrev Number: 14 (DW_TAG_member)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x8d4e8): RepetitionCounter
    <c51>   DW_AT_decl_file   : 13
    <c52>   DW_AT_decl_line   : 61
    <c53>   DW_AT_decl_column : 12
    <c54>   DW_AT_type        : <0x2fb>
    <c58>   DW_AT_data_member_location: 16
 <2><c59>: Abbrev Number: 14 (DW_TAG_member)
    <c5a>   DW_AT_name        : (indirect string, offset: 0x8e961): AutoReloadPreload
    <c5e>   DW_AT_decl_file   : 13
    <c5f>   DW_AT_decl_line   : 72
    <c60>   DW_AT_decl_column : 12
    <c61>   DW_AT_type        : <0x2fb>
    <c65>   DW_AT_data_member_location: 20
 <2><c66>: Abbrev Number: 0
 <1><c67>: Abbrev Number: 6 (DW_TAG_typedef)
    <c68>   DW_AT_name        : (indirect string, offset: 0x8e2e4): TIM_Base_InitTypeDef
    <c6c>   DW_AT_decl_file   : 13
    <c6d>   DW_AT_decl_line   : 74
    <c6e>   DW_AT_decl_column : 3
    <c6f>   DW_AT_type        : <0xc0f>
 <1><c73>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c74>   DW_AT_byte_size   : 16
    <c75>   DW_AT_decl_file   : 13
    <c76>   DW_AT_decl_line   : 198
    <c77>   DW_AT_decl_column : 9
    <c78>   DW_AT_sibling     : <0xcb1>
 <2><c7c>: Abbrev Number: 14 (DW_TAG_member)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x8a396): ClockSource
    <c81>   DW_AT_decl_file   : 13
    <c82>   DW_AT_decl_line   : 200
    <c83>   DW_AT_decl_column : 12
    <c84>   DW_AT_type        : <0x2fb>
    <c88>   DW_AT_data_member_location: 0
 <2><c89>: Abbrev Number: 14 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x8c4f5): ClockPolarity
    <c8e>   DW_AT_decl_file   : 13
    <c8f>   DW_AT_decl_line   : 202
    <c90>   DW_AT_decl_column : 12
    <c91>   DW_AT_type        : <0x2fb>
    <c95>   DW_AT_data_member_location: 4
 <2><c96>: Abbrev Number: 14 (DW_TAG_member)
    <c97>   DW_AT_name        : (indirect string, offset: 0x8e19a): ClockPrescaler
    <c9b>   DW_AT_decl_file   : 13
    <c9c>   DW_AT_decl_line   : 204
    <c9d>   DW_AT_decl_column : 12
    <c9e>   DW_AT_type        : <0x2fb>
    <ca2>   DW_AT_data_member_location: 8
 <2><ca3>: Abbrev Number: 14 (DW_TAG_member)
    <ca4>   DW_AT_name        : (indirect string, offset: 0x8cf1e): ClockFilter
    <ca8>   DW_AT_decl_file   : 13
    <ca9>   DW_AT_decl_line   : 206
    <caa>   DW_AT_decl_column : 12
    <cab>   DW_AT_type        : <0x2fb>
    <caf>   DW_AT_data_member_location: 12
 <2><cb0>: Abbrev Number: 0
 <1><cb1>: Abbrev Number: 6 (DW_TAG_typedef)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x89aa7): TIM_ClockConfigTypeDef
    <cb6>   DW_AT_decl_file   : 13
    <cb7>   DW_AT_decl_line   : 208
    <cb8>   DW_AT_decl_column : 3
    <cb9>   DW_AT_type        : <0xc73>
 <1><cbd>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cbe>   DW_AT_byte_size   : 8
    <cbf>   DW_AT_decl_file   : 13
    <cc0>   DW_AT_decl_line   : 231
    <cc1>   DW_AT_decl_column : 9
    <cc2>   DW_AT_sibling     : <0xce1>
 <2><cc6>: Abbrev Number: 14 (DW_TAG_member)
    <cc7>   DW_AT_name        : (indirect string, offset: 0x8c7d4): MasterOutputTrigger
    <ccb>   DW_AT_decl_file   : 13
    <ccc>   DW_AT_decl_line   : 233
    <ccd>   DW_AT_decl_column : 13
    <cce>   DW_AT_type        : <0x2fb>
    <cd2>   DW_AT_data_member_location: 0
 <2><cd3>: Abbrev Number: 14 (DW_TAG_member)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x8c2b6): MasterSlaveMode
    <cd8>   DW_AT_decl_file   : 13
    <cd9>   DW_AT_decl_line   : 235
    <cda>   DW_AT_decl_column : 13
    <cdb>   DW_AT_type        : <0x2fb>
    <cdf>   DW_AT_data_member_location: 4
 <2><ce0>: Abbrev Number: 0
 <1><ce1>: Abbrev Number: 6 (DW_TAG_typedef)
    <ce2>   DW_AT_name        : (indirect string, offset: 0x8d5f4): TIM_MasterConfigTypeDef
    <ce6>   DW_AT_decl_file   : 13
    <ce7>   DW_AT_decl_line   : 242
    <ce8>   DW_AT_decl_column : 3
    <ce9>   DW_AT_type        : <0xcbd>
 <1><ced>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <cee>   DW_AT_encoding    : 7	(unsigned)
    <cef>   DW_AT_byte_size   : 1
    <cf0>   DW_AT_type        : <0x27d>
    <cf4>   DW_AT_decl_file   : 13
    <cf5>   DW_AT_decl_line   : 291
    <cf7>   DW_AT_decl_column : 1
    <cf8>   DW_AT_sibling     : <0xd1b>
 <2><cfc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x8e06c): HAL_TIM_STATE_RESET
    <d01>   DW_AT_const_value : 0
 <2><d02>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d03>   DW_AT_name        : (indirect string, offset: 0x89aca): HAL_TIM_STATE_READY
    <d07>   DW_AT_const_value : 1
 <2><d08>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d09>   DW_AT_name        : (indirect string, offset: 0x8ae61): HAL_TIM_STATE_BUSY
    <d0d>   DW_AT_const_value : 2
 <2><d0e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x8dd71): HAL_TIM_STATE_TIMEOUT
    <d13>   DW_AT_const_value : 3
 <2><d14>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d15>   DW_AT_name        : (indirect string, offset: 0x8b4a9): HAL_TIM_STATE_ERROR
    <d19>   DW_AT_const_value : 4
 <2><d1a>: Abbrev Number: 0
 <1><d1b>: Abbrev Number: 18 (DW_TAG_typedef)
    <d1c>   DW_AT_name        : (indirect string, offset: 0x8d618): HAL_TIM_StateTypeDef
    <d20>   DW_AT_decl_file   : 13
    <d21>   DW_AT_decl_line   : 297
    <d23>   DW_AT_decl_column : 3
    <d24>   DW_AT_type        : <0xced>
 <1><d28>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <d29>   DW_AT_type        : <0xd1b>
 <1><d2d>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <d2e>   DW_AT_encoding    : 7	(unsigned)
    <d2f>   DW_AT_byte_size   : 1
    <d30>   DW_AT_type        : <0x27d>
    <d34>   DW_AT_decl_file   : 13
    <d35>   DW_AT_decl_line   : 303
    <d37>   DW_AT_decl_column : 1
    <d38>   DW_AT_sibling     : <0xd4f>
 <2><d3c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d3d>   DW_AT_name        : (indirect string, offset: 0x8d53b): HAL_TIM_CHANNEL_STATE_RESET
    <d41>   DW_AT_const_value : 0
 <2><d42>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d43>   DW_AT_name        : (indirect string, offset: 0x8d87e): HAL_TIM_CHANNEL_STATE_READY
    <d47>   DW_AT_const_value : 1
 <2><d48>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d49>   DW_AT_name        : (indirect string, offset: 0x8ec47): HAL_TIM_CHANNEL_STATE_BUSY
    <d4d>   DW_AT_const_value : 2
 <2><d4e>: Abbrev Number: 0
 <1><d4f>: Abbrev Number: 18 (DW_TAG_typedef)
    <d50>   DW_AT_name        : (indirect string, offset: 0x8ab5d): HAL_TIM_ChannelStateTypeDef
    <d54>   DW_AT_decl_file   : 13
    <d55>   DW_AT_decl_line   : 307
    <d57>   DW_AT_decl_column : 3
    <d58>   DW_AT_type        : <0xd2d>
 <1><d5c>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <d5d>   DW_AT_type        : <0xd4f>
 <1><d61>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <d62>   DW_AT_encoding    : 7	(unsigned)
    <d63>   DW_AT_byte_size   : 1
    <d64>   DW_AT_type        : <0x27d>
    <d68>   DW_AT_decl_file   : 13
    <d69>   DW_AT_decl_line   : 313
    <d6b>   DW_AT_decl_column : 1
    <d6c>   DW_AT_sibling     : <0xd83>
 <2><d70>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d71>   DW_AT_name        : (indirect string, offset: 0x899f2): HAL_DMA_BURST_STATE_RESET
    <d75>   DW_AT_const_value : 0
 <2><d76>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d77>   DW_AT_name        : (indirect string, offset: 0x8c4a4): HAL_DMA_BURST_STATE_READY
    <d7b>   DW_AT_const_value : 1
 <2><d7c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d7d>   DW_AT_name        : (indirect string, offset: 0x8b379): HAL_DMA_BURST_STATE_BUSY
    <d81>   DW_AT_const_value : 2
 <2><d82>: Abbrev Number: 0
 <1><d83>: Abbrev Number: 18 (DW_TAG_typedef)
    <d84>   DW_AT_name        : (indirect string, offset: 0x8a24c): HAL_TIM_DMABurstStateTypeDef
    <d88>   DW_AT_decl_file   : 13
    <d89>   DW_AT_decl_line   : 317
    <d8b>   DW_AT_decl_column : 3
    <d8c>   DW_AT_type        : <0xd61>
 <1><d90>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <d91>   DW_AT_type        : <0xd83>
 <1><d95>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <d96>   DW_AT_encoding    : 7	(unsigned)
    <d97>   DW_AT_byte_size   : 1
    <d98>   DW_AT_type        : <0x27d>
    <d9c>   DW_AT_decl_file   : 13
    <d9d>   DW_AT_decl_line   : 323
    <d9f>   DW_AT_decl_column : 1
    <da0>   DW_AT_sibling     : <0xdc3>
 <2><da4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <da5>   DW_AT_name        : (indirect string, offset: 0x8c55e): HAL_TIM_ACTIVE_CHANNEL_1
    <da9>   DW_AT_const_value : 1
 <2><daa>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dab>   DW_AT_name        : (indirect string, offset: 0x8c577): HAL_TIM_ACTIVE_CHANNEL_2
    <daf>   DW_AT_const_value : 2
 <2><db0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <db1>   DW_AT_name        : (indirect string, offset: 0x8c590): HAL_TIM_ACTIVE_CHANNEL_3
    <db5>   DW_AT_const_value : 4
 <2><db6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <db7>   DW_AT_name        : (indirect string, offset: 0x8c5a9): HAL_TIM_ACTIVE_CHANNEL_4
    <dbb>   DW_AT_const_value : 8
 <2><dbc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x8b82d): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <dc1>   DW_AT_const_value : 0
 <2><dc2>: Abbrev Number: 0
 <1><dc3>: Abbrev Number: 18 (DW_TAG_typedef)
    <dc4>   DW_AT_name        : (indirect string, offset: 0x8c23d): HAL_TIM_ActiveChannel
    <dc8>   DW_AT_decl_file   : 13
    <dc9>   DW_AT_decl_line   : 329
    <dcb>   DW_AT_decl_column : 3
    <dcc>   DW_AT_type        : <0xd95>
 <1><dd0>: Abbrev Number: 15 (DW_TAG_structure_type)
    <dd1>   DW_AT_byte_size   : 72
    <dd2>   DW_AT_decl_file   : 13
    <dd3>   DW_AT_decl_line   : 337
    <dd5>   DW_AT_decl_column : 9
    <dd6>   DW_AT_sibling     : <0xe59>
 <2><dda>: Abbrev Number: 16 (DW_TAG_member)
    <ddb>   DW_AT_name        : (indirect string, offset: 0x8b725): Instance
    <ddf>   DW_AT_decl_file   : 13
    <de0>   DW_AT_decl_line   : 340
    <de2>   DW_AT_decl_column : 39
    <de3>   DW_AT_type        : <0xe59>
    <de7>   DW_AT_data_member_location: 0
 <2><de8>: Abbrev Number: 16 (DW_TAG_member)
    <de9>   DW_AT_name        : (indirect string, offset: 0x8a143): Init
    <ded>   DW_AT_decl_file   : 13
    <dee>   DW_AT_decl_line   : 341
    <df0>   DW_AT_decl_column : 38
    <df1>   DW_AT_type        : <0xc67>
    <df5>   DW_AT_data_member_location: 4
 <2><df6>: Abbrev Number: 16 (DW_TAG_member)
    <df7>   DW_AT_name        : (indirect string, offset: 0x8c24b): Channel
    <dfb>   DW_AT_decl_file   : 13
    <dfc>   DW_AT_decl_line   : 342
    <dfe>   DW_AT_decl_column : 38
    <dff>   DW_AT_type        : <0xdc3>
    <e03>   DW_AT_data_member_location: 28
 <2><e04>: Abbrev Number: 16 (DW_TAG_member)
    <e05>   DW_AT_name        : (indirect string, offset: 0x8c8c6): hdma
    <e09>   DW_AT_decl_file   : 13
    <e0a>   DW_AT_decl_line   : 343
    <e0c>   DW_AT_decl_column : 39
    <e0d>   DW_AT_type        : <0xe5f>
    <e11>   DW_AT_data_member_location: 32
 <2><e12>: Abbrev Number: 16 (DW_TAG_member)
    <e13>   DW_AT_name        : (indirect string, offset: 0x46229): Lock
    <e17>   DW_AT_decl_file   : 13
    <e18>   DW_AT_decl_line   : 345
    <e1a>   DW_AT_decl_column : 38
    <e1b>   DW_AT_type        : <0x874>
    <e1f>   DW_AT_data_member_location: 60
 <2><e20>: Abbrev Number: 16 (DW_TAG_member)
    <e21>   DW_AT_name        : (indirect string, offset: 0x8d200): State
    <e25>   DW_AT_decl_file   : 13
    <e26>   DW_AT_decl_line   : 346
    <e28>   DW_AT_decl_column : 38
    <e29>   DW_AT_type        : <0xd28>
    <e2d>   DW_AT_data_member_location: 61
 <2><e2e>: Abbrev Number: 16 (DW_TAG_member)
    <e2f>   DW_AT_name        : (indirect string, offset: 0x90ee8): ChannelState
    <e33>   DW_AT_decl_file   : 13
    <e34>   DW_AT_decl_line   : 347
    <e36>   DW_AT_decl_column : 38
    <e37>   DW_AT_type        : <0xe85>
    <e3b>   DW_AT_data_member_location: 62
 <2><e3c>: Abbrev Number: 16 (DW_TAG_member)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x91430): ChannelNState
    <e41>   DW_AT_decl_file   : 13
    <e42>   DW_AT_decl_line   : 348
    <e44>   DW_AT_decl_column : 38
    <e45>   DW_AT_type        : <0xe85>
    <e49>   DW_AT_data_member_location: 66
 <2><e4a>: Abbrev Number: 16 (DW_TAG_member)
    <e4b>   DW_AT_name        : (indirect string, offset: 0x90597): DMABurstState
    <e4f>   DW_AT_decl_file   : 13
    <e50>   DW_AT_decl_line   : 349
    <e52>   DW_AT_decl_column : 38
    <e53>   DW_AT_type        : <0xd90>
    <e57>   DW_AT_data_member_location: 70
 <2><e58>: Abbrev Number: 0
 <1><e59>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <e5a>   DW_AT_byte_size   : 4
    <e5b>   DW_AT_type        : <0x773>
 <1><e5f>: Abbrev Number: 10 (DW_TAG_array_type)
    <e60>   DW_AT_type        : <0xe6f>
    <e64>   DW_AT_sibling     : <0xe6f>
 <2><e68>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <e69>   DW_AT_type        : <0x2cd>
    <e6d>   DW_AT_upper_bound : 6
 <2><e6e>: Abbrev Number: 0
 <1><e6f>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <e70>   DW_AT_byte_size   : 4
    <e71>   DW_AT_type        : <0xc03>
 <1><e75>: Abbrev Number: 10 (DW_TAG_array_type)
    <e76>   DW_AT_type        : <0xd5c>
    <e7a>   DW_AT_sibling     : <0xe85>
 <2><e7e>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <e7f>   DW_AT_type        : <0x2cd>
    <e83>   DW_AT_upper_bound : 3
 <2><e84>: Abbrev Number: 0
 <1><e85>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <e86>   DW_AT_type        : <0xe75>
 <1><e8a>: Abbrev Number: 18 (DW_TAG_typedef)
    <e8b>   DW_AT_name        : (indirect string, offset: 0x8b3db): TIM_HandleTypeDef
    <e8f>   DW_AT_decl_file   : 13
    <e90>   DW_AT_decl_line   : 380
    <e92>   DW_AT_decl_column : 3
    <e93>   DW_AT_type        : <0xdd0>
 <1><e97>: Abbrev Number: 12 (DW_TAG_structure_type)
    <e98>   DW_AT_byte_size   : 28
    <e99>   DW_AT_decl_file   : 14
    <e9a>   DW_AT_decl_line   : 46
    <e9b>   DW_AT_decl_column : 9
    <e9c>   DW_AT_sibling     : <0xefc>
 <2><ea0>: Abbrev Number: 14 (DW_TAG_member)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x8e8f3): BaudRate
    <ea5>   DW_AT_decl_file   : 14
    <ea6>   DW_AT_decl_line   : 48
    <ea7>   DW_AT_decl_column : 12
    <ea8>   DW_AT_type        : <0x2fb>
    <eac>   DW_AT_data_member_location: 0
 <2><ead>: Abbrev Number: 14 (DW_TAG_member)
    <eae>   DW_AT_name        : (indirect string, offset: 0x89a7e): WordLength
    <eb2>   DW_AT_decl_file   : 14
    <eb3>   DW_AT_decl_line   : 54
    <eb4>   DW_AT_decl_column : 12
    <eb5>   DW_AT_type        : <0x2fb>
    <eb9>   DW_AT_data_member_location: 4
 <2><eba>: Abbrev Number: 14 (DW_TAG_member)
    <ebb>   DW_AT_name        : (indirect string, offset: 0x8e8fc): StopBits
    <ebf>   DW_AT_decl_file   : 14
    <ec0>   DW_AT_decl_line   : 57
    <ec1>   DW_AT_decl_column : 12
    <ec2>   DW_AT_type        : <0x2fb>
    <ec6>   DW_AT_data_member_location: 8
 <2><ec7>: Abbrev Number: 14 (DW_TAG_member)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x8b481): Parity
    <ecc>   DW_AT_decl_file   : 14
    <ecd>   DW_AT_decl_line   : 60
    <ece>   DW_AT_decl_column : 12
    <ecf>   DW_AT_type        : <0x2fb>
    <ed3>   DW_AT_data_member_location: 12
 <2><ed4>: Abbrev Number: 14 (DW_TAG_member)
    <ed5>   DW_AT_name        : (indirect string, offset: 0x904a4): Mode
    <ed9>   DW_AT_decl_file   : 14
    <eda>   DW_AT_decl_line   : 67
    <edb>   DW_AT_decl_column : 12
    <edc>   DW_AT_type        : <0x2fb>
    <ee0>   DW_AT_data_member_location: 16
 <2><ee1>: Abbrev Number: 14 (DW_TAG_member)
    <ee2>   DW_AT_name        : (indirect string, offset: 0x8a148): HwFlowCtl
    <ee6>   DW_AT_decl_file   : 14
    <ee7>   DW_AT_decl_line   : 70
    <ee8>   DW_AT_decl_column : 12
    <ee9>   DW_AT_type        : <0x2fb>
    <eed>   DW_AT_data_member_location: 20
 <2><eee>: Abbrev Number: 14 (DW_TAG_member)
    <eef>   DW_AT_name        : (indirect string, offset: 0x8dd87): OverSampling
    <ef3>   DW_AT_decl_file   : 14
    <ef4>   DW_AT_decl_line   : 73
    <ef5>   DW_AT_decl_column : 12
    <ef6>   DW_AT_type        : <0x2fb>
    <efa>   DW_AT_data_member_location: 24
 <2><efb>: Abbrev Number: 0
 <1><efc>: Abbrev Number: 6 (DW_TAG_typedef)
    <efd>   DW_AT_name        : (indirect string, offset: 0x8b059): UART_InitTypeDef
    <f01>   DW_AT_decl_file   : 14
    <f02>   DW_AT_decl_line   : 75
    <f03>   DW_AT_decl_column : 3
    <f04>   DW_AT_type        : <0xe97>
 <1><f08>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <f09>   DW_AT_encoding    : 7	(unsigned)
    <f0a>   DW_AT_byte_size   : 1
    <f0b>   DW_AT_type        : <0x27d>
    <f0f>   DW_AT_decl_file   : 14
    <f10>   DW_AT_decl_line   : 117
    <f11>   DW_AT_decl_column : 1
    <f12>   DW_AT_sibling     : <0xf47>
 <2><f16>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f17>   DW_AT_name        : (indirect string, offset: 0x8c7bf): HAL_UART_STATE_RESET
    <f1b>   DW_AT_const_value : 0
 <2><f1c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x8a114): HAL_UART_STATE_READY
    <f21>   DW_AT_const_value : 32
 <2><f22>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f23>   DW_AT_name        : (indirect string, offset: 0x8e1f1): HAL_UART_STATE_BUSY
    <f27>   DW_AT_const_value : 36
 <2><f28>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f29>   DW_AT_name        : (indirect string, offset: 0x898fc): HAL_UART_STATE_BUSY_TX
    <f2d>   DW_AT_const_value : 33
 <2><f2e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f2f>   DW_AT_name        : (indirect string, offset: 0x898c7): HAL_UART_STATE_BUSY_RX
    <f33>   DW_AT_const_value : 34
 <2><f34>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f35>   DW_AT_name        : (indirect string, offset: 0x8ac68): HAL_UART_STATE_BUSY_TX_RX
    <f39>   DW_AT_const_value : 35
 <2><f3a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f3b>   DW_AT_name        : (indirect string, offset: 0x8bdfa): HAL_UART_STATE_TIMEOUT
    <f3f>   DW_AT_const_value : 160
 <2><f40>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f41>   DW_AT_name        : (indirect string, offset: 0x8d4a3): HAL_UART_STATE_ERROR
    <f45>   DW_AT_const_value : 224
 <2><f46>: Abbrev Number: 0
 <1><f47>: Abbrev Number: 6 (DW_TAG_typedef)
    <f48>   DW_AT_name        : (indirect string, offset: 0x8b1c4): HAL_UART_StateTypeDef
    <f4c>   DW_AT_decl_file   : 14
    <f4d>   DW_AT_decl_line   : 135
    <f4e>   DW_AT_decl_column : 3
    <f4f>   DW_AT_type        : <0xf08>
 <1><f53>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <f54>   DW_AT_type        : <0xf47>
 <1><f58>: Abbrev Number: 6 (DW_TAG_typedef)
    <f59>   DW_AT_name        : (indirect string, offset: 0x8b7f9): HAL_UART_RxTypeTypeDef
    <f5d>   DW_AT_decl_file   : 14
    <f5e>   DW_AT_decl_line   : 144
    <f5f>   DW_AT_decl_column : 18
    <f60>   DW_AT_type        : <0x2fb>
 <1><f64>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <f65>   DW_AT_type        : <0xf58>
 <1><f69>: Abbrev Number: 20 (DW_TAG_structure_type)
    <f6a>   DW_AT_name        : (indirect string, offset: 0x8c743): __UART_HandleTypeDef
    <f6e>   DW_AT_byte_size   : 68
    <f6f>   DW_AT_decl_file   : 14
    <f70>   DW_AT_decl_line   : 149
    <f71>   DW_AT_decl_column : 16
    <f72>   DW_AT_sibling     : <0x103a>
 <2><f76>: Abbrev Number: 14 (DW_TAG_member)
    <f77>   DW_AT_name        : (indirect string, offset: 0x8b725): Instance
    <f7b>   DW_AT_decl_file   : 14
    <f7c>   DW_AT_decl_line   : 151
    <f7d>   DW_AT_decl_column : 34
    <f7e>   DW_AT_type        : <0x103a>
    <f82>   DW_AT_data_member_location: 0
 <2><f83>: Abbrev Number: 14 (DW_TAG_member)
    <f84>   DW_AT_name        : (indirect string, offset: 0x8a143): Init
    <f88>   DW_AT_decl_file   : 14
    <f89>   DW_AT_decl_line   : 153
    <f8a>   DW_AT_decl_column : 33
    <f8b>   DW_AT_type        : <0xefc>
    <f8f>   DW_AT_data_member_location: 4
 <2><f90>: Abbrev Number: 14 (DW_TAG_member)
    <f91>   DW_AT_name        : (indirect string, offset: 0x8bdcc): pTxBuffPtr
    <f95>   DW_AT_decl_file   : 14
    <f96>   DW_AT_decl_line   : 155
    <f97>   DW_AT_decl_column : 34
    <f98>   DW_AT_type        : <0x1040>
    <f9c>   DW_AT_data_member_location: 32
 <2><f9d>: Abbrev Number: 14 (DW_TAG_member)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x89a89): TxXferSize
    <fa2>   DW_AT_decl_file   : 14
    <fa3>   DW_AT_decl_line   : 157
    <fa4>   DW_AT_decl_column : 33
    <fa5>   DW_AT_type        : <0x2ea>
    <fa9>   DW_AT_data_member_location: 36
 <2><faa>: Abbrev Number: 14 (DW_TAG_member)
    <fab>   DW_AT_name        : (indirect string, offset: 0x8bdee): TxXferCount
    <faf>   DW_AT_decl_file   : 14
    <fb0>   DW_AT_decl_line   : 159
    <fb1>   DW_AT_decl_column : 33
    <fb2>   DW_AT_type        : <0x2f6>
    <fb6>   DW_AT_data_member_location: 38
 <2><fb7>: Abbrev Number: 14 (DW_TAG_member)
    <fb8>   DW_AT_name        : (indirect string, offset: 0x8e9ce): pRxBuffPtr
    <fbc>   DW_AT_decl_file   : 14
    <fbd>   DW_AT_decl_line   : 161
    <fbe>   DW_AT_decl_column : 34
    <fbf>   DW_AT_type        : <0x1046>
    <fc3>   DW_AT_data_member_location: 40
 <2><fc4>: Abbrev Number: 14 (DW_TAG_member)
    <fc5>   DW_AT_name        : (indirect string, offset: 0x8c02b): RxXferSize
    <fc9>   DW_AT_decl_file   : 14
    <fca>   DW_AT_decl_line   : 163
    <fcb>   DW_AT_decl_column : 33
    <fcc>   DW_AT_type        : <0x2ea>
    <fd0>   DW_AT_data_member_location: 44
 <2><fd1>: Abbrev Number: 14 (DW_TAG_member)
    <fd2>   DW_AT_name        : (indirect string, offset: 0x8c8cb): RxXferCount
    <fd6>   DW_AT_decl_file   : 14
    <fd7>   DW_AT_decl_line   : 165
    <fd8>   DW_AT_decl_column : 33
    <fd9>   DW_AT_type        : <0x2f6>
    <fdd>   DW_AT_data_member_location: 46
 <2><fde>: Abbrev Number: 14 (DW_TAG_member)
    <fdf>   DW_AT_name        : (indirect string, offset: 0x8dd4a): ReceptionType
    <fe3>   DW_AT_decl_file   : 14
    <fe4>   DW_AT_decl_line   : 167
    <fe5>   DW_AT_decl_column : 31
    <fe6>   DW_AT_type        : <0xf64>
    <fea>   DW_AT_data_member_location: 48
 <2><feb>: Abbrev Number: 14 (DW_TAG_member)
    <fec>   DW_AT_name        : (indirect string, offset: 0x8ed94): hdmatx
    <ff0>   DW_AT_decl_file   : 14
    <ff1>   DW_AT_decl_line   : 169
    <ff2>   DW_AT_decl_column : 34
    <ff3>   DW_AT_type        : <0xe6f>
    <ff7>   DW_AT_data_member_location: 52
 <2><ff8>: Abbrev Number: 14 (DW_TAG_member)
    <ff9>   DW_AT_name        : (indirect string, offset: 0x8ed53): hdmarx
    <ffd>   DW_AT_decl_file   : 14
    <ffe>   DW_AT_decl_line   : 171
    <fff>   DW_AT_decl_column : 34
    <1000>   DW_AT_type        : <0xe6f>
    <1004>   DW_AT_data_member_location: 56
 <2><1005>: Abbrev Number: 14 (DW_TAG_member)
    <1006>   DW_AT_name        : (indirect string, offset: 0x46229): Lock
    <100a>   DW_AT_decl_file   : 14
    <100b>   DW_AT_decl_line   : 173
    <100c>   DW_AT_decl_column : 33
    <100d>   DW_AT_type        : <0x874>
    <1011>   DW_AT_data_member_location: 60
 <2><1012>: Abbrev Number: 14 (DW_TAG_member)
    <1013>   DW_AT_name        : (indirect string, offset: 0x8b7c4): gState
    <1017>   DW_AT_decl_file   : 14
    <1018>   DW_AT_decl_line   : 175
    <1019>   DW_AT_decl_column : 33
    <101a>   DW_AT_type        : <0xf53>
    <101e>   DW_AT_data_member_location: 61
 <2><101f>: Abbrev Number: 14 (DW_TAG_member)
    <1020>   DW_AT_name        : (indirect string, offset: 0x8e33f): RxState
    <1024>   DW_AT_decl_file   : 14
    <1025>   DW_AT_decl_line   : 179
    <1026>   DW_AT_decl_column : 33
    <1027>   DW_AT_type        : <0xf53>
    <102b>   DW_AT_data_member_location: 62
 <2><102c>: Abbrev Number: 14 (DW_TAG_member)
    <102d>   DW_AT_name        : (indirect string, offset: 0x8edd5): ErrorCode
    <1031>   DW_AT_decl_file   : 14
    <1032>   DW_AT_decl_line   : 182
    <1033>   DW_AT_decl_column : 33
    <1034>   DW_AT_type        : <0x307>
    <1038>   DW_AT_data_member_location: 64
 <2><1039>: Abbrev Number: 0
 <1><103a>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <103b>   DW_AT_byte_size   : 4
    <103c>   DW_AT_type        : <0x7eb>
 <1><1040>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1041>   DW_AT_byte_size   : 4
    <1042>   DW_AT_type        : <0x2e5>
 <1><1046>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1047>   DW_AT_byte_size   : 4
    <1048>   DW_AT_type        : <0x2d4>
 <1><104c>: Abbrev Number: 6 (DW_TAG_typedef)
    <104d>   DW_AT_name        : (indirect string, offset: 0x8c745): UART_HandleTypeDef
    <1051>   DW_AT_decl_file   : 14
    <1052>   DW_AT_decl_line   : 200
    <1053>   DW_AT_decl_column : 3
    <1054>   DW_AT_type        : <0xf69>
 <1><1058>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1059>   DW_AT_byte_size   : 4
    <105a>   DW_AT_type        : <0x105e>
 <1><105e>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <105f>   DW_AT_prototyped  : 1
    <105f>   DW_AT_sibling     : <0x1069>
 <2><1063>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <1064>   DW_AT_type        : <0xbea>
 <2><1068>: Abbrev Number: 0
 <1><1069>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <106a>   DW_AT_byte_size   : 4
    <106b>   DW_AT_type        : <0x1076>
 <1><106f>: Abbrev Number: 5 (DW_TAG_base_type)
    <1070>   DW_AT_byte_size   : 1
    <1071>   DW_AT_encoding    : 8	(unsigned char)
    <1072>   DW_AT_name        : (indirect string, offset: 0x3a5d2): char
 <1><1076>: Abbrev Number: 9 (DW_TAG_const_type)
    <1077>   DW_AT_type        : <0x106f>
 <1><107b>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <107c>   DW_AT_encoding    : 5	(signed)
    <107d>   DW_AT_byte_size   : 4
    <107e>   DW_AT_type        : <0x2c6>
    <1082>   DW_AT_decl_file   : 15
    <1083>   DW_AT_decl_line   : 82
    <1084>   DW_AT_decl_column : 14
    <1085>   DW_AT_sibling     : <0x11cb>
 <2><1089>: Abbrev Number: 4 (DW_TAG_enumerator)
    <108a>   DW_AT_name        : (indirect string, offset: 0x89db6): osPriorityNone
    <108e>   DW_AT_const_value : 0
 <2><108f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1090>   DW_AT_name        : (indirect string, offset: 0x8e031): osPriorityIdle
    <1094>   DW_AT_const_value : 1
 <2><1095>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1096>   DW_AT_name        : (indirect string, offset: 0x8e946): osPriorityLow
    <109a>   DW_AT_const_value : 8
 <2><109b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <109c>   DW_AT_name        : (indirect string, offset: 0x8ec0b): osPriorityLow1
    <10a0>   DW_AT_const_value : 9
 <2><10a1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10a2>   DW_AT_name        : (indirect string, offset: 0x8ec1a): osPriorityLow2
    <10a6>   DW_AT_const_value : 10
 <2><10a7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10a8>   DW_AT_name        : (indirect string, offset: 0x8b54d): osPriorityLow3
    <10ac>   DW_AT_const_value : 11
 <2><10ad>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x8ec29): osPriorityLow4
    <10b2>   DW_AT_const_value : 12
 <2><10b3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10b4>   DW_AT_name        : (indirect string, offset: 0x8b55c): osPriorityLow5
    <10b8>   DW_AT_const_value : 13
 <2><10b9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10ba>   DW_AT_name        : (indirect string, offset: 0x8ec38): osPriorityLow6
    <10be>   DW_AT_const_value : 14
 <2><10bf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10c0>   DW_AT_name        : (indirect string, offset: 0x8dab3): osPriorityLow7
    <10c4>   DW_AT_const_value : 15
 <2><10c5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10c6>   DW_AT_name        : (indirect string, offset: 0x8ed26): osPriorityBelowNormal
    <10ca>   DW_AT_const_value : 16
 <2><10cb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10cc>   DW_AT_name        : (indirect string, offset: 0x8d832): osPriorityBelowNormal1
    <10d0>   DW_AT_const_value : 17
 <2><10d1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10d2>   DW_AT_name        : (indirect string, offset: 0x8dde8): osPriorityBelowNormal2
    <10d6>   DW_AT_const_value : 18
 <2><10d7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10d8>   DW_AT_name        : (indirect string, offset: 0x8d849): osPriorityBelowNormal3
    <10dc>   DW_AT_const_value : 19
 <2><10dd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10de>   DW_AT_name        : (indirect string, offset: 0x8ddff): osPriorityBelowNormal4
    <10e2>   DW_AT_const_value : 20
 <2><10e3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10e4>   DW_AT_name        : (indirect string, offset: 0x8de16): osPriorityBelowNormal5
    <10e8>   DW_AT_const_value : 21
 <2><10e9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10ea>   DW_AT_name        : (indirect string, offset: 0x8de2d): osPriorityBelowNormal6
    <10ee>   DW_AT_const_value : 22
 <2><10ef>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10f0>   DW_AT_name        : (indirect string, offset: 0x8de44): osPriorityBelowNormal7
    <10f4>   DW_AT_const_value : 23
 <2><10f5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10f6>   DW_AT_name        : (indirect string, offset: 0x8a228): osPriorityNormal
    <10fa>   DW_AT_const_value : 24
 <2><10fb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10fc>   DW_AT_name        : (indirect string, offset: 0x8a5be): osPriorityNormal1
    <1100>   DW_AT_const_value : 25
 <2><1101>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1102>   DW_AT_name        : (indirect string, offset: 0x8a5d0): osPriorityNormal2
    <1106>   DW_AT_const_value : 26
 <2><1107>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1108>   DW_AT_name        : (indirect string, offset: 0x8a5e2): osPriorityNormal3
    <110c>   DW_AT_const_value : 27
 <2><110d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <110e>   DW_AT_name        : (indirect string, offset: 0x8a5f4): osPriorityNormal4
    <1112>   DW_AT_const_value : 28
 <2><1113>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1114>   DW_AT_name        : (indirect string, offset: 0x8a606): osPriorityNormal5
    <1118>   DW_AT_const_value : 29
 <2><1119>: Abbrev Number: 4 (DW_TAG_enumerator)
    <111a>   DW_AT_name        : (indirect string, offset: 0x8a618): osPriorityNormal6
    <111e>   DW_AT_const_value : 30
 <2><111f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1120>   DW_AT_name        : (indirect string, offset: 0x8a62a): osPriorityNormal7
    <1124>   DW_AT_const_value : 31
 <2><1125>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1126>   DW_AT_name        : (indirect string, offset: 0x8cecf): osPriorityAboveNormal
    <112a>   DW_AT_const_value : 32
 <2><112b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <112c>   DW_AT_name        : (indirect string, offset: 0x8dc42): osPriorityAboveNormal1
    <1130>   DW_AT_const_value : 33
 <2><1131>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1132>   DW_AT_name        : (indirect string, offset: 0x8efa6): osPriorityAboveNormal2
    <1136>   DW_AT_const_value : 34
 <2><1137>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1138>   DW_AT_name        : (indirect string, offset: 0x8e1ca): osPriorityAboveNormal3
    <113c>   DW_AT_const_value : 35
 <2><113d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <113e>   DW_AT_name        : (indirect string, offset: 0x8efbd): osPriorityAboveNormal4
    <1142>   DW_AT_const_value : 36
 <2><1143>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1144>   DW_AT_name        : (indirect string, offset: 0x8efd4): osPriorityAboveNormal5
    <1148>   DW_AT_const_value : 37
 <2><1149>: Abbrev Number: 4 (DW_TAG_enumerator)
    <114a>   DW_AT_name        : (indirect string, offset: 0x8efeb): osPriorityAboveNormal6
    <114e>   DW_AT_const_value : 38
 <2><114f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1150>   DW_AT_name        : (indirect string, offset: 0x8f002): osPriorityAboveNormal7
    <1154>   DW_AT_const_value : 39
 <2><1155>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1156>   DW_AT_name        : (indirect string, offset: 0x8b446): osPriorityHigh
    <115a>   DW_AT_const_value : 40
 <2><115b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <115c>   DW_AT_name        : (indirect string, offset: 0x8d09f): osPriorityHigh1
    <1160>   DW_AT_const_value : 41
 <2><1161>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1162>   DW_AT_name        : (indirect string, offset: 0x8d0af): osPriorityHigh2
    <1166>   DW_AT_const_value : 42
 <2><1167>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1168>   DW_AT_name        : (indirect string, offset: 0x8d0bf): osPriorityHigh3
    <116c>   DW_AT_const_value : 43
 <2><116d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <116e>   DW_AT_name        : (indirect string, offset: 0x8d0cf): osPriorityHigh4
    <1172>   DW_AT_const_value : 44
 <2><1173>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1174>   DW_AT_name        : (indirect string, offset: 0x899e2): osPriorityHigh5
    <1178>   DW_AT_const_value : 45
 <2><1179>: Abbrev Number: 4 (DW_TAG_enumerator)
    <117a>   DW_AT_name        : (indirect string, offset: 0x8d0df): osPriorityHigh6
    <117e>   DW_AT_const_value : 46
 <2><117f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1180>   DW_AT_name        : (indirect string, offset: 0x8d0ef): osPriorityHigh7
    <1184>   DW_AT_const_value : 47
 <2><1185>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1186>   DW_AT_name        : (indirect string, offset: 0x8e722): osPriorityRealtime
    <118a>   DW_AT_const_value : 48
 <2><118b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <118c>   DW_AT_name        : (indirect string, offset: 0x8cb8c): osPriorityRealtime1
    <1190>   DW_AT_const_value : 49
 <2><1191>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1192>   DW_AT_name        : (indirect string, offset: 0x8cba0): osPriorityRealtime2
    <1196>   DW_AT_const_value : 50
 <2><1197>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1198>   DW_AT_name        : (indirect string, offset: 0x8cbb4): osPriorityRealtime3
    <119c>   DW_AT_const_value : 51
 <2><119d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <119e>   DW_AT_name        : (indirect string, offset: 0x8cbc8): osPriorityRealtime4
    <11a2>   DW_AT_const_value : 52
 <2><11a3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11a4>   DW_AT_name        : (indirect string, offset: 0x8cbdc): osPriorityRealtime5
    <11a8>   DW_AT_const_value : 53
 <2><11a9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11aa>   DW_AT_name        : (indirect string, offset: 0x8cbf0): osPriorityRealtime6
    <11ae>   DW_AT_const_value : 54
 <2><11af>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11b0>   DW_AT_name        : (indirect string, offset: 0x8cc04): osPriorityRealtime7
    <11b4>   DW_AT_const_value : 55
 <2><11b5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11b6>   DW_AT_name        : (indirect string, offset: 0x8c529): osPriorityISR
    <11ba>   DW_AT_const_value : 56
 <2><11bb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <11bc>   DW_AT_name        : (indirect string, offset: 0x8e1ba): osPriorityError
    <11c0>   DW_AT_const_value : -1
 <2><11c1>: Abbrev Number: 26 (DW_TAG_enumerator)
    <11c2>   DW_AT_name        : (indirect string, offset: 0x8ec71): osPriorityReserved
    <11c6>   DW_AT_const_value : 0x7fffffff
 <2><11ca>: Abbrev Number: 0
 <1><11cb>: Abbrev Number: 6 (DW_TAG_typedef)
    <11cc>   DW_AT_name        : (indirect string, offset: 0x8e9f4): osPriority_t
    <11d0>   DW_AT_decl_file   : 15
    <11d1>   DW_AT_decl_line   : 136
    <11d2>   DW_AT_decl_column : 3
    <11d3>   DW_AT_type        : <0x107b>
 <1><11d7>: Abbrev Number: 6 (DW_TAG_typedef)
    <11d8>   DW_AT_name        : (indirect string, offset: 0x8c3ce): osThreadFunc_t
    <11dc>   DW_AT_decl_file   : 15
    <11dd>   DW_AT_decl_line   : 139
    <11de>   DW_AT_decl_column : 16
    <11df>   DW_AT_type        : <0x1058>
 <1><11e3>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <11e4>   DW_AT_encoding    : 5	(signed)
    <11e5>   DW_AT_byte_size   : 4
    <11e6>   DW_AT_type        : <0x2c6>
    <11ea>   DW_AT_decl_file   : 15
    <11eb>   DW_AT_decl_line   : 176
    <11ec>   DW_AT_decl_column : 14
    <11ed>   DW_AT_sibling     : <0x1225>
 <2><11f1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11f2>   DW_AT_name        : (indirect string, offset: 0x8e1b5): osOK
    <11f6>   DW_AT_const_value : 0
 <2><11f7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <11f8>   DW_AT_name        : (indirect string, offset: 0x8bcd7): osError
    <11fc>   DW_AT_const_value : -1
 <2><11fd>: Abbrev Number: 3 (DW_TAG_enumerator)
    <11fe>   DW_AT_name        : (indirect string, offset: 0x8a2ab): osErrorTimeout
    <1202>   DW_AT_const_value : -2
 <2><1203>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1204>   DW_AT_name        : (indirect string, offset: 0x8cf69): osErrorResource
    <1208>   DW_AT_const_value : -3
 <2><1209>: Abbrev Number: 3 (DW_TAG_enumerator)
    <120a>   DW_AT_name        : (indirect string, offset: 0x8aeef): osErrorParameter
    <120e>   DW_AT_const_value : -4
 <2><120f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1210>   DW_AT_name        : (indirect string, offset: 0x8a6a2): osErrorNoMemory
    <1214>   DW_AT_const_value : -5
 <2><1215>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1216>   DW_AT_name        : (indirect string, offset: 0x8af8f): osErrorISR
    <121a>   DW_AT_const_value : -6
 <2><121b>: Abbrev Number: 26 (DW_TAG_enumerator)
    <121c>   DW_AT_name        : (indirect string, offset: 0x8c03f): osStatusReserved
    <1220>   DW_AT_const_value : 0x7fffffff
 <2><1224>: Abbrev Number: 0
 <1><1225>: Abbrev Number: 6 (DW_TAG_typedef)
    <1226>   DW_AT_name        : (indirect string, offset: 0x8b3c4): osStatus_t
    <122a>   DW_AT_decl_file   : 15
    <122b>   DW_AT_decl_line   : 185
    <122c>   DW_AT_decl_column : 3
    <122d>   DW_AT_type        : <0x11e3>
 <1><1231>: Abbrev Number: 6 (DW_TAG_typedef)
    <1232>   DW_AT_name        : (indirect string, offset: 0x8b439): osThreadId_t
    <1236>   DW_AT_decl_file   : 15
    <1237>   DW_AT_decl_line   : 189
    <1238>   DW_AT_decl_column : 15
    <1239>   DW_AT_type        : <0xbea>
 <1><123d>: Abbrev Number: 6 (DW_TAG_typedef)
    <123e>   DW_AT_name        : (indirect string, offset: 0x8d1a7): TZ_ModuleId_t
    <1242>   DW_AT_decl_file   : 15
    <1243>   DW_AT_decl_line   : 213
    <1244>   DW_AT_decl_column : 18
    <1245>   DW_AT_type        : <0x2fb>
 <1><1249>: Abbrev Number: 12 (DW_TAG_structure_type)
    <124a>   DW_AT_byte_size   : 36
    <124b>   DW_AT_decl_file   : 15
    <124c>   DW_AT_decl_line   : 218
    <124d>   DW_AT_decl_column : 9
    <124e>   DW_AT_sibling     : <0x12c8>
 <2><1252>: Abbrev Number: 14 (DW_TAG_member)
    <1253>   DW_AT_name        : (indirect string, offset: 0x8d174): name
    <1257>   DW_AT_decl_file   : 15
    <1258>   DW_AT_decl_line   : 219
    <1259>   DW_AT_decl_column : 33
    <125a>   DW_AT_type        : <0x1069>
    <125e>   DW_AT_data_member_location: 0
 <2><125f>: Abbrev Number: 14 (DW_TAG_member)
    <1260>   DW_AT_name        : (indirect string, offset: 0x8cf5f): attr_bits
    <1264>   DW_AT_decl_file   : 15
    <1265>   DW_AT_decl_line   : 220
    <1266>   DW_AT_decl_column : 28
    <1267>   DW_AT_type        : <0x2fb>
    <126b>   DW_AT_data_member_location: 4
 <2><126c>: Abbrev Number: 14 (DW_TAG_member)
    <126d>   DW_AT_name        : (indirect string, offset: 0x8a9d7): cb_mem
    <1271>   DW_AT_decl_file   : 15
    <1272>   DW_AT_decl_line   : 221
    <1273>   DW_AT_decl_column : 30
    <1274>   DW_AT_type        : <0xbea>
    <1278>   DW_AT_data_member_location: 8
 <2><1279>: Abbrev Number: 14 (DW_TAG_member)
    <127a>   DW_AT_name        : (indirect string, offset: 0x8c917): cb_size
    <127e>   DW_AT_decl_file   : 15
    <127f>   DW_AT_decl_line   : 222
    <1280>   DW_AT_decl_column : 30
    <1281>   DW_AT_type        : <0x2fb>
    <1285>   DW_AT_data_member_location: 12
 <2><1286>: Abbrev Number: 14 (DW_TAG_member)
    <1287>   DW_AT_name        : (indirect string, offset: 0x8e86d): stack_mem
    <128b>   DW_AT_decl_file   : 15
    <128c>   DW_AT_decl_line   : 223
    <128d>   DW_AT_decl_column : 27
    <128e>   DW_AT_type        : <0xbea>
    <1292>   DW_AT_data_member_location: 16
 <2><1293>: Abbrev Number: 14 (DW_TAG_member)
    <1294>   DW_AT_name        : (indirect string, offset: 0x8cc18): stack_size
    <1298>   DW_AT_decl_file   : 15
