Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xa2 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x689f2): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x25997): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x31267): C:/Users/Kamil/Documents/ST_Projects/NITI_TestTask/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x4a112): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x367c1): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8

    <244>   DW_AT_const_value : 71
 <2><245>: Abbrev Number: 4 (DW_TAG_enumerator)
    <246>   DW_AT_name        : (indirect string, offset: 0x8e202): I2C3_EV_IRQn
    <24a>   DW_AT_const_value : 72
 <2><24b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <24c>   DW_AT_name        : (indirect string, offset: 0x8a606): I2C3_ER_IRQn
    <250>   DW_AT_const_value : 73
 <2><251>: Abbrev Number: 4 (DW_TAG_enumerator)
    <252>   DW_AT_name        : (indirect string, offset: 0x89da2): FPU_IRQn
    <256>   DW_AT_const_value : 81
 <2><257>: Abbrev Number: 4 (DW_TAG_enumerator)
    <258>   DW_AT_name        : (indirect string, offset: 0x8b9bb): SPI4_IRQn
    <25c>   DW_AT_const_value : 84
 <2><25d>: Abbrev Number: 0
 <1><25e>: Abbrev Number: 5 (DW_TAG_base_type)
    <25f>   DW_AT_byte_size   : 1
    <260>   DW_AT_encoding    : 6	(signed char)
    <261>   DW_AT_name        : (indirect string, offset: 0x671a5): signed char
 <1><265>: Abbrev Number: 6 (DW_TAG_typedef)
    <266>   DW_AT_name        : (indirect string, offset: 0x8e02f): IRQn_Type
    <26a>   DW_AT_decl_file   : 3
    <26b>   DW_AT_decl_line   : 133
    <26c>   DW_AT_decl_column : 3
    <26d>   DW_AT_type        : <0xcf>
 <1><271>: Abbrev Number: 6 (DW_TAG_typedef)
    <272>   DW_AT_name        : (indirect string, offset: 0x8b09d): __uint8_t
    <276>   DW_AT_decl_file   : 4
    <277>   DW_AT_decl_line   : 43
    <278>   DW_AT_decl_column : 24
    <279>   DW_AT_type        : <0x27d>
 <1><27d>: Abbrev Number: 5 (DW_TAG_base_type)
    <27e>   DW_AT_byte_size   : 1
    <27f>   DW_AT_encoding    : 8	(unsigned char)
    <280>   DW_AT_name        : (indirect string, offset: 0x630da): unsigned char
 <1><284>: Abbrev Number: 5 (DW_TAG_base_type)
    <285>   DW_AT_byte_size   : 2
    <286>   DW_AT_encoding    : 5	(signed)
    <287>   DW_AT_name        : (indirect string, offset: 0x5288): short int
 <1><28b>: Abbrev Number: 6 (DW_TAG_typedef)
    <28c>   DW_AT_name        : (indirect string, offset: 0x8dbab): __uint16_t
    <290>   DW_AT_decl_file   : 4
    <291>   DW_AT_decl_line   : 57
    <292>   DW_AT_decl_column : 25
    <293>   DW_AT_type        : <0x297>
 <1><297>: Abbrev Number: 5 (DW_TAG_base_type)
    <298>   DW_AT_byte_size   : 2
    <299>   DW_AT_encoding    : 7	(unsigned)
    <29a>   DW_AT_name        : (indirect string, offset: 0x44a3d): short unsigned int
 <1><29e>: Abbrev Number: 5 (DW_TAG_base_type)
    <29f>   DW_AT_byte_size   : 4
    <2a0>   DW_AT_encoding    : 5	(signed)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x1b255): long int
 <1><2a5>: Abbrev Number: 6 (DW_TAG_typedef)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x8ce53): __uint32_t
    <2aa>   DW_AT_decl_file   : 4
    <2ab>   DW_AT_decl_line   : 79
    <2ac>   DW_AT_decl_column : 25
    <2ad>   DW_AT_type        : <0x2b1>
 <1><2b1>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b2>   DW_AT_byte_size   : 4
    <2b3>   DW_AT_encoding    : 7	(unsigned)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x50c3f): long unsigned int
 <1><2b8>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b9>   DW_AT_byte_size   : 8
    <2ba>   DW_AT_encoding    : 5	(signed)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x367c1): long long int
 <1><2bf>: Abbrev Number: 5 (DW_TAG_base_type)
    <2c0>   DW_AT_byte_size   : 8
    <2c1>   DW_AT_encoding    : 7	(unsigned)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x2e8a1): long long unsigned int
 <1><2c6>: Abbrev Number: 7 (DW_TAG_base_type)
    <2c7>   DW_AT_byte_size   : 4
    <2c8>   DW_AT_encoding    : 5	(signed)
    <2c9>   DW_AT_name        : int
 <1><2cd>: Abbrev Number: 5 (DW_TAG_base_type)
    <2ce>   DW_AT_byte_size   : 4
    <2cf>   DW_AT_encoding    : 7	(unsigned)
    <2d0>   DW_AT_name        : (indirect string, offset: 0x4a112): unsigned int
 <1><2d4>: Abbrev Number: 6 (DW_TAG_typedef)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x8b09f): uint8_t
    <2d9>   DW_AT_decl_file   : 5
    <2da>   DW_AT_decl_line   : 24
    <2db>   DW_AT_decl_column : 19
    <2dc>   DW_AT_type        : <0x271>
 <1><2e0>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <2e1>   DW_AT_type        : <0x2d4>
 <1><2e5>: Abbrev Number: 9 (DW_TAG_const_type)
    <2e6>   DW_AT_type        : <0x2d4>
 <1><2ea>: Abbrev Number: 6 (DW_TAG_typedef)
    <2eb>   DW_AT_name        : (indirect string, offset: 0x4ee99): uint16_t
    <2ef>   DW_AT_decl_file   : 5
    <2f0>   DW_AT_decl_line   : 36
    <2f1>   DW_AT_decl_column : 20
    <2f2>   DW_AT_type        : <0x28b>
 <1><2f6>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <2f7>   DW_AT_type        : <0x2ea>
 <1><2fb>: Abbrev Number: 6 (DW_TAG_typedef)
    <2fc>   DW_AT_name        : (indirect string, offset: 0x353ba): uint32_t
    <300>   DW_AT_decl_file   : 5
    <301>   DW_AT_decl_line   : 48
    <302>   DW_AT_decl_column : 20
    <303>   DW_AT_type        : <0x2a5>
 <1><307>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <308>   DW_AT_type        : <0x2fb>
 <1><30c>: Abbrev Number: 10 (DW_TAG_array_type)
    <30d>   DW_AT_type        : <0x2fb>
    <311>   DW_AT_sibling     : <0x31c>
 <2><315>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <316>   DW_AT_type        : <0x2cd>
    <31a>   DW_AT_upper_bound : 0
 <2><31b>: Abbrev Number: 0
 <1><31c>: Abbrev Number: 10 (DW_TAG_array_type)
    <31d>   DW_AT_type        : <0x2fb>
    <321>   DW_AT_sibling     : <0x32c>
 <2><325>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <326>   DW_AT_type        : <0x2cd>
    <32a>   DW_AT_upper_bound : 1
 <2><32b>: Abbrev Number: 0
 <1><32c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <32d>   DW_AT_byte_size   : 24
    <32e>   DW_AT_decl_file   : 3
    <32f>   DW_AT_decl_line   : 213
    <330>   DW_AT_decl_column : 9
    <331>   DW_AT_sibling     : <0x383>
 <2><335>: Abbrev Number: 13 (DW_TAG_member)
    <336>   DW_AT_name        : CR
    <339>   DW_AT_decl_file   : 3
    <33a>   DW_AT_decl_line   : 215
    <33b>   DW_AT_decl_column : 17
    <33c>   DW_AT_type        : <0x307>
    <340>   DW_AT_data_member_location: 0
 <2><341>: Abbrev Number: 14 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x8be36): NDTR
    <346>   DW_AT_decl_file   : 3
    <347>   DW_AT_decl_line   : 216
    <348>   DW_AT_decl_column : 17
    <349>   DW_AT_type        : <0x307>
    <34d>   DW_AT_data_member_location: 4
 <2><34e>: Abbrev Number: 13 (DW_TAG_member)
    <34f>   DW_AT_name        : PAR
    <353>   DW_AT_decl_file   : 3
    <354>   DW_AT_decl_line   : 217
    <355>   DW_AT_decl_column : 17
    <356>   DW_AT_type        : <0x307>
    <35a>   DW_AT_data_member_location: 8
 <2><35b>: Abbrev Number: 14 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0x8b834): M0AR
    <360>   DW_AT_decl_file   : 3
    <361>   DW_AT_decl_line   : 218
    <362>   DW_AT_decl_column : 17
    <363>   DW_AT_type        : <0x307>
    <367>   DW_AT_data_member_location: 12
 <2><368>: Abbrev Number: 14 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x89edf): M1AR
    <36d>   DW_AT_decl_file   : 3
    <36e>   DW_AT_decl_line   : 219
    <36f>   DW_AT_decl_column : 17
    <370>   DW_AT_type        : <0x307>
    <374>   DW_AT_data_member_location: 16
 <2><375>: Abbrev Number: 13 (DW_TAG_member)
    <376>   DW_AT_name        : FCR
    <37a>   DW_AT_decl_file   : 3
    <37b>   DW_AT_decl_line   : 220
    <37c>   DW_AT_decl_column : 17
    <37d>   DW_AT_type        : <0x307>
    <381>   DW_AT_data_member_location: 20
 <2><382>: Abbrev Number: 0
 <1><383>: Abbrev Number: 6 (DW_TAG_typedef)
    <384>   DW_AT_name        : (indirect string, offset: 0x8e71b): DMA_Stream_TypeDef
    <388>   DW_AT_decl_file   : 3
    <389>   DW_AT_decl_line   : 221
    <38a>   DW_AT_decl_column : 3
    <38b>   DW_AT_type        : <0x32c>
 <1><38f>: Abbrev Number: 15 (DW_TAG_structure_type)
    <390>   DW_AT_byte_size   : 40
    <391>   DW_AT_decl_file   : 3
    <392>   DW_AT_decl_line   : 264
    <394>   DW_AT_decl_column : 9
    <395>   DW_AT_sibling     : <0x418>
 <2><399>: Abbrev Number: 16 (DW_TAG_member)
    <39a>   DW_AT_name        : (indirect string, offset: 0x89888): MODER
    <39e>   DW_AT_decl_file   : 3
    <39f>   DW_AT_decl_line   : 266
    <3a1>   DW_AT_decl_column : 17
    <3a2>   DW_AT_type        : <0x307>
    <3a6>   DW_AT_data_member_location: 0
 <2><3a7>: Abbrev Number: 16 (DW_TAG_member)
    <3a8>   DW_AT_name        : (indirect string, offset: 0x8d87d): OTYPER
    <3ac>   DW_AT_decl_file   : 3
    <3ad>   DW_AT_decl_line   : 267
    <3af>   DW_AT_decl_column : 17
    <3b0>   DW_AT_type        : <0x307>
    <3b4>   DW_AT_data_member_location: 4
 <2><3b5>: Abbrev Number: 16 (DW_TAG_member)
    <3b6>   DW_AT_name        : (indirect string, offset: 0x8e008): OSPEEDR
    <3ba>   DW_AT_decl_file   : 3
    <3bb>   DW_AT_decl_line   : 268
    <3bd>   DW_AT_decl_column : 17
    <3be>   DW_AT_type        : <0x307>
    <3c2>   DW_AT_data_member_location: 8
 <2><3c3>: Abbrev Number: 16 (DW_TAG_member)
    <3c4>   DW_AT_name        : (indirect string, offset: 0x8a6f6): PUPDR
    <3c8>   DW_AT_decl_file   : 3
    <3c9>   DW_AT_decl_line   : 269
    <3cb>   DW_AT_decl_column : 17
    <3cc>   DW_AT_type        : <0x307>
    <3d0>   DW_AT_data_member_location: 12
 <2><3d1>: Abbrev Number: 17 (DW_TAG_member)
    <3d2>   DW_AT_name        : IDR
    <3d6>   DW_AT_decl_file   : 3
    <3d7>   DW_AT_decl_line   : 270
    <3d9>   DW_AT_decl_column : 17
    <3da>   DW_AT_type        : <0x307>
    <3de>   DW_AT_data_member_location: 16
 <2><3df>: Abbrev Number: 17 (DW_TAG_member)
    <3e0>   DW_AT_name        : ODR
    <3e4>   DW_AT_decl_file   : 3
    <3e5>   DW_AT_decl_line   : 271
    <3e7>   DW_AT_decl_column : 17
    <3e8>   DW_AT_type        : <0x307>
    <3ec>   DW_AT_data_member_location: 20
 <2><3ed>: Abbrev Number: 16 (DW_TAG_member)
    <3ee>   DW_AT_name        : (indirect string, offset: 0x8ac4d): BSRR
    <3f2>   DW_AT_decl_file   : 3
    <3f3>   DW_AT_decl_line   : 272
    <3f5>   DW_AT_decl_column : 17
    <3f6>   DW_AT_type        : <0x307>
    <3fa>   DW_AT_data_member_location: 24
 <2><3fb>: Abbrev Number: 16 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0x8dedb): LCKR
    <400>   DW_AT_decl_file   : 3
    <401>   DW_AT_decl_line   : 273
    <403>   DW_AT_decl_column : 17
    <404>   DW_AT_type        : <0x307>
    <408>   DW_AT_data_member_location: 28
 <2><409>: Abbrev Number: 17 (DW_TAG_member)
    <40a>   DW_AT_name        : AFR
    <40e>   DW_AT_decl_file   : 3
    <40f>   DW_AT_decl_line   : 274
    <411>   DW_AT_decl_column : 17
    <412>   DW_AT_type        : <0x428>
    <416>   DW_AT_data_member_location: 32
 <2><417>: Abbrev Number: 0
 <1><418>: Abbrev Number: 10 (DW_TAG_array_type)
    <419>   DW_AT_type        : <0x307>
    <41d>   DW_AT_sibling     : <0x428>
 <2><421>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <422>   DW_AT_type        : <0x2cd>
    <426>   DW_AT_upper_bound : 1
 <2><427>: Abbrev Number: 0
 <1><428>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <429>   DW_AT_type        : <0x418>
 <1><42d>: Abbrev Number: 18 (DW_TAG_typedef)
    <42e>   DW_AT_name        : (indirect string, offset: 0x8ed21): GPIO_TypeDef
    <432>   DW_AT_decl_file   : 3
    <433>   DW_AT_decl_line   : 275
    <435>   DW_AT_decl_column : 3
    <436>   DW_AT_type        : <0x38f>
 <1><43a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <43b>   DW_AT_byte_size   : 8
    <43c>   DW_AT_decl_file   : 3
    <43d>   DW_AT_decl_line   : 325
    <43f>   DW_AT_decl_column : 9
    <440>   DW_AT_sibling     : <0x460>
 <2><444>: Abbrev Number: 17 (DW_TAG_member)
    <445>   DW_AT_name        : CR
    <448>   DW_AT_decl_file   : 3
    <449>   DW_AT_decl_line   : 327
    <44b>   DW_AT_decl_column : 17
    <44c>   DW_AT_type        : <0x307>
    <450>   DW_AT_data_member_location: 0
 <2><451>: Abbrev Number: 17 (DW_TAG_member)
    <452>   DW_AT_name        : CSR
    <456>   DW_AT_decl_file   : 3
    <457>   DW_AT_decl_line   : 328
    <459>   DW_AT_decl_column : 17
    <45a>   DW_AT_type        : <0x307>
    <45e>   DW_AT_data_member_location: 4
 <2><45f>: Abbrev Number: 0
 <1><460>: Abbrev Number: 18 (DW_TAG_typedef)
    <461>   DW_AT_name        : (indirect string, offset: 0x8d5f5): PWR_TypeDef
    <465>   DW_AT_decl_file   : 3
    <466>   DW_AT_decl_line   : 329
    <468>   DW_AT_decl_column : 3
    <469>   DW_AT_type        : <0x43a>
 <1><46d>: Abbrev Number: 15 (DW_TAG_structure_type)
    <46e>   DW_AT_byte_size   : 144
    <46f>   DW_AT_decl_file   : 3
    <470>   DW_AT_decl_line   : 335
    <472>   DW_AT_decl_column : 9
    <473>   DW_AT_sibling     : <0x637>
 <2><477>: Abbrev Number: 17 (DW_TAG_member)
    <478>   DW_AT_name        : CR
    <47b>   DW_AT_decl_file   : 3
    <47c>   DW_AT_decl_line   : 337
    <47e>   DW_AT_decl_column : 17
    <47f>   DW_AT_type        : <0x307>
    <483>   DW_AT_data_member_location: 0
 <2><484>: Abbrev Number: 16 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0x8d4dc): PLLCFGR
    <489>   DW_AT_decl_file   : 3
    <48a>   DW_AT_decl_line   : 338
    <48c>   DW_AT_decl_column : 17
    <48d>   DW_AT_type        : <0x307>
    <491>   DW_AT_data_member_location: 4
 <2><492>: Abbrev Number: 16 (DW_TAG_member)
    <493>   DW_AT_name        : (indirect string, offset: 0x8baaf): CFGR
    <497>   DW_AT_decl_file   : 3
    <498>   DW_AT_decl_line   : 339
    <49a>   DW_AT_decl_column : 17
    <49b>   DW_AT_type        : <0x307>
    <49f>   DW_AT_data_member_location: 8
 <2><4a0>: Abbrev Number: 17 (DW_TAG_member)
    <4a1>   DW_AT_name        : CIR
    <4a5>   DW_AT_decl_file   : 3
    <4a6>   DW_AT_decl_line   : 340
    <4a8>   DW_AT_decl_column : 17
    <4a9>   DW_AT_type        : <0x307>
    <4ad>   DW_AT_data_member_location: 12
 <2><4ae>: Abbrev Number: 16 (DW_TAG_member)
    <4af>   DW_AT_name        : (indirect string, offset: 0x8da54): AHB1RSTR
    <4b3>   DW_AT_decl_file   : 3
    <4b4>   DW_AT_decl_line   : 341
    <4b6>   DW_AT_decl_column : 17
    <4b7>   DW_AT_type        : <0x307>
    <4bb>   DW_AT_data_member_location: 16
 <2><4bc>: Abbrev Number: 16 (DW_TAG_member)
    <4bd>   DW_AT_name        : (indirect string, offset: 0x8a0d0): AHB2RSTR
    <4c1>   DW_AT_decl_file   : 3
    <4c2>   DW_AT_decl_line   : 342
    <4c4>   DW_AT_decl_column : 17
    <4c5>   DW_AT_type        : <0x307>
    <4c9>   DW_AT_data_member_location: 20
 <2><4ca>: Abbrev Number: 16 (DW_TAG_member)
    <4cb>   DW_AT_name        : (indirect string, offset: 0x8baa3): AHB3RSTR
    <4cf>   DW_AT_decl_file   : 3
    <4d0>   DW_AT_decl_line   : 343
    <4d2>   DW_AT_decl_column : 17
    <4d3>   DW_AT_type        : <0x307>
    <4d7>   DW_AT_data_member_location: 24
 <2><4d8>: Abbrev Number: 16 (DW_TAG_member)
    <4d9>   DW_AT_name        : (indirect string, offset: 0x8eb3b): RESERVED0
    <4dd>   DW_AT_decl_file   : 3
    <4de>   DW_AT_decl_line   : 344
    <4e0>   DW_AT_decl_column : 17
    <4e1>   DW_AT_type        : <0x2fb>
    <4e5>   DW_AT_data_member_location: 28
 <2><4e6>: Abbrev Number: 16 (DW_TAG_member)
    <4e7>   DW_AT_name        : (indirect string, offset: 0x8a08f): APB1RSTR
    <4eb>   DW_AT_decl_file   : 3
    <4ec>   DW_AT_decl_line   : 345
    <4ee>   DW_AT_decl_column : 17
    <4ef>   DW_AT_type        : <0x307>
    <4f3>   DW_AT_data_member_location: 32
 <2><4f4>: Abbrev Number: 16 (DW_TAG_member)
    <4f5>   DW_AT_name        : (indirect string, offset: 0x8ba88): APB2RSTR
    <4f9>   DW_AT_decl_file   : 3
    <4fa>   DW_AT_decl_line   : 346
    <4fc>   DW_AT_decl_column : 17
    <4fd>   DW_AT_type        : <0x307>
    <501>   DW_AT_data_member_location: 36
 <2><502>: Abbrev Number: 16 (DW_TAG_member)
    <503>   DW_AT_name        : (indirect string, offset: 0x8eb45): RESERVED1
    <507>   DW_AT_decl_file   : 3
    <508>   DW_AT_decl_line   : 347
    <50a>   DW_AT_decl_column : 17
    <50b>   DW_AT_type        : <0x31c>
    <50f>   DW_AT_data_member_location: 40
 <2><510>: Abbrev Number: 16 (DW_TAG_member)
    <511>   DW_AT_name        : (indirect string, offset: 0x89dab): AHB1ENR
    <515>   DW_AT_decl_file   : 3
    <516>   DW_AT_decl_line   : 348
    <518>   DW_AT_decl_column : 17
    <519>   DW_AT_type        : <0x307>
    <51d>   DW_AT_data_member_location: 48
 <2><51e>: Abbrev Number: 16 (DW_TAG_member)
    <51f>   DW_AT_name        : (indirect string, offset: 0x8af04): AHB2ENR
    <523>   DW_AT_decl_file   : 3
    <524>   DW_AT_decl_line   : 349
    <526>   DW_AT_decl_column : 17
    <527>   DW_AT_type        : <0x307>
    <52b>   DW_AT_data_member_location: 52
 <2><52c>: Abbrev Number: 16 (DW_TAG_member)
    <52d>   DW_AT_name        : (indirect string, offset: 0x8bbeb): AHB3ENR
    <531>   DW_AT_decl_file   : 3
    <532>   DW_AT_decl_line   : 350
    <534>   DW_AT_decl_column : 17
    <535>   DW_AT_type        : <0x307>
    <539>   DW_AT_data_member_location: 56
 <2><53a>: Abbrev Number: 16 (DW_TAG_member)
    <53b>   DW_AT_name        : (indirect string, offset: 0x8eb4f): RESERVED2
    <53f>   DW_AT_decl_file   : 3
    <540>   DW_AT_decl_line   : 351
    <542>   DW_AT_decl_column : 17
    <543>   DW_AT_type        : <0x2fb>
    <547>   DW_AT_data_member_location: 60
 <2><548>: Abbrev Number: 16 (DW_TAG_member)
    <549>   DW_AT_name        : (indirect string, offset: 0x8d73d): APB1ENR
    <54d>   DW_AT_decl_file   : 3
    <54e>   DW_AT_decl_line   : 352
    <550>   DW_AT_decl_column : 17
    <551>   DW_AT_type        : <0x307>
    <555>   DW_AT_data_member_location: 64
 <2><556>: Abbrev Number: 16 (DW_TAG_member)
    <557>   DW_AT_name        : (indirect string, offset: 0x8a17b): APB2ENR
    <55b>   DW_AT_decl_file   : 3
    <55c>   DW_AT_decl_line   : 353
    <55e>   DW_AT_decl_column : 17
    <55f>   DW_AT_type        : <0x307>
    <563>   DW_AT_data_member_location: 68
 <2><564>: Abbrev Number: 16 (DW_TAG_member)
    <565>   DW_AT_name        : (indirect string, offset: 0x8eb59): RESERVED3
    <569>   DW_AT_decl_file   : 3
    <56a>   DW_AT_decl_line   : 354
    <56c>   DW_AT_decl_column : 17
    <56d>   DW_AT_type        : <0x31c>
    <571>   DW_AT_data_member_location: 72
 <2><572>: Abbrev Number: 16 (DW_TAG_member)
    <573>   DW_AT_name        : (indirect string, offset: 0x8bfda): AHB1LPENR
    <577>   DW_AT_decl_file   : 3
    <578>   DW_AT_decl_line   : 355
    <57a>   DW_AT_decl_column : 17
    <57b>   DW_AT_type        : <0x307>
    <57f>   DW_AT_data_member_location: 80
 <2><580>: Abbrev Number: 16 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0x8ac29): AHB2LPENR
    <585>   DW_AT_decl_file   : 3
    <586>   DW_AT_decl_line   : 356
    <588>   DW_AT_decl_column : 17
    <589>   DW_AT_type        : <0x307>
    <58d>   DW_AT_data_member_location: 84
 <2><58e>: Abbrev Number: 16 (DW_TAG_member)
    <58f>   DW_AT_name        : (indirect string, offset: 0x8d1a1): AHB3LPENR
    <593>   DW_AT_decl_file   : 3
    <594>   DW_AT_decl_line   : 357
    <596>   DW_AT_decl_column : 17
    <597>   DW_AT_type        : <0x307>
    <59b>   DW_AT_data_member_location: 88
 <2><59c>: Abbrev Number: 16 (DW_TAG_member)
    <59d>   DW_AT_name        : (indirect string, offset: 0x8eb63): RESERVED4
    <5a1>   DW_AT_decl_file   : 3
    <5a2>   DW_AT_decl_line   : 358
    <5a4>   DW_AT_decl_column : 17
    <5a5>   DW_AT_type        : <0x2fb>
    <5a9>   DW_AT_data_member_location: 92
 <2><5aa>: Abbrev Number: 16 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x8d14f): APB1LPENR
    <5af>   DW_AT_decl_file   : 3
    <5b0>   DW_AT_decl_line   : 359
    <5b2>   DW_AT_decl_column : 17
    <5b3>   DW_AT_type        : <0x307>
    <5b7>   DW_AT_data_member_location: 96
 <2><5b8>: Abbrev Number: 16 (DW_TAG_member)
    <5b9>   DW_AT_name        : (indirect string, offset: 0x89d79): APB2LPENR
    <5bd>   DW_AT_decl_file   : 3
    <5be>   DW_AT_decl_line   : 360
    <5c0>   DW_AT_decl_column : 17
    <5c1>   DW_AT_type        : <0x307>
    <5c5>   DW_AT_data_member_location: 100
 <2><5c6>: Abbrev Number: 16 (DW_TAG_member)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x8eb6d): RESERVED5
    <5cb>   DW_AT_decl_file   : 3
    <5cc>   DW_AT_decl_line   : 361
    <5ce>   DW_AT_decl_column : 17
    <5cf>   DW_AT_type        : <0x31c>
    <5d3>   DW_AT_data_member_location: 104
 <2><5d4>: Abbrev Number: 16 (DW_TAG_member)
    <5d5>   DW_AT_name        : (indirect string, offset: 0x8a225): BDCR
    <5d9>   DW_AT_decl_file   : 3
    <5da>   DW_AT_decl_line   : 362
    <5dc>   DW_AT_decl_column : 17
    <5dd>   DW_AT_type        : <0x307>
    <5e1>   DW_AT_data_member_location: 112
 <2><5e2>: Abbrev Number: 17 (DW_TAG_member)
    <5e3>   DW_AT_name        : CSR
    <5e7>   DW_AT_decl_file   : 3
    <5e8>   DW_AT_decl_line   : 363
    <5ea>   DW_AT_decl_column : 17
    <5eb>   DW_AT_type        : <0x307>
    <5ef>   DW_AT_data_member_location: 116
 <2><5f0>: Abbrev Number: 16 (DW_TAG_member)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x8eb77): RESERVED6
    <5f5>   DW_AT_decl_file   : 3
    <5f6>   DW_AT_decl_line   : 364
    <5f8>   DW_AT_decl_column : 17
    <5f9>   DW_AT_type        : <0x31c>
    <5fd>   DW_AT_data_member_location: 120
 <2><5fe>: Abbrev Number: 16 (DW_TAG_member)
    <5ff>   DW_AT_name        : (indirect string, offset: 0x8c2e2): SSCGR
    <603>   DW_AT_decl_file   : 3
    <604>   DW_AT_decl_line   : 365
    <606>   DW_AT_decl_column : 17
    <607>   DW_AT_type        : <0x307>
    <60b>   DW_AT_data_member_location: 128
 <2><60c>: Abbrev Number: 16 (DW_TAG_member)
    <60d>   DW_AT_name        : (indirect string, offset: 0x8b30b): PLLI2SCFGR
    <611>   DW_AT_decl_file   : 3
    <612>   DW_AT_decl_line   : 366
    <614>   DW_AT_decl_column : 17
    <615>   DW_AT_type        : <0x307>
    <619>   DW_AT_data_member_location: 132
 <2><61a>: Abbrev Number: 16 (DW_TAG_member)
    <61b>   DW_AT_name        : (indirect string, offset: 0x8eb81): RESERVED7
    <61f>   DW_AT_decl_file   : 3
    <620>   DW_AT_decl_line   : 367
    <622>   DW_AT_decl_column : 17
    <623>   DW_AT_type        : <0x30c>
    <627>   DW_AT_data_member_location: 136
 <2><628>: Abbrev Number: 16 (DW_TAG_member)
    <629>   DW_AT_name        : (indirect string, offset: 0x8baac): DCKCFGR
    <62d>   DW_AT_decl_file   : 3
    <62e>   DW_AT_decl_line   : 368
    <630>   DW_AT_decl_column : 17
    <631>   DW_AT_type        : <0x307>
    <635>   DW_AT_data_member_location: 140
 <2><636>: Abbrev Number: 0
 <1><637>: Abbrev Number: 18 (DW_TAG_typedef)
    <638>   DW_AT_name        : (indirect string, offset: 0x8bcd8): RCC_TypeDef
    <63c>   DW_AT_decl_file   : 3
    <63d>   DW_AT_decl_line   : 369
    <63f>   DW_AT_decl_column : 3
    <640>   DW_AT_type        : <0x46d>
 <1><644>: Abbrev Number: 15 (DW_TAG_structure_type)
    <645>   DW_AT_byte_size   : 84
    <646>   DW_AT_decl_file   : 3
    <647>   DW_AT_decl_line   : 469
    <649>   DW_AT_decl_column : 9
    <64a>   DW_AT_sibling     : <0x773>
 <2><64e>: Abbrev Number: 17 (DW_TAG_member)
    <64f>   DW_AT_name        : CR1
    <653>   DW_AT_decl_file   : 3
    <654>   DW_AT_decl_line   : 471
    <656>   DW_AT_decl_column : 17
    <657>   DW_AT_type        : <0x307>
    <65b>   DW_AT_data_member_location: 0
 <2><65c>: Abbrev Number: 17 (DW_TAG_member)
    <65d>   DW_AT_name        : CR2
    <661>   DW_AT_decl_file   : 3
    <662>   DW_AT_decl_line   : 472
    <664>   DW_AT_decl_column : 17
    <665>   DW_AT_type        : <0x307>
    <669>   DW_AT_data_member_location: 4
 <2><66a>: Abbrev Number: 16 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0x855e2): SMCR
    <66f>   DW_AT_decl_file   : 3
    <670>   DW_AT_decl_line   : 473
    <672>   DW_AT_decl_column : 17
    <673>   DW_AT_type        : <0x307>
    <677>   DW_AT_data_member_location: 8
 <2><678>: Abbrev Number: 16 (DW_TAG_member)
    <679>   DW_AT_name        : (indirect string, offset: 0x63e17): DIER
    <67d>   DW_AT_decl_file   : 3
    <67e>   DW_AT_decl_line   : 474
    <680>   DW_AT_decl_column : 17
    <681>   DW_AT_type        : <0x307>
    <685>   DW_AT_data_member_location: 12
 <2><686>: Abbrev Number: 17 (DW_TAG_member)
    <687>   DW_AT_name        : SR
    <68a>   DW_AT_decl_file   : 3
    <68b>   DW_AT_decl_line   : 475
    <68d>   DW_AT_decl_column : 17
    <68e>   DW_AT_type        : <0x307>
    <692>   DW_AT_data_member_location: 16
 <2><693>: Abbrev Number: 17 (DW_TAG_member)
    <694>   DW_AT_name        : EGR
    <698>   DW_AT_decl_file   : 3
    <699>   DW_AT_decl_line   : 476
    <69b>   DW_AT_decl_column : 17
    <69c>   DW_AT_type        : <0x307>
    <6a0>   DW_AT_data_member_location: 20
 <2><6a1>: Abbrev Number: 16 (DW_TAG_member)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x57a39): CCMR1
    <6a6>   DW_AT_decl_file   : 3
    <6a7>   DW_AT_decl_line   : 477
    <6a9>   DW_AT_decl_column : 17
    <6aa>   DW_AT_type        : <0x307>
    <6ae>   DW_AT_data_member_location: 24
 <2><6af>: Abbrev Number: 16 (DW_TAG_member)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x5617b): CCMR2
    <6b4>   DW_AT_decl_file   : 3
    <6b5>   DW_AT_decl_line   : 478
    <6b7>   DW_AT_decl_column : 17
    <6b8>   DW_AT_type        : <0x307>
    <6bc>   DW_AT_data_member_location: 28
 <2><6bd>: Abbrev Number: 16 (DW_TAG_member)
    <6be>   DW_AT_name        : (indirect string, offset: 0x83b22): CCER
    <6c2>   DW_AT_decl_file   : 3
    <6c3>   DW_AT_decl_line   : 479
    <6c5>   DW_AT_decl_column : 17
    <6c6>   DW_AT_type        : <0x307>
    <6ca>   DW_AT_data_member_location: 32
 <2><6cb>: Abbrev Number: 17 (DW_TAG_member)
    <6cc>   DW_AT_name        : CNT
    <6d0>   DW_AT_decl_file   : 3
    <6d1>   DW_AT_decl_line   : 480
    <6d3>   DW_AT_decl_column : 17
    <6d4>   DW_AT_type        : <0x307>
    <6d8>   DW_AT_data_member_location: 36
 <2><6d9>: Abbrev Number: 17 (DW_TAG_member)
    <6da>   DW_AT_name        : PSC
    <6de>   DW_AT_decl_file   : 3
    <6df>   DW_AT_decl_line   : 481
    <6e1>   DW_AT_decl_column : 17
    <6e2>   DW_AT_type        : <0x307>
    <6e6>   DW_AT_data_member_location: 40
 <2><6e7>: Abbrev Number: 17 (DW_TAG_member)
    <6e8>   DW_AT_name        : ARR
    <6ec>   DW_AT_decl_file   : 3
    <6ed>   DW_AT_decl_line   : 482
    <6ef>   DW_AT_decl_column : 17
    <6f0>   DW_AT_type        : <0x307>
    <6f4>   DW_AT_data_member_location: 44
 <2><6f5>: Abbrev Number: 17 (DW_TAG_member)
    <6f6>   DW_AT_name        : RCR
    <6fa>   DW_AT_decl_file   : 3
    <6fb>   DW_AT_decl_line   : 483
    <6fd>   DW_AT_decl_column : 17
    <6fe>   DW_AT_type        : <0x307>
    <702>   DW_AT_data_member_location: 48
 <2><703>: Abbrev Number: 16 (DW_TAG_member)
    <704>   DW_AT_name        : (indirect string, offset: 0x71e6e): CCR1
    <708>   DW_AT_decl_file   : 3
    <709>   DW_AT_decl_line   : 484
    <70b>   DW_AT_decl_column : 17
    <70c>   DW_AT_type        : <0x307>
    <710>   DW_AT_data_member_location: 52
 <2><711>: Abbrev Number: 16 (DW_TAG_member)
    <712>   DW_AT_name        : (indirect string, offset: 0x3a2fd): CCR2
    <716>   DW_AT_decl_file   : 3
    <717>   DW_AT_decl_line   : 485
    <719>   DW_AT_decl_column : 17
    <71a>   DW_AT_type        : <0x307>
    <71e>   DW_AT_data_member_location: 56
 <2><71f>: Abbrev Number: 16 (DW_TAG_member)
    <720>   DW_AT_name        : (indirect string, offset: 0x36158): CCR3
    <724>   DW_AT_decl_file   : 3
    <725>   DW_AT_decl_line   : 486
    <727>   DW_AT_decl_column : 17
    <728>   DW_AT_type        : <0x307>
    <72c>   DW_AT_data_member_location: 60
 <2><72d>: Abbrev Number: 16 (DW_TAG_member)
    <72e>   DW_AT_name        : (indirect string, offset: 0xf8fe): CCR4
    <732>   DW_AT_decl_file   : 3
    <733>   DW_AT_decl_line   : 487
    <735>   DW_AT_decl_column : 17
    <736>   DW_AT_type        : <0x307>
    <73a>   DW_AT_data_member_location: 64
 <2><73b>: Abbrev Number: 16 (DW_TAG_member)
    <73c>   DW_AT_name        : (indirect string, offset: 0xa562): BDTR
    <740>   DW_AT_decl_file   : 3
    <741>   DW_AT_decl_line   : 488
    <743>   DW_AT_decl_column : 17
    <744>   DW_AT_type        : <0x307>
    <748>   DW_AT_data_member_location: 68
 <2><749>: Abbrev Number: 17 (DW_TAG_member)
    <74a>   DW_AT_name        : DCR
    <74e>   DW_AT_decl_file   : 3
    <74f>   DW_AT_decl_line   : 489
    <751>   DW_AT_decl_column : 17
    <752>   DW_AT_type        : <0x307>
    <756>   DW_AT_data_member_location: 72
 <2><757>: Abbrev Number: 16 (DW_TAG_member)
    <758>   DW_AT_name        : (indirect string, offset: 0x3c73): DMAR
    <75c>   DW_AT_decl_file   : 3
    <75d>   DW_AT_decl_line   : 490
    <75f>   DW_AT_decl_column : 17
    <760>   DW_AT_type        : <0x307>
    <764>   DW_AT_data_member_location: 76
 <2><765>: Abbrev Number: 17 (DW_TAG_member)
    <766>   DW_AT_name        : OR
    <769>   DW_AT_decl_file   : 3
    <76a>   DW_AT_decl_line   : 491
    <76c>   DW_AT_decl_column : 17
    <76d>   DW_AT_type        : <0x307>
    <771>   DW_AT_data_member_location: 80
 <2><772>: Abbrev Number: 0
 <1><773>: Abbrev Number: 18 (DW_TAG_typedef)
    <774>   DW_AT_name        : (indirect string, offset: 0x89a9d): TIM_TypeDef
    <778>   DW_AT_decl_file   : 3
    <779>   DW_AT_decl_line   : 492
    <77b>   DW_AT_decl_column : 3
    <77c>   DW_AT_type        : <0x644>
 <1><780>: Abbrev Number: 15 (DW_TAG_structure_type)
    <781>   DW_AT_byte_size   : 28
    <782>   DW_AT_decl_file   : 3
    <783>   DW_AT_decl_line   : 498
    <785>   DW_AT_decl_column : 9
    <786>   DW_AT_sibling     : <0x7eb>
 <2><78a>: Abbrev Number: 17 (DW_TAG_member)
    <78b>   DW_AT_name        : SR
    <78e>   DW_AT_decl_file   : 3
    <78f>   DW_AT_decl_line   : 500
    <791>   DW_AT_decl_column : 17
    <792>   DW_AT_type        : <0x307>
    <796>   DW_AT_data_member_location: 0
 <2><797>: Abbrev Number: 17 (DW_TAG_member)
    <798>   DW_AT_name        : DR
    <79b>   DW_AT_decl_file   : 3
    <79c>   DW_AT_decl_line   : 501
    <79e>   DW_AT_decl_column : 17
    <79f>   DW_AT_type        : <0x307>
    <7a3>   DW_AT_data_member_location: 4
 <2><7a4>: Abbrev Number: 17 (DW_TAG_member)
    <7a5>   DW_AT_name        : BRR
    <7a9>   DW_AT_decl_file   : 3
    <7aa>   DW_AT_decl_line   : 502
    <7ac>   DW_AT_decl_column : 17
    <7ad>   DW_AT_type        : <0x307>
    <7b1>   DW_AT_data_member_location: 8
 <2><7b2>: Abbrev Number: 17 (DW_TAG_member)
    <7b3>   DW_AT_name        : CR1
    <7b7>   DW_AT_decl_file   : 3
    <7b8>   DW_AT_decl_line   : 503
    <7ba>   DW_AT_decl_column : 17
    <7bb>   DW_AT_type        : <0x307>
    <7bf>   DW_AT_data_member_location: 12
 <2><7c0>: Abbrev Number: 17 (DW_TAG_member)
    <7c1>   DW_AT_name        : CR2
    <7c5>   DW_AT_decl_file   : 3
    <7c6>   DW_AT_decl_line   : 504
    <7c8>   DW_AT_decl_column : 17
    <7c9>   DW_AT_type        : <0x307>
    <7cd>   DW_AT_data_member_location: 16
 <2><7ce>: Abbrev Number: 17 (DW_TAG_member)
    <7cf>   DW_AT_name        : CR3
    <7d3>   DW_AT_decl_file   : 3
    <7d4>   DW_AT_decl_line   : 505
    <7d6>   DW_AT_decl_column : 17
    <7d7>   DW_AT_type        : <0x307>
    <7db>   DW_AT_data_member_location: 20
 <2><7dc>: Abbrev Number: 16 (DW_TAG_member)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x8afd6): GTPR
    <7e1>   DW_AT_decl_file   : 3
    <7e2>   DW_AT_decl_line   : 506
    <7e4>   DW_AT_decl_column : 17
    <7e5>   DW_AT_type        : <0x307>
    <7e9>   DW_AT_data_member_location: 24
 <2><7ea>: Abbrev Number: 0
 <1><7eb>: Abbrev Number: 18 (DW_TAG_typedef)
    <7ec>   DW_AT_name        : (indirect string, offset: 0x8ee45): USART_TypeDef
    <7f0>   DW_AT_decl_file   : 3
    <7f1>   DW_AT_decl_line   : 507
    <7f3>   DW_AT_decl_column : 3
    <7f4>   DW_AT_type        : <0x780>
 <1><7f8>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <7f9>   DW_AT_encoding    : 7	(unsigned)
    <7fa>   DW_AT_byte_size   : 1
    <7fb>   DW_AT_type        : <0x27d>
    <7ff>   DW_AT_decl_file   : 6
    <800>   DW_AT_decl_line   : 185
    <801>   DW_AT_decl_column : 1
    <802>   DW_AT_sibling     : <0x813>
 <2><806>: Abbrev Number: 4 (DW_TAG_enumerator)
    <807>   DW_AT_name        : (indirect string, offset: 0x38151): RESET
    <80b>   DW_AT_const_value : 0
 <2><80c>: Abbrev Number: 19 (DW_TAG_enumerator)
    <80d>   DW_AT_name        : SET
    <811>   DW_AT_const_value : 1
 <2><812>: Abbrev Number: 0
 <1><813>: Abbrev Number: 6 (DW_TAG_typedef)
    <814>   DW_AT_name        : (indirect string, offset: 0x2e58d): size_t
    <818>   DW_AT_decl_file   : 7
    <819>   DW_AT_decl_line   : 209
    <81a>   DW_AT_decl_column : 23
    <81b>   DW_AT_type        : <0x2cd>
 <1><81f>: Abbrev Number: 5 (DW_TAG_base_type)
    <820>   DW_AT_byte_size   : 8
    <821>   DW_AT_encoding    : 4	(float)
    <822>   DW_AT_name        : (indirect string, offset: 0x8dbd9): long double
 <1><826>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <827>   DW_AT_encoding    : 7	(unsigned)
    <828>   DW_AT_byte_size   : 1
    <829>   DW_AT_type        : <0x27d>
    <82d>   DW_AT_decl_file   : 8
    <82e>   DW_AT_decl_line   : 39
    <82f>   DW_AT_decl_column : 1
    <830>   DW_AT_sibling     : <0x84d>
 <2><834>: Abbrev Number: 4 (DW_TAG_enumerator)
    <835>   DW_AT_name        : (indirect string, offset: 0x8b356): HAL_OK
    <839>   DW_AT_const_value : 0
 <2><83a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <83b>   DW_AT_name        : (indirect string, offset: 0x8cb47): HAL_ERROR
    <83f>   DW_AT_const_value : 1
 <2><840>: Abbrev Number: 4 (DW_TAG_enumerator)
    <841>   DW_AT_name        : (indirect string, offset: 0x8dd13): HAL_BUSY
    <845>   DW_AT_const_value : 2
 <2><846>: Abbrev Number: 4 (DW_TAG_enumerator)
    <847>   DW_AT_name        : (indirect string, offset: 0x8b0b7): HAL_TIMEOUT
    <84b>   DW_AT_const_value : 3
 <2><84c>: Abbrev Number: 0
 <1><84d>: Abbrev Number: 6 (DW_TAG_typedef)
    <84e>   DW_AT_name        : (indirect string, offset: 0x898c9): HAL_StatusTypeDef
    <852>   DW_AT_decl_file   : 8
    <853>   DW_AT_decl_line   : 44
    <854>   DW_AT_decl_column : 3
    <855>   DW_AT_type        : <0x826>
 <1><859>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <85a>   DW_AT_encoding    : 7	(unsigned)
    <85b>   DW_AT_byte_size   : 1
    <85c>   DW_AT_type        : <0x27d>
    <860>   DW_AT_decl_file   : 8
    <861>   DW_AT_decl_line   : 50
    <862>   DW_AT_decl_column : 1
    <863>   DW_AT_sibling     : <0x874>
 <2><867>: Abbrev Number: 4 (DW_TAG_enumerator)
    <868>   DW_AT_name        : (indirect string, offset: 0x8d686): HAL_UNLOCKED
    <86c>   DW_AT_const_value : 0
 <2><86d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <86e>   DW_AT_name        : (indirect string, offset: 0x8efda): HAL_LOCKED
    <872>   DW_AT_const_value : 1
 <2><873>: Abbrev Number: 0
 <1><874>: Abbrev Number: 6 (DW_TAG_typedef)
    <875>   DW_AT_name        : (indirect string, offset: 0x8c8f3): HAL_LockTypeDef
    <879>   DW_AT_decl_file   : 8
    <87a>   DW_AT_decl_line   : 53
    <87b>   DW_AT_decl_column : 3
    <87c>   DW_AT_type        : <0x859>
 <1><880>: Abbrev Number: 12 (DW_TAG_structure_type)
    <881>   DW_AT_byte_size   : 24
    <882>   DW_AT_decl_file   : 9
    <883>   DW_AT_decl_line   : 45
    <884>   DW_AT_decl_column : 9
    <885>   DW_AT_sibling     : <0x8d8>
 <2><889>: Abbrev Number: 14 (DW_TAG_member)
    <88a>   DW_AT_name        : (indirect string, offset: 0x8d159): PLLState
    <88e>   DW_AT_decl_file   : 9
    <88f>   DW_AT_decl_line   : 47
    <890>   DW_AT_decl_column : 12
    <891>   DW_AT_type        : <0x2fb>
    <895>   DW_AT_data_member_location: 0
 <2><896>: Abbrev Number: 14 (DW_TAG_member)
    <897>   DW_AT_name        : (indirect string, offset: 0x8d1c6): PLLSource
    <89b>   DW_AT_decl_file   : 9
    <89c>   DW_AT_decl_line   : 50
    <89d>   DW_AT_decl_column : 12
    <89e>   DW_AT_type        : <0x2fb>
    <8a2>   DW_AT_data_member_location: 4
 <2><8a3>: Abbrev Number: 14 (DW_TAG_member)
    <8a4>   DW_AT_name        : (indirect string, offset: 0x8dc53): PLLM
    <8a8>   DW_AT_decl_file   : 9
    <8a9>   DW_AT_decl_line   : 53
    <8aa>   DW_AT_decl_column : 12
    <8ab>   DW_AT_type        : <0x2fb>
    <8af>   DW_AT_data_member_location: 8
 <2><8b0>: Abbrev Number: 14 (DW_TAG_member)
    <8b1>   DW_AT_name        : (indirect string, offset: 0x8dc58): PLLN
    <8b5>   DW_AT_decl_file   : 9
    <8b6>   DW_AT_decl_line   : 56
    <8b7>   DW_AT_decl_column : 12
    <8b8>   DW_AT_type        : <0x2fb>
    <8bc>   DW_AT_data_member_location: 12
 <2><8bd>: Abbrev Number: 14 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0x8bce4): PLLP
    <8c2>   DW_AT_decl_file   : 9
    <8c3>   DW_AT_decl_line   : 60
    <8c4>   DW_AT_decl_column : 12
    <8c5>   DW_AT_type        : <0x2fb>
    <8c9>   DW_AT_data_member_location: 16
 <2><8ca>: Abbrev Number: 14 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x77b05): PLLQ
    <8cf>   DW_AT_decl_file   : 9
    <8d0>   DW_AT_decl_line   : 63
    <8d1>   DW_AT_decl_column : 12
    <8d2>   DW_AT_type        : <0x2fb>
    <8d6>   DW_AT_data_member_location: 20
 <2><8d7>: Abbrev Number: 0
 <1><8d8>: Abbrev Number: 6 (DW_TAG_typedef)
    <8d9>   DW_AT_name        : (indirect string, offset: 0x8edb8): RCC_PLLInitTypeDef
    <8dd>   DW_AT_decl_file   : 9
    <8de>   DW_AT_decl_line   : 73
    <8df>   DW_AT_decl_column : 2
    <8e0>   DW_AT_type        : <0x880>
 <1><8e4>: Abbrev Number: 12 (DW_TAG_structure_type)
    <8e5>   DW_AT_byte_size   : 48
    <8e6>   DW_AT_decl_file   : 10
    <8e7>   DW_AT_decl_line   : 49
    <8e8>   DW_AT_decl_column : 9
    <8e9>   DW_AT_sibling     : <0x949>
 <2><8ed>: Abbrev Number: 14 (DW_TAG_member)
    <8ee>   DW_AT_name        : (indirect string, offset: 0x8db9c): OscillatorType
    <8f2>   DW_AT_decl_file   : 10
    <8f3>   DW_AT_decl_line   : 51
    <8f4>   DW_AT_decl_column : 12
    <8f5>   DW_AT_type        : <0x2fb>
    <8f9>   DW_AT_data_member_location: 0
 <2><8fa>: Abbrev Number: 14 (DW_TAG_member)
    <8fb>   DW_AT_name        : (indirect string, offset: 0x8d1bd): HSEState
    <8ff>   DW_AT_decl_file   : 10
    <900>   DW_AT_decl_line   : 54
    <901>   DW_AT_decl_column : 12
    <902>   DW_AT_type        : <0x2fb>
    <906>   DW_AT_data_member_location: 4
 <2><907>: Abbrev Number: 14 (DW_TAG_member)
    <908>   DW_AT_name        : (indirect string, offset: 0x8cbf7): LSEState
    <90c>   DW_AT_decl_file   : 10
    <90d>   DW_AT_decl_line   : 57
    <90e>   DW_AT_decl_column : 12
    <90f>   DW_AT_type        : <0x2fb>
    <913>   DW_AT_data_member_location: 8
 <2><914>: Abbrev Number: 14 (DW_TAG_member)
    <915>   DW_AT_name        : (indirect string, offset: 0x8bbbd): HSIState
    <919>   DW_AT_decl_file   : 10
    <91a>   DW_AT_decl_line   : 60
    <91b>   DW_AT_decl_column : 12
    <91c>   DW_AT_type        : <0x2fb>
    <920>   DW_AT_data_member_location: 12
 <2><921>: Abbrev Number: 14 (DW_TAG_member)
    <922>   DW_AT_name        : (indirect string, offset: 0x8def0): HSICalibrationValue
    <926>   DW_AT_decl_file   : 10
    <927>   DW_AT_decl_line   : 63
    <928>   DW_AT_decl_column : 12
    <929>   DW_AT_type        : <0x2fb>
    <92d>   DW_AT_data_member_location: 16
 <2><92e>: Abbrev Number: 14 (DW_TAG_member)
    <92f>   DW_AT_name        : (indirect string, offset: 0x8e20f): LSIState
    <933>   DW_AT_decl_file   : 10
    <934>   DW_AT_decl_line   : 66
    <935>   DW_AT_decl_column : 12
    <936>   DW_AT_type        : <0x2fb>
    <93a>   DW_AT_data_member_location: 20
 <2><93b>: Abbrev Number: 13 (DW_TAG_member)
    <93c>   DW_AT_name        : PLL
    <940>   DW_AT_decl_file   : 10
    <941>   DW_AT_decl_line   : 69
    <942>   DW_AT_decl_column : 22
    <943>   DW_AT_type        : <0x8d8>
    <947>   DW_AT_data_member_location: 24
 <2><948>: Abbrev Number: 0
 <1><949>: Abbrev Number: 6 (DW_TAG_typedef)
    <94a>   DW_AT_name        : (indirect string, offset: 0x8c2e8): RCC_OscInitTypeDef
    <94e>   DW_AT_decl_file   : 10
    <94f>   DW_AT_decl_line   : 70
    <950>   DW_AT_decl_column : 2
    <951>   DW_AT_type        : <0x8e4>
 <1><955>: Abbrev Number: 12 (DW_TAG_structure_type)
    <956>   DW_AT_byte_size   : 20
    <957>   DW_AT_decl_file   : 10
    <958>   DW_AT_decl_line   : 75
    <959>   DW_AT_decl_column : 9
    <95a>   DW_AT_sibling     : <0x9a0>
 <2><95e>: Abbrev Number: 14 (DW_TAG_member)
    <95f>   DW_AT_name        : (indirect string, offset: 0x8b196): ClockType
    <963>   DW_AT_decl_file   : 10
    <964>   DW_AT_decl_line   : 77
    <965>   DW_AT_decl_column : 12
    <966>   DW_AT_type        : <0x2fb>
    <96a>   DW_AT_data_member_location: 0
 <2><96b>: Abbrev Number: 14 (DW_TAG_member)
    <96c>   DW_AT_name        : (indirect string, offset: 0x8c066): SYSCLKSource
    <970>   DW_AT_decl_file   : 10
    <971>   DW_AT_decl_line   : 80
    <972>   DW_AT_decl_column : 12
    <973>   DW_AT_type        : <0x2fb>
    <977>   DW_AT_data_member_location: 4
 <2><978>: Abbrev Number: 14 (DW_TAG_member)
    <979>   DW_AT_name        : (indirect string, offset: 0x8dc0d): AHBCLKDivider
    <97d>   DW_AT_decl_file   : 10
    <97e>   DW_AT_decl_line   : 83
    <97f>   DW_AT_decl_column : 12
    <980>   DW_AT_type        : <0x2fb>
    <984>   DW_AT_data_member_location: 8
 <2><985>: Abbrev Number: 14 (DW_TAG_member)
    <986>   DW_AT_name        : (indirect string, offset: 0x89abd): APB1CLKDivider
    <98a>   DW_AT_decl_file   : 10
    <98b>   DW_AT_decl_line   : 86
    <98c>   DW_AT_decl_column : 12
    <98d>   DW_AT_type        : <0x2fb>
    <991>   DW_AT_data_member_location: 12
 <2><992>: Abbrev Number: 14 (DW_TAG_member)
    <993>   DW_AT_name        : (indirect string, offset: 0x8bc60): APB2CLKDivider
    <997>   DW_AT_decl_file   : 10
    <998>   DW_AT_decl_line   : 89
    <999>   DW_AT_decl_column : 12
    <99a>   DW_AT_type        : <0x2fb>
    <99e>   DW_AT_data_member_location: 16
 <2><99f>: Abbrev Number: 0
 <1><9a0>: Abbrev Number: 6 (DW_TAG_typedef)
    <9a1>   DW_AT_name        : (indirect string, offset: 0x8d4c9): RCC_ClkInitTypeDef
    <9a5>   DW_AT_decl_file   : 10
    <9a6>   DW_AT_decl_line   : 92
    <9a7>   DW_AT_decl_column : 2
    <9a8>   DW_AT_type        : <0x955>
 <1><9ac>: Abbrev Number: 12 (DW_TAG_structure_type)
    <9ad>   DW_AT_byte_size   : 20
    <9ae>   DW_AT_decl_file   : 11
    <9af>   DW_AT_decl_line   : 46
    <9b0>   DW_AT_decl_column : 9
    <9b1>   DW_AT_sibling     : <0x9f7>
 <2><9b5>: Abbrev Number: 13 (DW_TAG_member)
    <9b6>   DW_AT_name        : Pin
    <9ba>   DW_AT_decl_file   : 11
    <9bb>   DW_AT_decl_line   : 48
    <9bc>   DW_AT_decl_column : 12
    <9bd>   DW_AT_type        : <0x2fb>
    <9c1>   DW_AT_data_member_location: 0
 <2><9c2>: Abbrev Number: 14 (DW_TAG_member)
    <9c3>   DW_AT_name        : (indirect string, offset: 0x90457): Mode
    <9c7>   DW_AT_decl_file   : 11
    <9c8>   DW_AT_decl_line   : 51
    <9c9>   DW_AT_decl_column : 12
    <9ca>   DW_AT_type        : <0x2fb>
    <9ce>   DW_AT_data_member_location: 4
 <2><9cf>: Abbrev Number: 14 (DW_TAG_member)
    <9d0>   DW_AT_name        : (indirect string, offset: 0x8c082): Pull
    <9d4>   DW_AT_decl_file   : 11
    <9d5>   DW_AT_decl_line   : 54
    <9d6>   DW_AT_decl_column : 12
    <9d7>   DW_AT_type        : <0x2fb>
    <9db>   DW_AT_data_member_location: 8
 <2><9dc>: Abbrev Number: 14 (DW_TAG_member)
    <9dd>   DW_AT_name        : (indirect string, offset: 0x8c78c): Speed
    <9e1>   DW_AT_decl_file   : 11
    <9e2>   DW_AT_decl_line   : 57
    <9e3>   DW_AT_decl_column : 12
    <9e4>   DW_AT_type        : <0x2fb>
    <9e8>   DW_AT_data_member_location: 12
 <2><9e9>: Abbrev Number: 14 (DW_TAG_member)
    <9ea>   DW_AT_name        : (indirect string, offset: 0x8bc56): Alternate
    <9ee>   DW_AT_decl_file   : 11
    <9ef>   DW_AT_decl_line   : 60
    <9f0>   DW_AT_decl_column : 12
    <9f1>   DW_AT_type        : <0x2fb>
    <9f5>   DW_AT_data_member_location: 16
 <2><9f6>: Abbrev Number: 0
 <1><9f7>: Abbrev Number: 6 (DW_TAG_typedef)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x8d93d): GPIO_InitTypeDef
    <9fc>   DW_AT_decl_file   : 11
    <9fd>   DW_AT_decl_line   : 62
    <9fe>   DW_AT_decl_column : 2
    <9ff>   DW_AT_type        : <0x9ac>
 <1><a03>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <a04>   DW_AT_encoding    : 7	(unsigned)
    <a05>   DW_AT_byte_size   : 1
    <a06>   DW_AT_type        : <0x27d>
    <a0a>   DW_AT_decl_file   : 11
    <a0b>   DW_AT_decl_line   : 68
    <a0c>   DW_AT_decl_column : 1
    <a0d>   DW_AT_sibling     : <0xa1e>
 <2><a11>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a12>   DW_AT_name        : (indirect string, offset: 0x8aa72): GPIO_PIN_RESET
    <a16>   DW_AT_const_value : 0
 <2><a17>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a18>   DW_AT_name        : (indirect string, offset: 0x8a67c): GPIO_PIN_SET
    <a1c>   DW_AT_const_value : 1
 <2><a1d>: Abbrev Number: 0
 <1><a1e>: Abbrev Number: 6 (DW_TAG_typedef)
    <a1f>   DW_AT_name        : (indirect string, offset: 0x8edec): GPIO_PinState
    <a23>   DW_AT_decl_file   : 11
    <a24>   DW_AT_decl_line   : 71
    <a25>   DW_AT_decl_column : 2
    <a26>   DW_AT_type        : <0xa03>
 <1><a2a>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a2b>   DW_AT_byte_size   : 48
    <a2c>   DW_AT_decl_file   : 12
    <a2d>   DW_AT_decl_line   : 48
    <a2e>   DW_AT_decl_column : 9
    <a2f>   DW_AT_sibling     : <0xad0>
 <2><a33>: Abbrev Number: 14 (DW_TAG_member)
    <a34>   DW_AT_name        : (indirect string, offset: 0x8c251): Channel
    <a38>   DW_AT_decl_file   : 12
    <a39>   DW_AT_decl_line   : 50
    <a3a>   DW_AT_decl_column : 12
    <a3b>   DW_AT_type        : <0x2fb>
    <a3f>   DW_AT_data_member_location: 0
 <2><a40>: Abbrev Number: 14 (DW_TAG_member)
    <a41>   DW_AT_name        : (indirect string, offset: 0x8b508): Direction
    <a45>   DW_AT_decl_file   : 12
    <a46>   DW_AT_decl_line   : 53
    <a47>   DW_AT_decl_column : 12
    <a48>   DW_AT_type        : <0x2fb>
    <a4c>   DW_AT_data_member_location: 4
 <2><a4d>: Abbrev Number: 14 (DW_TAG_member)
    <a4e>   DW_AT_name        : (indirect string, offset: 0x89d2a): PeriphInc
    <a52>   DW_AT_decl_file   : 12
    <a53>   DW_AT_decl_line   : 57
    <a54>   DW_AT_decl_column : 12
    <a55>   DW_AT_type        : <0x2fb>
    <a59>   DW_AT_data_member_location: 8
 <2><a5a>: Abbrev Number: 14 (DW_TAG_member)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x8a43e): MemInc
    <a5f>   DW_AT_decl_file   : 12
    <a60>   DW_AT_decl_line   : 60
    <a61>   DW_AT_decl_column : 12
    <a62>   DW_AT_type        : <0x2fb>
    <a66>   DW_AT_data_member_location: 12
 <2><a67>: Abbrev Number: 14 (DW_TAG_member)
    <a68>   DW_AT_name        : (indirect string, offset: 0x8c019): PeriphDataAlignment
    <a6c>   DW_AT_decl_file   : 12
    <a6d>   DW_AT_decl_line   : 63
    <a6e>   DW_AT_decl_column : 12
    <a6f>   DW_AT_type        : <0x2fb>
    <a73>   DW_AT_data_member_location: 16
 <2><a74>: Abbrev Number: 14 (DW_TAG_member)
    <a75>   DW_AT_name        : (indirect string, offset: 0x8e36c): MemDataAlignment
    <a79>   DW_AT_decl_file   : 12
    <a7a>   DW_AT_decl_line   : 66
    <a7b>   DW_AT_decl_column : 12
    <a7c>   DW_AT_type        : <0x2fb>
    <a80>   DW_AT_data_member_location: 20
 <2><a81>: Abbrev Number: 14 (DW_TAG_member)
    <a82>   DW_AT_name        : (indirect string, offset: 0x90457): Mode
    <a86>   DW_AT_decl_file   : 12
    <a87>   DW_AT_decl_line   : 69
    <a88>   DW_AT_decl_column : 12
    <a89>   DW_AT_type        : <0x2fb>
    <a8d>   DW_AT_data_member_location: 24
 <2><a8e>: Abbrev Number: 14 (DW_TAG_member)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x8fad3): Priority
    <a93>   DW_AT_decl_file   : 12
    <a94>   DW_AT_decl_line   : 74
    <a95>   DW_AT_decl_column : 12
    <a96>   DW_AT_type        : <0x2fb>
    <a9a>   DW_AT_data_member_location: 28
 <2><a9b>: Abbrev Number: 14 (DW_TAG_member)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x8ba7f): FIFOMode
    <aa0>   DW_AT_decl_file   : 12
    <aa1>   DW_AT_decl_line   : 77
    <aa2>   DW_AT_decl_column : 12
    <aa3>   DW_AT_type        : <0x2fb>
    <aa7>   DW_AT_data_member_location: 32
 <2><aa8>: Abbrev Number: 14 (DW_TAG_member)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x8d76a): FIFOThreshold
    <aad>   DW_AT_decl_file   : 12
    <aae>   DW_AT_decl_line   : 82
    <aaf>   DW_AT_decl_column : 12
    <ab0>   DW_AT_type        : <0x2fb>
    <ab4>   DW_AT_data_member_location: 36
 <2><ab5>: Abbrev Number: 14 (DW_TAG_member)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x8d734): MemBurst
    <aba>   DW_AT_decl_file   : 12
    <abb>   DW_AT_decl_line   : 85
    <abc>   DW_AT_decl_column : 12
    <abd>   DW_AT_type        : <0x2fb>
    <ac1>   DW_AT_data_member_location: 40
 <2><ac2>: Abbrev Number: 14 (DW_TAG_member)
    <ac3>   DW_AT_name        : (indirect string, offset: 0x8b375): PeriphBurst
    <ac7>   DW_AT_decl_file   : 12
    <ac8>   DW_AT_decl_line   : 91
    <ac9>   DW_AT_decl_column : 12
    <aca>   DW_AT_type        : <0x2fb>
    <ace>   DW_AT_data_member_location: 44
 <2><acf>: Abbrev Number: 0
 <1><ad0>: Abbrev Number: 6 (DW_TAG_typedef)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x8af0c): DMA_InitTypeDef
    <ad5>   DW_AT_decl_file   : 12
    <ad6>   DW_AT_decl_line   : 96
    <ad7>   DW_AT_decl_column : 2
    <ad8>   DW_AT_type        : <0xa2a>
 <1><adc>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <add>   DW_AT_encoding    : 7	(unsigned)
    <ade>   DW_AT_byte_size   : 1
    <adf>   DW_AT_type        : <0x27d>
    <ae3>   DW_AT_decl_file   : 12
    <ae4>   DW_AT_decl_line   : 103
    <ae5>   DW_AT_decl_column : 1
    <ae6>   DW_AT_sibling     : <0xb0f>
 <2><aea>: Abbrev Number: 4 (DW_TAG_enumerator)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x8d6bc): HAL_DMA_STATE_RESET
    <aef>   DW_AT_const_value : 0
 <2><af0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <af1>   DW_AT_name        : (indirect string, offset: 0x8af87): HAL_DMA_STATE_READY
    <af5>   DW_AT_const_value : 1
 <2><af6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <af7>   DW_AT_name        : (indirect string, offset: 0x8d3e0): HAL_DMA_STATE_BUSY
    <afb>   DW_AT_const_value : 2
 <2><afc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <afd>   DW_AT_name        : (indirect string, offset: 0x8edfa): HAL_DMA_STATE_TIMEOUT
    <b01>   DW_AT_const_value : 3
 <2><b02>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b03>   DW_AT_name        : (indirect string, offset: 0x8deb9): HAL_DMA_STATE_ERROR
    <b07>   DW_AT_const_value : 4
 <2><b08>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b09>   DW_AT_name        : (indirect string, offset: 0x8ac77): HAL_DMA_STATE_ABORT
    <b0d>   DW_AT_const_value : 5
 <2><b0e>: Abbrev Number: 0
 <1><b0f>: Abbrev Number: 6 (DW_TAG_typedef)
    <b10>   DW_AT_name        : (indirect string, offset: 0x8d110): HAL_DMA_StateTypeDef
    <b14>   DW_AT_decl_file   : 12
    <b15>   DW_AT_decl_line   : 110
    <b16>   DW_AT_decl_column : 2
    <b17>   DW_AT_type        : <0xadc>
 <1><b1b>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <b1c>   DW_AT_type        : <0xb0f>
 <1><b20>: Abbrev Number: 20 (DW_TAG_structure_type)
    <b21>   DW_AT_name        : (indirect string, offset: 0x8de47): __DMA_HandleTypeDef
    <b25>   DW_AT_byte_size   : 96
    <b26>   DW_AT_decl_file   : 12
    <b27>   DW_AT_decl_line   : 138
    <b28>   DW_AT_decl_column : 16
    <b29>   DW_AT_sibling     : <0xbe4>
 <2><b2d>: Abbrev Number: 14 (DW_TAG_member)
    <b2e>   DW_AT_name        : (indirect string, offset: 0x8b6e4): Instance
    <b32>   DW_AT_decl_file   : 12
    <b33>   DW_AT_decl_line   : 140
    <b34>   DW_AT_decl_column : 31
    <b35>   DW_AT_type        : <0xbe4>
    <b39>   DW_AT_data_member_location: 0
 <2><b3a>: Abbrev Number: 14 (DW_TAG_member)
    <b3b>   DW_AT_name        : (indirect string, offset: 0x8a108): Init
    <b3f>   DW_AT_decl_file   : 12
    <b40>   DW_AT_decl_line   : 142
    <b41>   DW_AT_decl_column : 30
    <b42>   DW_AT_type        : <0xad0>
    <b46>   DW_AT_data_member_location: 4
 <2><b47>: Abbrev Number: 14 (DW_TAG_member)
    <b48>   DW_AT_name        : (indirect string, offset: 0x46229): Lock
    <b4c>   DW_AT_decl_file   : 12
    <b4d>   DW_AT_decl_line   : 144
    <b4e>   DW_AT_decl_column : 30
    <b4f>   DW_AT_type        : <0x874>
    <b53>   DW_AT_data_member_location: 52
 <2><b54>: Abbrev Number: 14 (DW_TAG_member)
    <b55>   DW_AT_name        : (indirect string, offset: 0x8d1c0): State
    <b59>   DW_AT_decl_file   : 12
    <b5a>   DW_AT_decl_line   : 146
    <b5b>   DW_AT_decl_column : 30
    <b5c>   DW_AT_type        : <0xb1b>
    <b60>   DW_AT_data_member_location: 53
 <2><b61>: Abbrev Number: 14 (DW_TAG_member)
    <b62>   DW_AT_name        : (indirect string, offset: 0x8ec45): Parent
    <b66>   DW_AT_decl_file   : 12
    <b67>   DW_AT_decl_line   : 148
    <b68>   DW_AT_decl_column : 31
    <b69>   DW_AT_type        : <0xbea>
    <b6d>   DW_AT_data_member_location: 56
 <2><b6e>: Abbrev Number: 14 (DW_TAG_member)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x8ef1e): XferCpltCallback
    <b73>   DW_AT_decl_file   : 12
    <b74>   DW_AT_decl_line   : 150
    <b75>   DW_AT_decl_column : 33
    <b76>   DW_AT_type        : <0xc02>
    <b7a>   DW_AT_data_member_location: 60
 <2><b7b>: Abbrev Number: 14 (DW_TAG_member)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x8d8ad): XferHalfCpltCallback
    <b80>   DW_AT_decl_file   : 12
    <b81>   DW_AT_decl_line   : 152
    <b82>   DW_AT_decl_column : 33
    <b83>   DW_AT_type        : <0xc02>
    <b87>   DW_AT_data_member_location: 64
 <2><b88>: Abbrev Number: 14 (DW_TAG_member)
    <b89>   DW_AT_name        : (indirect string, offset: 0x8ada9): XferM1CpltCallback
    <b8d>   DW_AT_decl_file   : 12
    <b8e>   DW_AT_decl_line   : 154
    <b8f>   DW_AT_decl_column : 33
    <b90>   DW_AT_type        : <0xc02>
    <b94>   DW_AT_data_member_location: 68
 <2><b95>: Abbrev Number: 14 (DW_TAG_member)
    <b96>   DW_AT_name        : (indirect string, offset: 0x8c4c3): XferM1HalfCpltCallback
    <b9a>   DW_AT_decl_file   : 12
    <b9b>   DW_AT_decl_line   : 156
    <b9c>   DW_AT_decl_column : 33
    <b9d>   DW_AT_type        : <0xc02>
    <ba1>   DW_AT_data_member_location: 72
 <2><ba2>: Abbrev Number: 14 (DW_TAG_member)
    <ba3>   DW_AT_name        : (indirect string, offset: 0x8a276): XferErrorCallback
    <ba7>   DW_AT_decl_file   : 12
    <ba8>   DW_AT_decl_line   : 158
    <ba9>   DW_AT_decl_column : 33
    <baa>   DW_AT_type        : <0xc02>
    <bae>   DW_AT_data_member_location: 76
 <2><baf>: Abbrev Number: 14 (DW_TAG_member)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x8e99b): XferAbortCallback
    <bb4>   DW_AT_decl_file   : 12
    <bb5>   DW_AT_decl_line   : 160
    <bb6>   DW_AT_decl_column : 33
    <bb7>   DW_AT_type        : <0xc02>
    <bbb>   DW_AT_data_member_location: 80
 <2><bbc>: Abbrev Number: 14 (DW_TAG_member)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x8ed88): ErrorCode
    <bc1>   DW_AT_decl_file   : 12
    <bc2>   DW_AT_decl_line   : 162
    <bc3>   DW_AT_decl_column : 30
    <bc4>   DW_AT_type        : <0x307>
    <bc8>   DW_AT_data_member_location: 84
 <2><bc9>: Abbrev Number: 14 (DW_TAG_member)
    <bca>   DW_AT_name        : (indirect string, offset: 0x8d758): StreamBaseAddress
    <bce>   DW_AT_decl_file   : 12
    <bcf>   DW_AT_decl_line   : 164
    <bd0>   DW_AT_decl_column : 30
    <bd1>   DW_AT_type        : <0x2fb>
    <bd5>   DW_AT_data_member_location: 88
 <2><bd6>: Abbrev Number: 14 (DW_TAG_member)
    <bd7>   DW_AT_name        : (indirect string, offset: 0x8dd3f): StreamIndex
    <bdb>   DW_AT_decl_file   : 12
    <bdc>   DW_AT_decl_line   : 166
    <bdd>   DW_AT_decl_column : 30
    <bde>   DW_AT_type        : <0x2fb>
    <be2>   DW_AT_data_member_location: 92
 <2><be3>: Abbrev Number: 0
 <1><be4>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <be5>   DW_AT_byte_size   : 4
    <be6>   DW_AT_type        : <0x383>
 <1><bea>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <beb>   DW_AT_byte_size   : 4
 <1><bec>: Abbrev Number: 9 (DW_TAG_const_type)
    <bed>   DW_AT_type        : <0xbea>
 <1><bf1>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <bf2>   DW_AT_prototyped  : 1
    <bf2>   DW_AT_sibling     : <0xbfc>
 <2><bf6>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <bf7>   DW_AT_type        : <0xbfc>
 <2><bfb>: Abbrev Number: 0
 <1><bfc>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <bfd>   DW_AT_byte_size   : 4
    <bfe>   DW_AT_type        : <0xb20>
 <1><c02>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <c03>   DW_AT_byte_size   : 4
    <c04>   DW_AT_type        : <0xbf1>
 <1><c08>: Abbrev Number: 6 (DW_TAG_typedef)
    <c09>   DW_AT_name        : (indirect string, offset: 0x8de49): DMA_HandleTypeDef
    <c0d>   DW_AT_decl_file   : 12
    <c0e>   DW_AT_decl_line   : 168
    <c0f>   DW_AT_decl_column : 2
    <c10>   DW_AT_type        : <0xb20>
 <1><c14>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c15>   DW_AT_byte_size   : 24
    <c16>   DW_AT_decl_file   : 13
    <c17>   DW_AT_decl_line   : 46
    <c18>   DW_AT_decl_column : 9
    <c19>   DW_AT_sibling     : <0xc6c>
 <2><c1d>: Abbrev Number: 14 (DW_TAG_member)
    <c1e>   DW_AT_name        : (indirect string, offset: 0x906cc): Prescaler
    <c22>   DW_AT_decl_file   : 13
    <c23>   DW_AT_decl_line   : 48
    <c24>   DW_AT_decl_column : 12
    <c25>   DW_AT_type        : <0x2fb>
    <c29>   DW_AT_data_member_location: 0
 <2><c2a>: Abbrev Number: 14 (DW_TAG_member)
    <c2b>   DW_AT_name        : (indirect string, offset: 0x8e7fa): CounterMode
    <c2f>   DW_AT_decl_file   : 13
    <c30>   DW_AT_decl_line   : 51
    <c31>   DW_AT_decl_column : 12
    <c32>   DW_AT_type        : <0x2fb>
    <c36>   DW_AT_data_member_location: 4
 <2><c37>: Abbrev Number: 14 (DW_TAG_member)
    <c38>   DW_AT_name        : (indirect string, offset: 0x95fb3): Period
    <c3c>   DW_AT_decl_file   : 13
    <c3d>   DW_AT_decl_line   : 54
    <c3e>   DW_AT_decl_column : 12
    <c3f>   DW_AT_type        : <0x2fb>
    <c43>   DW_AT_data_member_location: 8
 <2><c44>: Abbrev Number: 14 (DW_TAG_member)
    <c45>   DW_AT_name        : (indirect string, offset: 0x8b79a): ClockDivision
    <c49>   DW_AT_decl_file   : 13
    <c4a>   DW_AT_decl_line   : 58
    <c4b>   DW_AT_decl_column : 12
    <c4c>   DW_AT_type        : <0x2fb>
    <c50>   DW_AT_data_member_location: 12
 <2><c51>: Abbrev Number: 14 (DW_TAG_member)
    <c52>   DW_AT_name        : (indirect string, offset: 0x8d4b7): RepetitionCounter
    <c56>   DW_AT_decl_file   : 13
    <c57>   DW_AT_decl_line   : 61
    <c58>   DW_AT_decl_column : 12
    <c59>   DW_AT_type        : <0x2fb>
    <c5d>   DW_AT_data_member_location: 16
 <2><c5e>: Abbrev Number: 14 (DW_TAG_member)
    <c5f>   DW_AT_name        : (indirect string, offset: 0x8e906): AutoReloadPreload
    <c63>   DW_AT_decl_file   : 13
    <c64>   DW_AT_decl_line   : 72
    <c65>   DW_AT_decl_column : 12
    <c66>   DW_AT_type        : <0x2fb>
    <c6a>   DW_AT_data_member_location: 20
 <2><c6b>: Abbrev Number: 0
 <1><c6c>: Abbrev Number: 6 (DW_TAG_typedef)
    <c6d>   DW_AT_name        : (indirect string, offset: 0x8e26d): TIM_Base_InitTypeDef
    <c71>   DW_AT_decl_file   : 13
    <c72>   DW_AT_decl_line   : 74
    <c73>   DW_AT_decl_column : 3
    <c74>   DW_AT_type        : <0xc14>
 <1><c78>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c79>   DW_AT_byte_size   : 16
    <c7a>   DW_AT_decl_file   : 13
    <c7b>   DW_AT_decl_line   : 198
    <c7c>   DW_AT_decl_column : 9
    <c7d>   DW_AT_sibling     : <0xcb6>
 <2><c81>: Abbrev Number: 14 (DW_TAG_member)
    <c82>   DW_AT_name        : (indirect string, offset: 0x8a352): ClockSource
    <c86>   DW_AT_decl_file   : 13
    <c87>   DW_AT_decl_line   : 200
    <c88>   DW_AT_decl_column : 12
    <c89>   DW_AT_type        : <0x2fb>
    <c8d>   DW_AT_data_member_location: 0
 <2><c8e>: Abbrev Number: 14 (DW_TAG_member)
    <c8f>   DW_AT_name        : (indirect string, offset: 0x8c4da): ClockPolarity
    <c93>   DW_AT_decl_file   : 13
    <c94>   DW_AT_decl_line   : 202
    <c95>   DW_AT_decl_column : 12
    <c96>   DW_AT_type        : <0x2fb>
    <c9a>   DW_AT_data_member_location: 4
 <2><c9b>: Abbrev Number: 14 (DW_TAG_member)
    <c9c>   DW_AT_name        : (indirect string, offset: 0x8e122): ClockPrescaler
    <ca0>   DW_AT_decl_file   : 13
    <ca1>   DW_AT_decl_line   : 204
    <ca2>   DW_AT_decl_column : 12
    <ca3>   DW_AT_type        : <0x2fb>
    <ca7>   DW_AT_data_member_location: 8
 <2><ca8>: Abbrev Number: 14 (DW_TAG_member)
    <ca9>   DW_AT_name        : (indirect string, offset: 0x8ceda): ClockFilter
    <cad>   DW_AT_decl_file   : 13
    <cae>   DW_AT_decl_line   : 206
    <caf>   DW_AT_decl_column : 12
    <cb0>   DW_AT_type        : <0x2fb>
    <cb4>   DW_AT_data_member_location: 12
 <2><cb5>: Abbrev Number: 0
 <1><cb6>: Abbrev Number: 6 (DW_TAG_typedef)
    <cb7>   DW_AT_name        : (indirect string, offset: 0x89a86): TIM_ClockConfigTypeDef
    <cbb>   DW_AT_decl_file   : 13
    <cbc>   DW_AT_decl_line   : 208
    <cbd>   DW_AT_decl_column : 3
    <cbe>   DW_AT_type        : <0xc78>
 <1><cc2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cc3>   DW_AT_byte_size   : 8
    <cc4>   DW_AT_decl_file   : 13
    <cc5>   DW_AT_decl_line   : 231
    <cc6>   DW_AT_decl_column : 9
    <cc7>   DW_AT_sibling     : <0xce6>
 <2><ccb>: Abbrev Number: 14 (DW_TAG_member)
    <ccc>   DW_AT_name        : (indirect string, offset: 0x8c7a7): MasterOutputTrigger
    <cd0>   DW_AT_decl_file   : 13
    <cd1>   DW_AT_decl_line   : 233
    <cd2>   DW_AT_decl_column : 13
    <cd3>   DW_AT_type        : <0x2fb>
    <cd7>   DW_AT_data_member_location: 0
 <2><cd8>: Abbrev Number: 14 (DW_TAG_member)
    <cd9>   DW_AT_name        : (indirect string, offset: 0x8c2a8): MasterSlaveMode
    <cdd>   DW_AT_decl_file   : 13
    <cde>   DW_AT_decl_line   : 235
    <cdf>   DW_AT_decl_column : 13
    <ce0>   DW_AT_type        : <0x2fb>
    <ce4>   DW_AT_data_member_location: 4
 <2><ce5>: Abbrev Number: 0
 <1><ce6>: Abbrev Number: 6 (DW_TAG_typedef)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x8d5dd): TIM_MasterConfigTypeDef
    <ceb>   DW_AT_decl_file   : 13
    <cec>   DW_AT_decl_line   : 242
    <ced>   DW_AT_decl_column : 3
    <cee>   DW_AT_type        : <0xcc2>
 <1><cf2>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <cf3>   DW_AT_encoding    : 7	(unsigned)
    <cf4>   DW_AT_byte_size   : 1
    <cf5>   DW_AT_type        : <0x27d>
    <cf9>   DW_AT_decl_file   : 13
    <cfa>   DW_AT_decl_line   : 291
    <cfc>   DW_AT_decl_column : 1
    <cfd>   DW_AT_sibling     : <0xd20>
 <2><d01>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d02>   DW_AT_name        : (indirect string, offset: 0x8dff4): HAL_TIM_STATE_RESET
    <d06>   DW_AT_const_value : 0
 <2><d07>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d08>   DW_AT_name        : (indirect string, offset: 0x89aa9): HAL_TIM_STATE_READY
    <d0c>   DW_AT_const_value : 1
 <2><d0d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d0e>   DW_AT_name        : (indirect string, offset: 0x8ae21): HAL_TIM_STATE_BUSY
    <d12>   DW_AT_const_value : 2
 <2><d13>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d14>   DW_AT_name        : (indirect string, offset: 0x8dd1c): HAL_TIM_STATE_TIMEOUT
    <d18>   DW_AT_const_value : 3
 <2><d19>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x8b46e): HAL_TIM_STATE_ERROR
    <d1e>   DW_AT_const_value : 4
 <2><d1f>: Abbrev Number: 0
 <1><d20>: Abbrev Number: 18 (DW_TAG_typedef)
    <d21>   DW_AT_name        : (indirect string, offset: 0x8d601): HAL_TIM_StateTypeDef
    <d25>   DW_AT_decl_file   : 13
    <d26>   DW_AT_decl_line   : 297
    <d28>   DW_AT_decl_column : 3
    <d29>   DW_AT_type        : <0xcf2>
 <1><d2d>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <d2e>   DW_AT_type        : <0xd20>
 <1><d32>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <d33>   DW_AT_encoding    : 7	(unsigned)
    <d34>   DW_AT_byte_size   : 1
    <d35>   DW_AT_type        : <0x27d>
    <d39>   DW_AT_decl_file   : 13
    <d3a>   DW_AT_decl_line   : 303
    <d3c>   DW_AT_decl_column : 1
    <d3d>   DW_AT_sibling     : <0xd54>
 <2><d41>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d42>   DW_AT_name        : (indirect string, offset: 0x8d50a): HAL_TIM_CHANNEL_STATE_RESET
    <d46>   DW_AT_const_value : 0
 <2><d47>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d48>   DW_AT_name        : (indirect string, offset: 0x8d840): HAL_TIM_CHANNEL_STATE_READY
    <d4c>   DW_AT_const_value : 1
 <2><d4d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d4e>   DW_AT_name        : (indirect string, offset: 0x8ec08): HAL_TIM_CHANNEL_STATE_BUSY
    <d52>   DW_AT_const_value : 2
 <2><d53>: Abbrev Number: 0
 <1><d54>: Abbrev Number: 18 (DW_TAG_typedef)
    <d55>   DW_AT_name        : (indirect string, offset: 0x8ab24): HAL_TIM_ChannelStateTypeDef
    <d59>   DW_AT_decl_file   : 13
    <d5a>   DW_AT_decl_line   : 307
    <d5c>   DW_AT_decl_column : 3
    <d5d>   DW_AT_type        : <0xd32>
 <1><d61>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <d62>   DW_AT_type        : <0xd54>
 <1><d66>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <d67>   DW_AT_encoding    : 7	(unsigned)
    <d68>   DW_AT_byte_size   : 1
    <d69>   DW_AT_type        : <0x27d>
    <d6d>   DW_AT_decl_file   : 13
    <d6e>   DW_AT_decl_line   : 313
    <d70>   DW_AT_decl_column : 1
    <d71>   DW_AT_sibling     : <0xd88>
 <2><d75>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d76>   DW_AT_name        : (indirect string, offset: 0x899d1): HAL_DMA_BURST_STATE_RESET
    <d7a>   DW_AT_const_value : 0
 <2><d7b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x8c489): HAL_DMA_BURST_STATE_READY
    <d80>   DW_AT_const_value : 1
 <2><d81>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d82>   DW_AT_name        : (indirect string, offset: 0x8b32e): HAL_DMA_BURST_STATE_BUSY
    <d86>   DW_AT_const_value : 2
 <2><d87>: Abbrev Number: 0
 <1><d88>: Abbrev Number: 18 (DW_TAG_typedef)
    <d89>   DW_AT_name        : (indirect string, offset: 0x8a208): HAL_TIM_DMABurstStateTypeDef
    <d8d>   DW_AT_decl_file   : 13
    <d8e>   DW_AT_decl_line   : 317
    <d90>   DW_AT_decl_column : 3
    <d91>   DW_AT_type        : <0xd66>
 <1><d95>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <d96>   DW_AT_type        : <0xd88>
 <1><d9a>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <d9b>   DW_AT_encoding    : 7	(unsigned)
    <d9c>   DW_AT_byte_size   : 1
    <d9d>   DW_AT_type        : <0x27d>
    <da1>   DW_AT_decl_file   : 13
    <da2>   DW_AT_decl_line   : 323
    <da4>   DW_AT_decl_column : 1
    <da5>   DW_AT_sibling     : <0xdc8>
 <2><da9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <daa>   DW_AT_name        : (indirect string, offset: 0x8c531): HAL_TIM_ACTIVE_CHANNEL_1
    <dae>   DW_AT_const_value : 1
 <2><daf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <db0>   DW_AT_name        : (indirect string, offset: 0x8c54a): HAL_TIM_ACTIVE_CHANNEL_2
    <db4>   DW_AT_const_value : 2
 <2><db5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0x8c563): HAL_TIM_ACTIVE_CHANNEL_3
    <dba>   DW_AT_const_value : 4
 <2><dbb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x8c57c): HAL_TIM_ACTIVE_CHANNEL_4
    <dc0>   DW_AT_const_value : 8
 <2><dc1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x8b815): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <dc6>   DW_AT_const_value : 0
 <2><dc7>: Abbrev Number: 0
 <1><dc8>: Abbrev Number: 18 (DW_TAG_typedef)
    <dc9>   DW_AT_name        : (indirect string, offset: 0x8c243): HAL_TIM_ActiveChannel
    <dcd>   DW_AT_decl_file   : 13
    <dce>   DW_AT_decl_line   : 329
    <dd0>   DW_AT_decl_column : 3
    <dd1>   DW_AT_type        : <0xd9a>
 <1><dd5>: Abbrev Number: 15 (DW_TAG_structure_type)
    <dd6>   DW_AT_byte_size   : 72
    <dd7>   DW_AT_decl_file   : 13
    <dd8>   DW_AT_decl_line   : 337
    <dda>   DW_AT_decl_column : 9
    <ddb>   DW_AT_sibling     : <0xe5e>
 <2><ddf>: Abbrev Number: 16 (DW_TAG_member)
    <de0>   DW_AT_name        : (indirect string, offset: 0x8b6e4): Instance
    <de4>   DW_AT_decl_file   : 13
    <de5>   DW_AT_decl_line   : 340
    <de7>   DW_AT_decl_column : 39
    <de8>   DW_AT_type        : <0xe5e>
    <dec>   DW_AT_data_member_location: 0
 <2><ded>: Abbrev Number: 16 (DW_TAG_member)
    <dee>   DW_AT_name        : (indirect string, offset: 0x8a108): Init
    <df2>   DW_AT_decl_file   : 13
    <df3>   DW_AT_decl_line   : 341
    <df5>   DW_AT_decl_column : 38
    <df6>   DW_AT_type        : <0xc6c>
    <dfa>   DW_AT_data_member_location: 4
 <2><dfb>: Abbrev Number: 16 (DW_TAG_member)
    <dfc>   DW_AT_name        : (indirect string, offset: 0x8c251): Channel
    <e00>   DW_AT_decl_file   : 13
    <e01>   DW_AT_decl_line   : 342
    <e03>   DW_AT_decl_column : 38
    <e04>   DW_AT_type        : <0xdc8>
    <e08>   DW_AT_data_member_location: 28
 <2><e09>: Abbrev Number: 16 (DW_TAG_member)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x8c89f): hdma
    <e0e>   DW_AT_decl_file   : 13
    <e0f>   DW_AT_decl_line   : 343
    <e11>   DW_AT_decl_column : 39
    <e12>   DW_AT_type        : <0xe64>
    <e16>   DW_AT_data_member_location: 32
 <2><e17>: Abbrev Number: 16 (DW_TAG_member)
    <e18>   DW_AT_name        : (indirect string, offset: 0x46229): Lock
    <e1c>   DW_AT_decl_file   : 13
    <e1d>   DW_AT_decl_line   : 345
    <e1f>   DW_AT_decl_column : 38
    <e20>   DW_AT_type        : <0x874>
    <e24>   DW_AT_data_member_location: 60
 <2><e25>: Abbrev Number: 16 (DW_TAG_member)
    <e26>   DW_AT_name        : (indirect string, offset: 0x8d1c0): State
    <e2a>   DW_AT_decl_file   : 13
    <e2b>   DW_AT_decl_line   : 346
    <e2d>   DW_AT_decl_column : 38
    <e2e>   DW_AT_type        : <0xd2d>
    <e32>   DW_AT_data_member_location: 61
 <2><e33>: Abbrev Number: 16 (DW_TAG_member)
    <e34>   DW_AT_name        : (indirect string, offset: 0x90e9b): ChannelState
    <e38>   DW_AT_decl_file   : 13
    <e39>   DW_AT_decl_line   : 347
    <e3b>   DW_AT_decl_column : 38
    <e3c>   DW_AT_type        : <0xe8a>
    <e40>   DW_AT_data_member_location: 62
 <2><e41>: Abbrev Number: 16 (DW_TAG_member)
    <e42>   DW_AT_name        : (indirect string, offset: 0x913e3): ChannelNState
    <e46>   DW_AT_decl_file   : 13
    <e47>   DW_AT_decl_line   : 348
    <e49>   DW_AT_decl_column : 38
    <e4a>   DW_AT_type        : <0xe8a>
    <e4e>   DW_AT_data_member_location: 66
 <2><e4f>: Abbrev Number: 16 (DW_TAG_member)
    <e50>   DW_AT_name        : (indirect string, offset: 0x9054a): DMABurstState
    <e54>   DW_AT_decl_file   : 13
    <e55>   DW_AT_decl_line   : 349
    <e57>   DW_AT_decl_column : 38
    <e58>   DW_AT_type        : <0xd95>
    <e5c>   DW_AT_data_member_location: 70
 <2><e5d>: Abbrev Number: 0
 <1><e5e>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <e5f>   DW_AT_byte_size   : 4
    <e60>   DW_AT_type        : <0x773>
 <1><e64>: Abbrev Number: 10 (DW_TAG_array_type)
    <e65>   DW_AT_type        : <0xe74>
    <e69>   DW_AT_sibling     : <0xe74>
 <2><e6d>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <e6e>   DW_AT_type        : <0x2cd>
    <e72>   DW_AT_upper_bound : 6
 <2><e73>: Abbrev Number: 0
 <1><e74>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <e75>   DW_AT_byte_size   : 4
    <e76>   DW_AT_type        : <0xc08>
 <1><e7a>: Abbrev Number: 10 (DW_TAG_array_type)
    <e7b>   DW_AT_type        : <0xd61>
    <e7f>   DW_AT_sibling     : <0xe8a>
 <2><e83>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <e84>   DW_AT_type        : <0x2cd>
    <e88>   DW_AT_upper_bound : 3
 <2><e89>: Abbrev Number: 0
 <1><e8a>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <e8b>   DW_AT_type        : <0xe7a>
 <1><e8f>: Abbrev Number: 18 (DW_TAG_typedef)
    <e90>   DW_AT_name        : (indirect string, offset: 0x8b381): TIM_HandleTypeDef
    <e94>   DW_AT_decl_file   : 13
    <e95>   DW_AT_decl_line   : 380
    <e97>   DW_AT_decl_column : 3
    <e98>   DW_AT_type        : <0xdd5>
 <1><e9c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <e9d>   DW_AT_byte_size   : 28
    <e9e>   DW_AT_decl_file   : 14
    <e9f>   DW_AT_decl_line   : 46
    <ea0>   DW_AT_decl_column : 9
    <ea1>   DW_AT_sibling     : <0xf01>
 <2><ea5>: Abbrev Number: 14 (DW_TAG_member)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x8e88c): BaudRate
    <eaa>   DW_AT_decl_file   : 14
    <eab>   DW_AT_decl_line   : 48
    <eac>   DW_AT_decl_column : 12
    <ead>   DW_AT_type        : <0x2fb>
    <eb1>   DW_AT_data_member_location: 0
 <2><eb2>: Abbrev Number: 14 (DW_TAG_member)
    <eb3>   DW_AT_name        : (indirect string, offset: 0x89a5d): WordLength
    <eb7>   DW_AT_decl_file   : 14
    <eb8>   DW_AT_decl_line   : 54
    <eb9>   DW_AT_decl_column : 12
    <eba>   DW_AT_type        : <0x2fb>
    <ebe>   DW_AT_data_member_location: 4
 <2><ebf>: Abbrev Number: 14 (DW_TAG_member)
    <ec0>   DW_AT_name        : (indirect string, offset: 0x8e895): StopBits
    <ec4>   DW_AT_decl_file   : 14
    <ec5>   DW_AT_decl_line   : 57
    <ec6>   DW_AT_decl_column : 12
    <ec7>   DW_AT_type        : <0x2fb>
    <ecb>   DW_AT_data_member_location: 8
 <2><ecc>: Abbrev Number: 14 (DW_TAG_member)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x8b446): Parity
    <ed1>   DW_AT_decl_file   : 14
    <ed2>   DW_AT_decl_line   : 60
    <ed3>   DW_AT_decl_column : 12
    <ed4>   DW_AT_type        : <0x2fb>
    <ed8>   DW_AT_data_member_location: 12
 <2><ed9>: Abbrev Number: 14 (DW_TAG_member)
    <eda>   DW_AT_name        : (indirect string, offset: 0x90457): Mode
    <ede>   DW_AT_decl_file   : 14
    <edf>   DW_AT_decl_line   : 67
    <ee0>   DW_AT_decl_column : 12
    <ee1>   DW_AT_type        : <0x2fb>
    <ee5>   DW_AT_data_member_location: 16
 <2><ee6>: Abbrev Number: 14 (DW_TAG_member)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x8a10d): HwFlowCtl
    <eeb>   DW_AT_decl_file   : 14
    <eec>   DW_AT_decl_line   : 70
    <eed>   DW_AT_decl_column : 12
    <eee>   DW_AT_type        : <0x2fb>
    <ef2>   DW_AT_data_member_location: 20
 <2><ef3>: Abbrev Number: 14 (DW_TAG_member)
    <ef4>   DW_AT_name        : (indirect string, offset: 0x8dd32): OverSampling
    <ef8>   DW_AT_decl_file   : 14
    <ef9>   DW_AT_decl_line   : 73
    <efa>   DW_AT_decl_column : 12
    <efb>   DW_AT_type        : <0x2fb>
    <eff>   DW_AT_data_member_location: 24
 <2><f00>: Abbrev Number: 0
 <1><f01>: Abbrev Number: 6 (DW_TAG_typedef)
    <f02>   DW_AT_name        : (indirect string, offset: 0x8b00d): UART_InitTypeDef
    <f06>   DW_AT_decl_file   : 14
    <f07>   DW_AT_decl_line   : 75
    <f08>   DW_AT_decl_column : 3
    <f09>   DW_AT_type        : <0xe9c>
 <1><f0d>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <f0e>   DW_AT_encoding    : 7	(unsigned)
    <f0f>   DW_AT_byte_size   : 1
    <f10>   DW_AT_type        : <0x27d>
    <f14>   DW_AT_decl_file   : 14
    <f15>   DW_AT_decl_line   : 117
    <f16>   DW_AT_decl_column : 1
    <f17>   DW_AT_sibling     : <0xf4c>
 <2><f1b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f1c>   DW_AT_name        : (indirect string, offset: 0x8c792): HAL_UART_STATE_RESET
    <f20>   DW_AT_const_value : 0
 <2><f21>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f22>   DW_AT_name        : (indirect string, offset: 0x8a0d9): HAL_UART_STATE_READY
    <f26>   DW_AT_const_value : 32
 <2><f27>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f28>   DW_AT_name        : (indirect string, offset: 0x8e181): HAL_UART_STATE_BUSY
    <f2c>   DW_AT_const_value : 36
 <2><f2d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f2e>   DW_AT_name        : (indirect string, offset: 0x898db): HAL_UART_STATE_BUSY_TX
    <f32>   DW_AT_const_value : 33
 <2><f33>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f34>   DW_AT_name        : (indirect string, offset: 0x898a6): HAL_UART_STATE_BUSY_RX
    <f38>   DW_AT_const_value : 34
 <2><f39>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f3a>   DW_AT_name        : (indirect string, offset: 0x8ac33): HAL_UART_STATE_BUSY_TX_RX
    <f3e>   DW_AT_const_value : 35
 <2><f3f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f40>   DW_AT_name        : (indirect string, offset: 0x8bdfc): HAL_UART_STATE_TIMEOUT
    <f44>   DW_AT_const_value : 160
 <2><f45>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f46>   DW_AT_name        : (indirect string, offset: 0x8d472): HAL_UART_STATE_ERROR
    <f4a>   DW_AT_const_value : 224
 <2><f4b>: Abbrev Number: 0
 <1><f4c>: Abbrev Number: 6 (DW_TAG_typedef)
    <f4d>   DW_AT_name        : (indirect string, offset: 0x8b180): HAL_UART_StateTypeDef
    <f51>   DW_AT_decl_file   : 14
    <f52>   DW_AT_decl_line   : 135
    <f53>   DW_AT_decl_column : 3
    <f54>   DW_AT_type        : <0xf0d>
 <1><f58>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <f59>   DW_AT_type        : <0xf4c>
 <1><f5d>: Abbrev Number: 6 (DW_TAG_typedef)
    <f5e>   DW_AT_name        : (indirect string, offset: 0x8b7c8): HAL_UART_RxTypeTypeDef
    <f62>   DW_AT_decl_file   : 14
    <f63>   DW_AT_decl_line   : 144
    <f64>   DW_AT_decl_column : 18
    <f65>   DW_AT_type        : <0x2fb>
 <1><f69>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <f6a>   DW_AT_type        : <0xf5d>
 <1><f6e>: Abbrev Number: 20 (DW_TAG_structure_type)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x8c716): __UART_HandleTypeDef
    <f73>   DW_AT_byte_size   : 68
    <f74>   DW_AT_decl_file   : 14
    <f75>   DW_AT_decl_line   : 149
    <f76>   DW_AT_decl_column : 16
    <f77>   DW_AT_sibling     : <0x103f>
 <2><f7b>: Abbrev Number: 14 (DW_TAG_member)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x8b6e4): Instance
    <f80>   DW_AT_decl_file   : 14
    <f81>   DW_AT_decl_line   : 151
    <f82>   DW_AT_decl_column : 34
    <f83>   DW_AT_type        : <0x103f>
    <f87>   DW_AT_data_member_location: 0
 <2><f88>: Abbrev Number: 14 (DW_TAG_member)
    <f89>   DW_AT_name        : (indirect string, offset: 0x8a108): Init
    <f8d>   DW_AT_decl_file   : 14
    <f8e>   DW_AT_decl_line   : 153
    <f8f>   DW_AT_decl_column : 33
    <f90>   DW_AT_type        : <0xf01>
    <f94>   DW_AT_data_member_location: 4
 <2><f95>: Abbrev Number: 14 (DW_TAG_member)
    <f96>   DW_AT_name        : (indirect string, offset: 0x8bddb): pTxBuffPtr
    <f9a>   DW_AT_decl_file   : 14
    <f9b>   DW_AT_decl_line   : 155
    <f9c>   DW_AT_decl_column : 34
    <f9d>   DW_AT_type        : <0x1045>
    <fa1>   DW_AT_data_member_location: 32
 <2><fa2>: Abbrev Number: 14 (DW_TAG_member)
    <fa3>   DW_AT_name        : (indirect string, offset: 0x89a68): TxXferSize
    <fa7>   DW_AT_decl_file   : 14
    <fa8>   DW_AT_decl_line   : 157
    <fa9>   DW_AT_decl_column : 33
    <faa>   DW_AT_type        : <0x2ea>
    <fae>   DW_AT_data_member_location: 36
 <2><faf>: Abbrev Number: 14 (DW_TAG_member)
    <fb0>   DW_AT_name        : (indirect string, offset: 0x8bdf0): TxXferCount
    <fb4>   DW_AT_decl_file   : 14
    <fb5>   DW_AT_decl_line   : 159
    <fb6>   DW_AT_decl_column : 33
    <fb7>   DW_AT_type        : <0x2f6>
    <fbb>   DW_AT_data_member_location: 38
 <2><fbc>: Abbrev Number: 14 (DW_TAG_member)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x8e978): pRxBuffPtr
    <fc1>   DW_AT_decl_file   : 14
    <fc2>   DW_AT_decl_line   : 161
    <fc3>   DW_AT_decl_column : 34
    <fc4>   DW_AT_type        : <0x104b>
    <fc8>   DW_AT_data_member_location: 40
 <2><fc9>: Abbrev Number: 14 (DW_TAG_member)
    <fca>   DW_AT_name        : (indirect string, offset: 0x8c02d): RxXferSize
    <fce>   DW_AT_decl_file   : 14
    <fcf>   DW_AT_decl_line   : 163
    <fd0>   DW_AT_decl_column : 33
    <fd1>   DW_AT_type        : <0x2ea>
    <fd5>   DW_AT_data_member_location: 44
 <2><fd6>: Abbrev Number: 14 (DW_TAG_member)
    <fd7>   DW_AT_name        : (indirect string, offset: 0x8c8a4): RxXferCount
    <fdb>   DW_AT_decl_file   : 14
    <fdc>   DW_AT_decl_line   : 165
    <fdd>   DW_AT_decl_column : 33
    <fde>   DW_AT_type        : <0x2f6>
    <fe2>   DW_AT_data_member_location: 46
 <2><fe3>: Abbrev Number: 14 (DW_TAG_member)
    <fe4>   DW_AT_name        : (indirect string, offset: 0x8dcf5): ReceptionType
    <fe8>   DW_AT_decl_file   : 14
    <fe9>   DW_AT_decl_line   : 167
    <fea>   DW_AT_decl_column : 31
    <feb>   DW_AT_type        : <0xf69>
    <fef>   DW_AT_data_member_location: 48
 <2><ff0>: Abbrev Number: 14 (DW_TAG_member)
    <ff1>   DW_AT_name        : (indirect string, offset: 0x8ed4c): hdmatx
    <ff5>   DW_AT_decl_file   : 14
    <ff6>   DW_AT_decl_line   : 169
    <ff7>   DW_AT_decl_column : 34
    <ff8>   DW_AT_type        : <0xe74>
    <ffc>   DW_AT_data_member_location: 52
 <2><ffd>: Abbrev Number: 14 (DW_TAG_member)
    <ffe>   DW_AT_name        : (indirect string, offset: 0x8ed0b): hdmarx
    <1002>   DW_AT_decl_file   : 14
    <1003>   DW_AT_decl_line   : 171
    <1004>   DW_AT_decl_column : 34
    <1005>   DW_AT_type        : <0xe74>
    <1009>   DW_AT_data_member_location: 56
 <2><100a>: Abbrev Number: 14 (DW_TAG_member)
    <100b>   DW_AT_name        : (indirect string, offset: 0x46229): Lock
    <100f>   DW_AT_decl_file   : 14
    <1010>   DW_AT_decl_line   : 173
    <1011>   DW_AT_decl_column : 33
    <1012>   DW_AT_type        : <0x874>
    <1016>   DW_AT_data_member_location: 60
 <2><1017>: Abbrev Number: 14 (DW_TAG_member)
    <1018>   DW_AT_name        : (indirect string, offset: 0x8b793): gState
    <101c>   DW_AT_decl_file   : 14
    <101d>   DW_AT_decl_line   : 175
    <101e>   DW_AT_decl_column : 33
    <101f>   DW_AT_type        : <0xf58>
    <1023>   DW_AT_data_member_location: 61
 <2><1024>: Abbrev Number: 14 (DW_TAG_member)
    <1025>   DW_AT_name        : (indirect string, offset: 0x8e2d8): RxState
    <1029>   DW_AT_decl_file   : 14
    <102a>   DW_AT_decl_line   : 179
    <102b>   DW_AT_decl_column : 33
    <102c>   DW_AT_type        : <0xf58>
    <1030>   DW_AT_data_member_location: 62
 <2><1031>: Abbrev Number: 14 (DW_TAG_member)
    <1032>   DW_AT_name        : (indirect string, offset: 0x8ed88): ErrorCode
    <1036>   DW_AT_decl_file   : 14
    <1037>   DW_AT_decl_line   : 182
    <1038>   DW_AT_decl_column : 33
    <1039>   DW_AT_type        : <0x307>
    <103d>   DW_AT_data_member_location: 64
 <2><103e>: Abbrev Number: 0
 <1><103f>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1040>   DW_AT_byte_size   : 4
    <1041>   DW_AT_type        : <0x7eb>
 <1><1045>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1046>   DW_AT_byte_size   : 4
    <1047>   DW_AT_type        : <0x2e5>
 <1><104b>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <104c>   DW_AT_byte_size   : 4
    <104d>   DW_AT_type        : <0x2d4>
 <1><1051>: Abbrev Number: 6 (DW_TAG_typedef)
    <1052>   DW_AT_name        : (indirect string, offset: 0x8c718): UART_HandleTypeDef
    <1056>   DW_AT_decl_file   : 14
    <1057>   DW_AT_decl_line   : 200
    <1058>   DW_AT_decl_column : 3
    <1059>   DW_AT_type        : <0xf6e>
 <1><105d>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <105e>   DW_AT_byte_size   : 4
    <105f>   DW_AT_type        : <0x1063>
 <1><1063>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <1064>   DW_AT_prototyped  : 1
    <1064>   DW_AT_sibling     : <0x106e>
 <2><1068>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <1069>   DW_AT_type        : <0xbea>
 <2><106d>: Abbrev Number: 0
 <1><106e>: Abbrev Number: 6 (DW_TAG_typedef)
    <106f>   DW_AT_name        : (indirect string, offset: 0x8e8c0): BaseType_t
    <1073>   DW_AT_decl_file   : 15
    <1074>   DW_AT_decl_line   : 56
    <1075>   DW_AT_decl_column : 14
    <1076>   DW_AT_type        : <0x29e>
 <1><107a>: Abbrev Number: 9 (DW_TAG_const_type)
    <107b>   DW_AT_type        : <0x106e>
 <1><107f>: Abbrev Number: 6 (DW_TAG_typedef)
    <1080>   DW_AT_name        : (indirect string, offset: 0x8e8bf): UBaseType_t
    <1084>   DW_AT_decl_file   : 15
    <1085>   DW_AT_decl_line   : 57
    <1086>   DW_AT_decl_column : 23
    <1087>   DW_AT_type        : <0x2b1>
 <1><108b>: Abbrev Number: 9 (DW_TAG_const_type)
    <108c>   DW_AT_type        : <0x107f>
 <1><1090>: Abbrev Number: 6 (DW_TAG_typedef)
    <1091>   DW_AT_name        : (indirect string, offset: 0x38cff): TickType_t
    <1095>   DW_AT_decl_file   : 15
    <1096>   DW_AT_decl_line   : 63
    <1097>   DW_AT_decl_column : 19
    <1098>   DW_AT_type        : <0x2fb>
 <1><109c>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <109d>   DW_AT_byte_size   : 4
    <109e>   DW_AT_type        : <0x10a9>
 <1><10a2>: Abbrev Number: 5 (DW_TAG_base_type)
    <10a3>   DW_AT_byte_size   : 1
    <10a4>   DW_AT_encoding    : 8	(unsigned char)
    <10a5>   DW_AT_name        : (indirect string, offset: 0x3a5d2): char
 <1><10a9>: Abbrev Number: 9 (DW_TAG_const_type)
    <10aa>   DW_AT_type        : <0x10a2>
 <1><10ae>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <10af>   DW_AT_encoding    : 5	(signed)
    <10b0>   DW_AT_byte_size   : 4
    <10b1>   DW_AT_type        : <0x2c6>
    <10b5>   DW_AT_decl_file   : 16
    <10b6>   DW_AT_decl_line   : 82
    <10b7>   DW_AT_decl_column : 14
    <10b8>   DW_AT_sibling     : <0x11fe>
 <2><10bc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10bd>   DW_AT_name        : (indirect string, offset: 0x89d83): osPriorityNone
    <10c1>   DW_AT_const_value : 0
 <2><10c2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10c3>   DW_AT_name        : (indirect string, offset: 0x8dfcc): osPriorityIdle
    <10c7>   DW_AT_const_value : 1
 <2><10c8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10c9>   DW_AT_name        : (indirect string, offset: 0x8e8eb): osPriorityLow
    <10cd>   DW_AT_const_value : 8
 <2><10ce>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10cf>   DW_AT_name        : (indirect string, offset: 0x8ebcc): osPriorityLow1
    <10d3>   DW_AT_const_value : 9
 <2><10d4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10d5>   DW_AT_name        : (indirect string, offset: 0x8ebdb): osPriorityLow2
    <10d9>   DW_AT_const_value : 10
 <2><10da>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10db>   DW_AT_name        : (indirect string, offset: 0x8b512): osPriorityLow3
    <10df>   DW_AT_const_value : 11
 <2><10e0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10e1>   DW_AT_name        : (indirect string, offset: 0x8ebea): osPriorityLow4
    <10e5>   DW_AT_const_value : 12
 <2><10e6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10e7>   DW_AT_name        : (indirect string, offset: 0x8b521): osPriorityLow5
    <10eb>   DW_AT_const_value : 13
 <2><10ec>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10ed>   DW_AT_name        : (indirect string, offset: 0x8ebf9): osPriorityLow6
    <10f1>   DW_AT_const_value : 14
 <2><10f2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10f3>   DW_AT_name        : (indirect string, offset: 0x8da6a): osPriorityLow7
    <10f7>   DW_AT_const_value : 15
 <2><10f8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10f9>   DW_AT_name        : (indirect string, offset: 0x8ece7): osPriorityBelowNormal
    <10fd>   DW_AT_const_value : 16
 <2><10fe>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10ff>   DW_AT_name        : (indirect string, offset: 0x8d7f4): osPriorityBelowNormal1
    <1103>   DW_AT_const_value : 17
 <2><1104>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1105>   DW_AT_name        : (indirect string, offset: 0x8dd93): osPriorityBelowNormal2
    <1109>   DW_AT_const_value : 18
 <2><110a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <110b>   DW_AT_name        : (indirect string, offset: 0x8d80b): osPriorityBelowNormal3
    <110f>   DW_AT_const_value : 19
 <2><1110>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1111>   DW_AT_name        : (indirect string, offset: 0x8ddaa): osPriorityBelowNormal4
    <1115>   DW_AT_const_value : 20
 <2><1116>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1117>   DW_AT_name        : (indirect string, offset: 0x8ddc1): osPriorityBelowNormal5
    <111b>   DW_AT_const_value : 21
 <2><111c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <111d>   DW_AT_name        : (indirect string, offset: 0x8ddd8): osPriorityBelowNormal6
    <1121>   DW_AT_const_value : 22
 <2><1122>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1123>   DW_AT_name        : (indirect string, offset: 0x8ddef): osPriorityBelowNormal7
    <1127>   DW_AT_const_value : 23
 <2><1128>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1129>   DW_AT_name        : (indirect string, offset: 0x8a1e4): osPriorityNormal
    <112d>   DW_AT_const_value : 24
 <2><112e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <112f>   DW_AT_name        : (indirect string, offset: 0x8a588): osPriorityNormal1
    <1133>   DW_AT_const_value : 25
 <2><1134>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1135>   DW_AT_name        : (indirect string, offset: 0x8a59a): osPriorityNormal2
    <1139>   DW_AT_const_value : 26
 <2><113a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <113b>   DW_AT_name        : (indirect string, offset: 0x8a5ac): osPriorityNormal3
    <113f>   DW_AT_const_value : 27
 <2><1140>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1141>   DW_AT_name        : (indirect string, offset: 0x8a5be): osPriorityNormal4
    <1145>   DW_AT_const_value : 28
 <2><1146>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1147>   DW_AT_name        : (indirect string, offset: 0x8a5d0): osPriorityNormal5
    <114b>   DW_AT_const_value : 29
 <2><114c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <114d>   DW_AT_name        : (indirect string, offset: 0x8a5e2): osPriorityNormal6
    <1151>   DW_AT_const_value : 30
 <2><1152>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1153>   DW_AT_name        : (indirect string, offset: 0x8a5f4): osPriorityNormal7
    <1157>   DW_AT_const_value : 31
 <2><1158>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1159>   DW_AT_name        : (indirect string, offset: 0x8ce8b): osPriorityAboveNormal
    <115d>   DW_AT_const_value : 32
 <2><115e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <115f>   DW_AT_name        : (indirect string, offset: 0x8dbf6): osPriorityAboveNormal1
    <1163>   DW_AT_const_value : 33
 <2><1164>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1165>   DW_AT_name        : (indirect string, offset: 0x8ef59): osPriorityAboveNormal2
    <1169>   DW_AT_const_value : 34
 <2><116a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <116b>   DW_AT_name        : (indirect string, offset: 0x8e15a): osPriorityAboveNormal3
    <116f>   DW_AT_const_value : 35
 <2><1170>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1171>   DW_AT_name        : (indirect string, offset: 0x8ef70): osPriorityAboveNormal4
    <1175>   DW_AT_const_value : 36
 <2><1176>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1177>   DW_AT_name        : (indirect string, offset: 0x8ef87): osPriorityAboveNormal5
    <117b>   DW_AT_const_value : 37
 <2><117c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <117d>   DW_AT_name        : (indirect string, offset: 0x8ef9e): osPriorityAboveNormal6
    <1181>   DW_AT_const_value : 38
 <2><1182>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1183>   DW_AT_name        : (indirect string, offset: 0x8efb5): osPriorityAboveNormal7
    <1187>   DW_AT_const_value : 39
 <2><1188>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1189>   DW_AT_name        : (indirect string, offset: 0x8b40b): osPriorityHigh
    <118d>   DW_AT_const_value : 40
 <2><118e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <118f>   DW_AT_name        : (indirect string, offset: 0x8d065): osPriorityHigh1
    <1193>   DW_AT_const_value : 41
 <2><1194>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1195>   DW_AT_name        : (indirect string, offset: 0x8d075): osPriorityHigh2
    <1199>   DW_AT_const_value : 42
 <2><119a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <119b>   DW_AT_name        : (indirect string, offset: 0x8d085): osPriorityHigh3
    <119f>   DW_AT_const_value : 43
 <2><11a0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11a1>   DW_AT_name        : (indirect string, offset: 0x8d095): osPriorityHigh4
    <11a5>   DW_AT_const_value : 44
 <2><11a6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11a7>   DW_AT_name        : (indirect string, offset: 0x899c1): osPriorityHigh5
    <11ab>   DW_AT_const_value : 45
 <2><11ac>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11ad>   DW_AT_name        : (indirect string, offset: 0x8d0a5): osPriorityHigh6
    <11b1>   DW_AT_const_value : 46
 <2><11b2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11b3>   DW_AT_name        : (indirect string, offset: 0x8d0b5): osPriorityHigh7
    <11b7>   DW_AT_const_value : 47
 <2><11b8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11b9>   DW_AT_name        : (indirect string, offset: 0x8e6bb): osPriorityRealtime
    <11bd>   DW_AT_const_value : 48
 <2><11be>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11bf>   DW_AT_name        : (indirect string, offset: 0x8cb60): osPriorityRealtime1
    <11c3>   DW_AT_const_value : 49
 <2><11c4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11c5>   DW_AT_name        : (indirect string, offset: 0x8cb74): osPriorityRealtime2
    <11c9>   DW_AT_const_value : 50
 <2><11ca>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11cb>   DW_AT_name        : (indirect string, offset: 0x8cb88): osPriorityRealtime3
    <11cf>   DW_AT_const_value : 51
 <2><11d0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11d1>   DW_AT_name        : (indirect string, offset: 0x8cb9c): osPriorityRealtime4
    <11d5>   DW_AT_const_value : 52
 <2><11d6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11d7>   DW_AT_name        : (indirect string, offset: 0x8cbb0): osPriorityRealtime5
    <11db>   DW_AT_const_value : 53
 <2><11dc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11dd>   DW_AT_name        : (indirect string, offset: 0x8cbc4): osPriorityRealtime6
    <11e1>   DW_AT_const_value : 54
 <2><11e2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11e3>   DW_AT_name        : (indirect string, offset: 0x8cbd8): osPriorityRealtime7
    <11e7>   DW_AT_const_value : 55
 <2><11e8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11e9>   DW_AT_name        : (indirect string, offset: 0x8c50e): osPriorityISR
    <11ed>   DW_AT_const_value : 56
 <2><11ee>: Abbrev Number: 3 (DW_TAG_enumerator)
    <11ef>   DW_AT_name        : (indirect string, offset: 0x8e14a): osPriorityError
    <11f3>   DW_AT_const_value : -1
 <2><11f4>: Abbrev Number: 26 (DW_TAG_enumerator)
    <11f5>   DW_AT_name        : (indirect string, offset: 0x8ec32): osPriorityReserved
    <11f9>   DW_AT_const_value : 0x7fffffff
 <2><11fd>: Abbrev Number: 0
 <1><11fe>: Abbrev Number: 6 (DW_TAG_typedef)
    <11ff>   DW_AT_name        : (indirect string, offset: 0x8e98e): osPriority_t
    <1203>   DW_AT_decl_file   : 16
    <1204>   DW_AT_decl_line   : 136
    <1205>   DW_AT_decl_column : 3
    <1206>   DW_AT_type        : <0x10ae>
 <1><120a>: Abbrev Number: 6 (DW_TAG_typedef)
    <120b>   DW_AT_name        : (indirect string, offset: 0x8c394): osThreadFunc_t
    <120f>   DW_AT_decl_file   : 16
    <1210>   DW_AT_decl_line   : 139
    <1211>   DW_AT_decl_column : 16
    <1212>   DW_AT_type        : <0x105d>
 <1><1216>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <1217>   DW_AT_encoding    : 5	(signed)
    <1218>   DW_AT_byte_size   : 4
    <1219>   DW_AT_type        : <0x2c6>
    <121d>   DW_AT_decl_file   : 16
    <121e>   DW_AT_decl_line   : 176
    <121f>   DW_AT_decl_column : 14
    <1220>   DW_AT_sibling     : <0x1258>
 <2><1224>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1225>   DW_AT_name        : (indirect string, offset: 0x8e145): osOK
    <1229>   DW_AT_const_value : 0
 <2><122a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <122b>   DW_AT_name        : (indirect string, offset: 0x8bcd0): osError
    <122f>   DW_AT_const_value : -1
 <2><1230>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1231>   DW_AT_name        : (indirect string, offset: 0x8a267): osErrorTimeout
    <1235>   DW_AT_const_value : -2
 <2><1236>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1237>   DW_AT_name        : (indirect string, offset: 0x8cf2f): osErrorResource
    <123b>   DW_AT_const_value : -3
 <2><123c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <123d>   DW_AT_name        : (indirect string, offset: 0x8aea3): osErrorParameter
    <1241>   DW_AT_const_value : -4
 <2><1242>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1243>   DW_AT_name        : (indirect string, offset: 0x8a66c): osErrorNoMemory
    <1247>   DW_AT_const_value : -5
 <2><1248>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1249>   DW_AT_name        : (indirect string, offset: 0x8af52): osErrorISR
    <124d>   DW_AT_const_value : -6
 <2><124e>: Abbrev Number: 26 (DW_TAG_enumerator)
    <124f>   DW_AT_name        : (indirect string, offset: 0x8c041): osStatusReserved
    <1253>   DW_AT_const_value : 0x7fffffff
 <2><1257>: Abbrev Number: 0
 <1><1258>: Abbrev Number: 6 (DW_TAG_typedef)
    <1259>   DW_AT_name        : (indirect string, offset: 0x8b36a): osStatus_t
    <125d>   DW_AT_decl_file   : 16
    <125e>   DW_AT_decl_line   : 185
    <125f>   DW_AT_decl_column : 3
    <1260>   DW_AT_type        : <0x1216>
 <1><1264>: Abbrev Number: 6 (DW_TAG_typedef)
    <1265>   DW_AT_name        : (indirect string, offset: 0x8b3fe): osThreadId_t
    <1269>   DW_AT_decl_file   : 16
    <126a>   DW_AT_decl_line   : 189
    <126b>   DW_AT_decl_column : 15
    <126c>   DW_AT_type        : <0xbea>
 <1><1270>: Abbrev Number: 6 (DW_TAG_typedef)
    <1271>   DW_AT_name        : (indirect string, offset: 0x8d17d): TZ_ModuleId_t
    <1275>   DW_AT_decl_file   : 16
    <1276>   DW_AT_decl_line   : 213
    <1277>   DW_AT_decl_column : 18
    <1278>   DW_AT_type        : <0x2fb>
 <1><127c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <127d>   DW_AT_byte_size   : 36
    <127e>   DW_AT_decl_file   : 16
    <127f>   DW_AT_decl_line   : 218
    <1280>   DW_AT_decl_column : 9
    <1281>   DW_AT_sibling     : <0x12fb>
 <2><1285>: Abbrev Number: 14 (DW_TAG_member)
    <1286>   DW_AT_name        : (indirect string, offset: 0x8d14a): name
    <128a>   DW_AT_decl_file   : 16
    <128b>   DW_AT_decl_line   : 219
    <128c>   DW_AT_decl_column : 33
    <128d>   DW_AT_type        : <0x109c>
    <1291>   DW_AT_data_member_location: 0
 <2><1292>: Abbrev Number: 14 (DW_TAG_member)
    <1293>   DW_AT_name        : (indirect string, offset: 0x8cf25): attr_bits
    <1297>   DW_AT_decl_file   : 16
    <1298>   DW_AT_decl_line   : 220
    <1299>   DW_AT_decl_column : 28
    <129a>   DW_AT_type        : <0x2fb>
    <129e>   DW_AT_data_member_location: 4
